[
    {
        "id": 1,
        "title": "Fact #1",
        "text": "Wesley Snipes, as Boar Man in the 1996 remake of <em>The Island of Dr. Moreau</em>, had his contract terminated following a series of aggressive, unscripted provocations to Marlon Brando’s character during the course of which Snipes allegedly gored the barely ambulant Brando from behind repeatedly with tusk implants that didn’t appear anywhere in the script.",
        "notes": "",
        "tags": [
            "island of doctor moreau",
            "marlon brando"
        ]
    },
    {
        "id": 2,
        "title": "Fact #2",
        "text": "Just before shooting <em>Blade</em>, Wesley Snipes auditioned for a recurring role in a series of Progressive auto insurance ads in which Snipes’ signature Cadillac Escalade was firebombed by a wisecracking masked figure many believe to have been been an out-of-work Emilio Estevez. The starring role eventually went to Estevez, fueling rumors that he was indeed the mystery arsonist. Though he could never prove it, Snipes never forgave Estevez, who was originally tapped to play Nick Peretti in <em>New Jack City II: The Return of Pookie</em>, a role which ultimately went to Alvin Lee Ritter.",
        "notes": "",
        "tags": [
            "alvin lee ritter",
            "blade",
            "emilio estevez",
            "new jack city",
            "progressive auto insurance"
        ]
    },
    {
        "id": 3,
        "title": "Fact #3",
        "text": "On the set of <em>New Jack City</em>, Wesley Snipes once defeated co-star Judd Nelson at chess. Snipes, a grand master in Puerto Rico, played blindfolded.",
        "notes": "",
        "tags": [
            "judd nelson",
            "many talents of wesley snipes",
            "new jack city",
            "puerto rico"
        ]
    },
    {
        "id": 4,
        "title": "Fact #4",
        "text": "Though he is frequently mistaken for a dwarf due to his dis&shy;proportionately large head, Wesley Snipes was in fact a pituitary midget.<sup>1</sup> Snipes addresses the issue in his memoir, <em>Snipes</em>.",
        "notes": "<sup>1</sup>Snipes stood 3’6” until he was twenty-two, when he sprouted to 3’8” following a number of aggressive Italian growth therapies.",
        "tags": [
            "pituitary midgetism",
            "snipes memoirs"
        ]
    },
    {
        "id": 5,
        "title": "Fact #5",
        "text": "On an unaired episode of <em>The Oprah Winfrey Show</em>, Wesley Snipes admitted to daring Richard Gere to bitch slap Sylvester Stallone on the set of <em>The Lords of Flatbush</em>. Instead, Gere droped a cold chicken thigh on Stallone. The rest is cinema history.",
        "notes": "",
        "tags": [
            "lords of flatbush",
            "richard gere",
            "sylvester stallone"
        ]
    },
    {
        "id": 6,
        "title": "Fact #6",
        "text": "Screen Actors Guild accountant Mervin Eldd was the first to suggest that the SAG excise Wesley Snipes’ footprints from the forecourt of Grauman’s Chinese Theater following allegations of tax evasion. The Guild unanimously ratified and executed Eldd’s suggestion within days of Snipes’ first appeal. Upon Snipes’ death in 2011, fellow pituitary midget and hotrod enthusiast Neil Young bought that segement of the sidewalk and installed it in one of his many garages in British Columbia, where it remains to this day, despite public protests by the Snipes Estate. Wesley Snipes was survived by his father, Lloyd Dooddee III, and by estate executor Richard Simmons, whose own footprints outside Grauman’s once overlooked Snipes’.",
        "notes": "",
        "tags": [
            "death",
            "lloyd doodee III",
            "mervin eldd",
            "neil young",
            "richard simmons",
            "tax evasion"
        ]
    },
    {
        "id": 7,
        "title": "Fact #7",
        "text": "A spokesman for the Red Lobster Seafood chain throughout the 1990s, Wesley Snipes later denied any involvement with the company. According to Snipes’ former publicist, Michael Devadi, Snipes had once been offered work for Red Lobster at the height of his career but refused it. Following Snipes’ death in prison, Devadi changed his official stance on Snipes’ Red Lobster work.",
        "notes": "",
        "tags": [
            "death",
            "michael devadi",
            "pituitary midgetism",
            "red lobster"
        ]
    },
    {
        "id": 8,
        "title": "Fact #8",
        "text": "Wesley Snipes’ original stage name, Delyle Butts, was taken from Delyle Snipes, a late uncle, and John Lee Butts, a Puerto Rican numbers runner who supplied Snipes with his first Koran.",
        "notes": "",
        "tags": [
            "delyle butts",
            "john lee butts",
            "puerto rico"
        ]
    },
    {
        "id": 9,
        "title": "Fact #9",
        "text": "In the Mile High Lounge of the Jean Lesange International Airport in Quebec, on a return trip from American Samoa, Wesley Snipes sipped from Celine Dion’s drink.",
        "notes": "",
        "tags": [
            "celine dion"
        ]
    },
    {
        "id": 10,
        "title": "Fact #10",
        "text": "In 2009, Wesley Snipes borrowed $10 from Jason “Jam-Master Jay” Mizell of Run-D.M.C. to purchase a pair of house sandals.",
        "notes": "",
        "tags": [
            "house sandals",
            "#jam master jay",
            "run-d.m.c."
        ]
    },
    {
        "id": 11,
        "title": "Fact #11",
        "text": "In prison Wesley Snipes became an avid potter. A retrospective of his works — casts of his own feet and genitals — will be held at the American Folk Art Museum in New York City in fall 2014.",
        "notes": "",
        "tags": [
            "feet and genital pottery",
            "many talents of wesley snipes"
        ]
    },
    {
        "id": 12,
        "title": "Fact #12",
        "text": "At the age of fourteen Snipes defeated heavy-weight boxing legend Joe Frazier at ping-pong in the San Juan Boys’ Club in Puerto Rico, where Snipes, on probation for truancy, maintained a snow cone concession. Snipes later claimed he had cheated by loading his paddle. A similar complaint would be brought against Snipes years later by martial arts legend Steven Seagal, who confronted Snipes at his own bankruptcy party in Chisnau, Moldova.",
        "notes": "",
        "tags": [
            "joe frazier",
            "puerto rico",
            "pugilism",
            "steven seagal"
        ]
    },
    {
        "id": 13,
        "title": "Fact #13",
        "text": "On the set of <em>Mo’ Better Blues</em>, Wesley Snipes measured his own penis at fourteen inches, in a flaccid state. Snipes would later claim that he had the only member in Hollywood which could fit in both of his front pockets simultaneously. Upon his death in 2011, it was confirmed that Snipes, who died with an erection, had a penis three times the length of his head. This is not uncommon among pituitary midgets.",
        "notes": "",
        "tags": [
            "mo’ better blues",
            "pituitary midgetism",
            "legendary penis"
        ]
    },
    {
        "id": 14,
        "title": "Fact #14",
        "text": "Before he was drawn to acting, Wesley Snipes studied kitchen design in Vevey, Switzerland. He was known to re-arrange his kitchen twice a year.",
        "notes": "",
        "tags": [
            "many talents of wesley snipes",
            "interior design"
        ]
    },
    {
        "id": 15,
        "title": "Fact #15",
        "text": "Wesley Snipes’ mother, Eleanor Yabwe, was a Yoruban voodoo priestess.",
        "notes": "",
        "tags": [
            "eleanor yabwe",
            "yoruban voodooism"
        ]
    },
    {
        "id": 16,
        "title": "Fact #16",
        "text": "Wesley Snipes was a beloved prison racconteur known throughout his pod for his spoken word interpretation of <em>Christmas with Burl Ives</em>.",
        "notes": "",
        "tags": [
            "burl ives",
            "many talents of wesley snipes"
        ]
    },
    {
        "id": 17,
        "title": "Fact #17",
        "text": "Prior to his death in 2011 in a prison tax revolt, Wesley Snipes prided himself on the fact that he had never paid for a pair of shoes. This was confirmed in an interview with Michigan-born funny man Sinbad at Snipes’ funeral in Cuidad Navidad, Puerto Rico, though in terms that Richard Simmons, who now manages the Snipes Estate, explicitly condemned.",
        "notes": "",
        "tags": [
            "death",
            "prison revolt",
            "puerto rico",
            "richard simmons",
            "sinbad"
        ]
    },
    {
        "id": 18,
        "title": "Fact #18",
        "text": "According to cycling champion George Hincapie, the “nègre mystérieux” bulging with human growth hormone documented by French TV crews during Stage 15 of the Tour de France in 2002 was Wesley Snipes. Snipes, Hincapie later testified, pedaled half of Lance Armstrong’s climb of Mount Ventoux before driving his bicycle into the bushes, out of which popped a superbly rested Armstrong.",
        "notes": "",
        "tags": [
            "george hincapie",
            "lance armstrong",
            "tour de france"
        ]
    },
    {
        "id": 19,
        "title": "Fact #19",
        "text": "Wesley Snipes’ infamous “twelve o’clock rule,” according to which any leftover catering was his at the stroke of midnight, was a source of confusion and later set-wide discord during the filming of <em>Timeline Mayo</em>.",
        "notes": "",
        "tags": [
            "twelve o’clock rule",
            "timeline mayo"
        ]
    },
    {
        "id": 20,
        "title": "Fact #20",
        "text": "Wesley Snipes only had one foot.",
        "notes": "",
        "tags": [
            "missing appendages"
        ]
    },
    {
        "id": 21,
        "title": "Fact #21",
        "text": "According to Wesley Snipes, director Robert Zemeckis never mistook him for a doorman at the Ritz-Carlton Grand Cayman. Rather, it was Snipes himself who mistook Zemeckis for Zemeckis’ second cousin Claude Zemeckis, a shady tort lawyer who was managing Snipes’ financial portfolio at the time.",
        "notes": "",
        "tags": [
            "claude zemeckis",
            "robert zemeckis"
        ]
    },
    {
        "id": 22,
        "title": "Fact #22",
        "text": "Just days before his death in prison, Wesley Snipes committed to a prison reality show showcasing his efforts to become the number one prison barber in his pod. The pilot for <em>Rough Cuts</em> was shown in a minimum security prison in Belize, where Snipes had once maintained a summer home, and in Puerto Rico.",
        "notes": "",
        "tags": [
            "death",
            "many talents of wesley snipes",
            "puerto rico",
            "reality tv",
            "rough cuts"
        ]
    },
    {
        "id": 23,
        "title": "Fact #23",
        "text": "Wesley Snipes’ single, <em>¡Muy Valoroso!</em>, a tribute to the late Harry Belafonte, sold over one million copies in Sweden.",
        "notes": "",
        "tags": [
            "estonia",
            "harry belafonte"
        ]
    },
    {
        "id": 24,
        "title": "Fact #24",
        "text": "<em>Days of Havoc</em>, a Kid Rock-helmed documentary following the hijinks of Snipes and his prison friend “Prince” Ted Naylor on the days leading up to the Snipes-led minimum security prison revolt in FCI McKean, was rumored to have interested Harvey Weinstein and the Weinstein Group briefly. At the bargaining table, however, Weinstein pulled out when it was brought to his attention that Snipes was dead.",
        "notes": "",
        "tags": [
            "days of havoc",
            "harvey weinstein",
            "kid rock",
            "prison friend ted naylor",
            "prison revolt"
        ]
    },
    {
        "id": 25,
        "title": "Fact #25",
        "text": "Snipes, a notorious prankster, once set director Bob Fosterman’s seat cushion on fire while Fosterman was directing the climactic final sequence of the 1999 cult film <em>The Bilking of Margolis</em>. Speculation is rampant as to why or how Snipes, who  had no part in the movie, was on the set to begin with.",
        "notes": "",
        "tags": [
            "bilking of margolis",
            "bob fosterman"
        ]
    },
    {
        "id": 26,
        "title": "Fact #26",
        "text": "Wesley Snipes didn’t learn how to read until the age of forty-six.",
        "notes": "",
        "tags": [
            "adult illiteracy"
        ]
    },
    {
        "id": 27,
        "title": "Fact #27",
        "text": "A lifelong Hot Wheels aficionado, Snipes had amassed more than twenty-two miles of racing track in his mansion in Cuidad Navidad, Puerto Rico, more than a third of which was moved to his prison cell when Snipes pleaded guilty to eighty-two counts of tax felony in 2009.<sup>1</sup>",
        "notes": "<sup>1</sup>Glimpses of Snipes’ prison race track can be seen in the Kid Rock documentary <em>Days of Havoc</em>, but only in the director’s cut.",
        "tags": [
            "days of havoc",
            "hot wheels",
            "kid rock"
        ]
    },
    {
        "id": 28,
        "title": "Fact #28",
        "text": "After the critical box office failure of <em>The Wiz</em> in 1978, Sidney Lumet offered Wesley Snipes the role of Pinocchio in his inner-city version of the classic Italian fairy tale. It was the only role Snipes ever regretted turning down.",
        "notes": "",
        "tags": [
            "sydney lumet",
            "pinocchio",
            "wiz"
        ]
    },
    {
        "id": 29,
        "title": "Fact #29",
        "text": "According to <em>Quinlan’s Abridged Dictionary of Film Facts</em> (2008 edition), Wesley Snipes was the only black pituitary midget to have starred in a vampire trilogy.",
        "notes": "",
        "tags": [
            "african-american midgets",
            "blade",
            "pituitary midgetism"
        ]
    },
    {
        "id": 30,
        "title": "Fact #30",
        "text": "In the notorious footage of Wesley Snipes’ final moments in the 2011 FCI McKean minimum security prison revolt, a stealthy figure thought to be Swedish tax evader Ulike Lundgren (brother of Dolph) is seen stepping over Snipes’ asphixiated corpse in his bare feet. According to Snipes’ then-agent Michael Devadi, who was the first to positively identify Snipes’ body in the prison garbage chute, it was indeed Lundgren. Devadi further claimed that Lundgren was the only inmate in Snipes’ wing who offered to help retrieve Snipes’ corpse from the garbage chute, earning him a spot on the funeral planning committee. Lundgren, witnesses remember, was also the original suggester of the rotating casket video featuring a voice-over by Alonso “Hamburger” Jones.",
        "notes": "",
        "tags": [
            "alonso hamburger jones",
            "death",
            "dolph lungren",
            "michael devadi",
            "prison revolt",
            "ulike lungren",
            "tax evasion"
        ]
    },
    {
        "id": 31,
        "title": "Fact #31",
        "text": "Wesley Snipes was a licensed distributor of <em>CocoMax</em>, a coconut-based scalp rejuvenator invented in Puerto Rico in 1979 by Doctor Salvator Benelingue. When alive, Snipes participated in two of the doctor’s wildly popular American infomercials, appearing in the “after” footage only.",
        "notes": "",
        "tags": [
            "cocomax scalp rejuvenator",
            "puerto rico",
            "salvator benelingue"
        ]
    },
    {
        "id": 32,
        "title": "Fact #32",
        "text": "Wesley Snipes hated rice and even the idea of rice.",
        "notes": "",
        "tags": [
            "phobias"
        ]
    },
    {
        "id": 33,
        "title": "Fact #33",
        "text": "During filming of the Sammy Davis, Jr. biopic <em>Life of the Party</em> (post-production) on location in prison, Snipes famously refused voice coach Steve Donovan’s training, instead hiring Delroy Lindo to dub his lines in Barbadian. Critics of Lindo’s West Indian take on Davis’ speech have likened Snipes’ creative license to Ray Liotta’s infamous, short-run <em>Hamlet Prince of Bensonhurst</em>.",
        "notes": "",
        "tags": [
            "delroy lindo",
            "hamlet prince of bensonhurst",
            "life of the party",
            "ray liotta",
            "sammy davis jr."
        ]
    },
    {
        "id": 34,
        "title": "Fact #34",
        "text": "Hollywood guru to the stars Mohan Mohan was once seen with Wesley Snipes at the Vegas Seafood Buffet in Glendale, California. Close friends of Mohan Mohan later claimed that Mohan Mohan complained for months after the encounter that Snipes had casually removed food from his plate with an extendable fork.",
        "notes": "",
        "tags": [
            "mohan mohan"
        ]
    },
    {
        "id": 35,
        "title": "Fact #35",
        "text": "Prior to his death by stampede and then decapitation<sup>1</sup> in the ill-fated minimum-security prison revolt of which he was the chief instigator and captain, Wesley Snipes had accumulated over 300 shoe boxes’ worth of pipe cleaner in a variety of colors and resistances. According to Mike Lopane, a fellow collector, Snipes’ pipe cleaner collection was “impressive.”",
        "notes": "<sup>1</sup>Snipes’ corpse was discovered days after the fact in the prison garbage chute alongside his prison friend “Prince” Ted Naylor and pod boss Boris Carradine. An autopsy later revealed that Snipes had been decapitated and his head replaced with a lifelike wax replica.",
        "tags": [
            "death",
            "mike lopane",
            "pipe cleaner collections",
            "prison friend ted naylor",
            "prison revolt"
        ]
    },
    {
        "id": 36,
        "title": "Fact #36",
        "text": "For his on-stage saxophone scenes as Shadow Henderson in Spike Lee’s <em>Mo’ Better Blues</em>, Wesley Snipes, a pituitary midget, was hoisted into the air by a complex web of cables and hasps attached to his suits via special shoulder flaps. When he wasn’t elevated in this way, Lee made sure to hold the camera at a tilt when filming Snipes from below, an effect veteran film critics would later mistakenly ascribe to Shadow Henderson’s “pretentiousness.”",
        "notes": "",
        "tags": [
            "mo’ better blues",
            "pituitary midgetism",
            "shadow henderson",
            "spike lee"
        ]
    },
    {
        "id": 37,
        "title": "Fact #37",
        "text": "On the set of <em>Duane Roger Bliss</em>, Eric Roberts reported to at least three of the eight producers of the film that Wesley Snipes had made him sleep in a tent prior to shooting the notorious cabin scene in which Roberts’ character Roy “Big Meadow” Narrows is harassed and then forced to flee his home on a flaming mattress equipped with a faulty outboard motor. Snipes’ agent at the time, Michael Devadi, claimed otherwise, insisting that the “tent clause” was 1) a contractual obligation Roberts was well aware of prior to shooting, and 2) no different from the tent clauses stipulated in any Snipes-produced film. Shooting on <em>Duane Roger Bliss</em> was postponed in 2009 when Snipes was incarcerated for eighty-two counts of tax evasion and two counts of grand larceny. Upon Snipes’ death and decapitation and the retrieval of his corpse from a Pennsylvania minimum security prison garbage chute, the role of Duane Roger Bliss was offered to Alfonso Ribeiro.",
        "notes": "",
        "tags": [
            "alfonso ribeiro",
            "death",
            "duane roger bliss",
            "eric roberts",
            "michael devadi",
            "tax evasion"
        ]
    },
    {
        "id": 38,
        "title": "Fact #38",
        "text": "In 1987, when fellow African American midget Emmanuel Lewis was nominated for Exceptional Performance by a Young Actor Starring in a Television Comedy or Drama Series and lost to seventeen-year-old Kirk Cameron, Wesley Snipes famously boycotted the award, sending Cameron a cellophane-wrapped gifts of his own feces in the mail from a P.O. box in Melverton, Barbados. Cameron would later cite this episode as grist for his infamous “mo’ better n*****” remark at a Waffle House in Krafton, Illinois, which cost him both his award and his starring role on <em>Growing Pains</em>. Cameron and Snipes eventually reconciled their differences in 1991 on the set of <em>New Jack City</em>, when Cameron auditioned for, but ultimately failed to land, the roles of Kid on a Stoop Four and Recovering Addict Two.",
        "notes": "",
        "tags": [
            "african-american midgets",
            "emmanuel lewis",
            "kirk cameron",
            "new jack city"
        ]
    },
    {
        "id": 39,
        "title": "Fact #39",
        "text": "It is said that for the role of Roemello Skuggs in <em>Sugar Hill</em> Wesley Snipes learned to chew food on the left side of his mouth.",
        "notes": "",
        "tags": [
            "romello skuggs",
            "sugar hll"
        ]
    },
    {
        "id": 40,
        "title": "Fact #40",
        "text": "An original investor in, and spokesman for, <em>Menthorice</em>, a nicotine-infused, menthol-flavored licorice candy, Wesley Snipes quickly assumed full credit for the invention of the product down to its unique chemical formula, nudging out collaborator Bo-Rat Winslow, a Mississippian. In prison, prior to his asphyxiation, impaling, beheading, and the eventual replacement of his head with a life-like replica, Snipes apologized to Winslow, who notoriously spat on Snipes’ missing right foot.",
        "notes": "",
        "tags": [
            "bo-rat winslow",
            "menthorice"
        ]
    },
    {
        "id": 41,
        "title": "Fact #41",
        "text": "When VICE co-creator Ryan Duffy first heard of Wesley Snipes’ decapitation in the now-infamous Snipes-led FCI McKean minimum security prison revolt, he asked NBA great Dennis Rodman to accompany him and Shane Smith to Pyongyang to meet with North Korean leader Kim Jong-un. It was only after days of nearly futile bargaining that Kim Jong-un, whose official titles included World’s Most Esteemed and Glorious Fan of Wesley Snipes, accepted the last-minute exchange. According to Duffy, Kim Jong-un’s offer to host and then add Snipes’ head to his collection of Snipes memorabilia was only partly true.",
        "notes": "",
        "tags": [
            "death",
            "dennis rodman",
            "kim jung-un",
            "prison revolt",
            "ryan duffy",
            "shane smith"
        ]
    },
    {
        "id": 42,
        "title": "Fact #42",
        "text": "Wesley Snipes was shot in the hand by his chauffeur and common-law wife Jelatine Moody<sup>1</sup> while adjusting the antenna of his 1987 Cadillac Fleetwood, which had stopped working at traffic lights.",
        "notes": "<sup>1</sup>Daughter of Duncan Moody, the mobility scooter mogul",
        "tags": [
            "jelatine moody",
            "michael devadi"
        ]
    },
    {
        "id": 43,
        "title": "Fact #43",
        "text": "Before shooting their ill-fated Star Trek parody training video, the IRS had originally conceived of a public service announcement read by Wesley Snipes from the prison shower.",
        "notes": "",
        "tags": [
            "star trek",
            "tax evasion"
        ]
    },
    {
        "id": 44,
        "title": "Fact #44",
        "text": "Wesley Snipes was a comedian’s comedian.",
        "notes": "",
        "tags": [
            "many talents of wesley snipes"
        ]
    },
    {
        "id": 45,
        "title": "Fact #45",
        "text": "In Puerto Rico there is a cigar named after Wesley Snipes. According to Snipes’ stepfather, Doodee Snipes, that cigar is actually Cuban.",
        "notes": "",
        "tags": [
            "cuban cigars",
            "doodee snipes",
            "puerto rico"
        ]
    },
    {
        "id": 46,
        "title": "Fact #46",
        "text": "In many villages in Afghanistan and Pakistan the most popular baby name, regardless of sex, is Wesley Snipes.",
        "notes": "",
        "tags": [
            "muslim naming habits"
        ]
    },
    {
        "id": 47,
        "title": "Fact #47",
        "text": "Wesley Snipes once put out a fire with his teeth.",
        "notes": "",
        "tags": [
            "many talents of wesley snipes"
        ]
    },
    {
        "id": 48,
        "title": "Fact #48",
        "text": "Wesley Snipes was the first inmate of a U.S. minimum security prison to sit on death row for tax evasion. Snipes’ sentence was eventually commuted to eight concurrent life sentences, of which he served six years before his death.",
        "notes": "",
        "tags": [
            "death",
            "tax evasion"
        ]
    },
    {
        "id": 49,
        "title": "Fact #49",
        "text": "Kid Rock’s prison-made <em>The Drying Line</em>, starring Wesley Snipes as Rudy Bucket, a low-level IRS informant suffering from genital lupus, was shot entirely inside FCI McKean.",
        "notes": "",
        "tags": [
            "drying line",
            "genital lupus",
            "kid rock"
        ]
    },
    {
        "id": 50,
        "title": "Fact #50",
        "text": "The Ben and Jerry’s ice cream flavor “Snippity Snipes” was recalled the day it hit stores in May 1993 when critics claimed the triple chocolate fudge ice cream resembled “an asphalt road on a moonless night punctuated here and there by bright white marshmallow teeth.”",
        "notes": "",
        "tags": [
            "ben and jerry’s"
        ]
    },
    {
        "id": 51,
        "title": "Fact #51",
        "text": "While in prison for tax evasion, Wesley Snipes amassed a small fortune in favors by selling his Delta sky miles to unsuspecting prisoners. According to U.S. law, it’s illegal for former felons to collect sky miles.",
        "notes": "",
        "tags": [
            "tax evasion",
            "prison scams"
        ]
    },
    {
        "id": 52,
        "title": "Fact #52",
        "text": "In 2005, Wesley Snipes was inducted into Cleveland’s prestigious Helion Society, then the premier club for African-American actors of Barbadian descent. Controversy erupted four years later when, in the society’s annual members letter, Snipes’ current employment was listed as “prisoner.” Snipes’ publicist Michael Devadi cancelled Snipes’ membership immediately, an ultimately futile gesture as the label stuck. A year later Snipes was dead. The Helion Society neglected to include a Snipes obituary in that year’s members letter, referring to Snipes dismissively as a “greedy Floridian dwarf.” Snipes was a pituitary midget.",
        "notes": "",
        "tags": [
            "barbadian actors",
            "helion society",
            "michael devadi",
            "pituitary midgetism"
        ]
    },
    {
        "id": 53,
        "title": "Fact #53",
        "text": "Herve Villechaize once challenged Wesley Snipes to an arm-wrestling match in his bathtub.",
        "notes": "",
        "tags": [
            "herve villechaize",
            "arm-wrestling midgets"
        ]
    },
    {
        "id": 54,
        "title": "Fact #54",
        "text": "Oprah Winfrey, Wesley Snipes’ aunt through a third marriage, is also a pituitary midget.",
        "notes": "",
        "tags": [
            "oprah winfrey",
            "pituitary midgetism"
        ]
    },
    {
        "id": 55,
        "title": "Fact #55",
        "text": "At the urging of fellow snow cone vendor Jerome “Papa” Wedi, Wesley Snipes applied for his first Mensa membership in San Juan, Puerto Rico, at the age of sixteen. He was rejected. He periodically reapplied throughout his life, including during his incarceration. Snipes’ total number of Mensa rejections, 196, earned him a Golden Hermes paperweight, which when brandished at participating restaurants within the continental United Sates, entitled Snipes to ten-percent discounts on his bills and to free desserts.",
        "notes": "",
        "tags": [
            "jerome papa wedi",
            "mensa rejections",
            "puerto rico"
        ]
    },
    {
        "id": 56,
        "title": "Fact #56",
        "text": "Wesley Snipes met future collaborator Guillermo del Toro at Hundred Acre Links in Nesbit, Utah, where Snipes was del Toro’s caddy. According to del Toro’s brother-in-law Gene Hinkel, a Mormon property developer, Snipes was a mediocre and often unwilling helper.",
        "notes": "",
        "tags": [
            "gene hinkel",
            "guillermo del toro",
            "mormon property developers"
        ]
    },
    {
        "id": 57,
        "title": "Fact #57",
        "text": "Wesley Snipes was born D. Neville Butts to Betty Arias, a washwoman, and Lloyd Doodee III, an itinerant Salvation Army trumpeter visiting Puerto Rico from Mississippi.",
        "notes": "",
        "tags": [
            "betty arias",
            "d. neville butts",
            "lloyd doodee III",
            "puerto rico"
        ]
    },
    {
        "id": 58,
        "title": "Fact #58",
        "text": "According to fellow prankster and Hollywood little man Emmanuel Lewis, Wesley Snipes was not invited to Camille Paglia’s 60th birthday party on Fire Island.",
        "notes": "",
        "tags": [
            "camille paglia",
            "emmanuel lewis"
        ]
    },
    {
        "id": 59,
        "title": "Fact #59",
        "text": "A recreational user of Certs, Snipe’s go-to breath fresheners while on set were jelly-filled hospitality mints.",
        "notes": "",
        "tags": [
            "breath mints"
        ]
    },
    {
        "id": 60,
        "title": "Fact #60",
        "text": "In a rousing speech given just days before the minimum security prison revolt in which he perished in the prison garbage chute, Wesley Snipes referred to President Barack Obama, who had refused to pardon him, as “that house nigger.”",
        "notes": "",
        "tags": [
            "death",
            "barack obama",
            "house niggers",
            "prison revolt"
        ]
    },
    {
        "id": 61,
        "title": "Fact #61",
        "text": "According to his own genealogical research, Snipes was related on the Doodee side of the family to Billy Bowlegs III, a.k.a Billy Fewell, a.k.a Cofehapkee, a Seminole wise man and pituitary midget.",
        "notes": "",
        "tags": [
            "pituitary midgetism",
            "seminole nation"
        ]
    },
    {
        "id": 62,
        "title": "Fact #62",
        "text": "In the ill-fated Ron Howard riverboat odyssey <em>Long Rain Coming</em>, Wesley Snipes was to play laconic innkeeper Johnny Fiver, who only spoke in Welsh riddles.",
        "notes": "",
        "tags": [
            "long rain coming",
            "ron howard bombs"
        ]
    },
    {
        "id": 63,
        "title": "Fact #63",
        "text": "When traveling in inclement weather, Wesley Snipes preferred a two-piece rain outfit, generally a khaki rubber coat and bucket hat.",
        "notes": "",
        "tags": [
            "rain clothes"
        ]
    },
    {
        "id": 64,
        "title": "Fact #64",
        "text": "Wesley Snipes was not a Rhodes Scholar.",
        "notes": "",
        "tags": [
            "midget celebrities who weren’t Rhodes scholars"
        ]
    },
    {
        "id": 65,
        "title": "Fact #65",
        "text": "It is said that Wesley Snipes achieved total ketosis at least twice in his life.",
        "notes": "",
        "tags": [
            "ketosis"
        ]
    },
    {
        "id": 66,
        "title": "Fact #66",
        "text": "Days into shooting <em>Bad Inc.</em>, Christopher Lambert’s French valet Louis Cormand refused Wesley Snipes entrance onto the set after confusing Snipes’ heavily truncated Porsche Cayenne for an elaborate golf cart.",
        "notes": "",
        "tags": [
            "bad inc.",
            "christoper lambert",
            "louis cormand"
        ]
    },
    {
        "id": 67,
        "title": "Fact #67",
        "text": "Wesley Snipes was an early believer in Dr. Jerry Menzel’s buttocks firming machine,<em>The Jiggler</em>, and along with Dr. Earl Crispi, a cosmetic surgeon from Plano, Texas, became a primary investor. In a statement by Snipes’ then-agent Michael Devadi, Snipes was unaware that Menzel had modeled the concept of the <em>Jiggler</em> on <em>The Weeping Buttocks Machine</em> (transl.), an Italian buttocks toning machine available on the Italian market since 1962. The two machines were similar enough to warrant an expensive international lawsuit filed by American investors on behalf of Dr. Luigi Puisposgli, the inventor of the original <em>Weeping Buttocks Machine</em>. Dr. Puisposgli died before a settlement was reached, prompting Snipes to falsely report his court-ordered restitution payment to the Puisposgli Estate as a charitable donation.",
        "notes": "",
        "tags": [
            "dr. luigi puisposgli",
            "earl crispi",
            "jerry menzel",
            "weeping buttocks machine"
        ]
    },
    {
        "id": 68,
        "title": "Fact #68",
        "text": "In an 2004 interview with Telefónica Seven, a Chilean chat program, actor Charlie Sheen claimed to have never heard of Wesley Snipes.",
        "notes": "",
        "tags": [
            "charlie sheen"
        ]
    },
    {
        "id": 69,
        "title": "Fact #69",
        "text": "For the role of Sidney Deane in <em>White Men Can’t Jump</em>, Wesley Snipes, a pituitary midget, wore a pair of elevator shoes designed by Dino De Laurentiis’ brother-in-law, Fred Contestis, a Mission City cobbler.",
        "notes": "",
        "tags": [
            "pituitary midgetism",
            "white men can’t jump"
        ]
    },
    {
        "id": "alert",
        "title": "Alert!",
        "text": "A Wesley Snipes “Still Living Hoax” has been circulating on the Internet. To be clear: this is a hoax. Wesley Snipes is dead. He died in a minimum security prison revolt in the garbage chute of the Ban-Lon wing where life-like effigies of his body and head were recovered by lifelong collaborator and fellow pituitary midget Ethan Hawke. Snipes himself is believed to be circulating through South East Asia as a headless mummy with a string-activated voice featuring a squawky, foreign-sounding imitation of the deceased actor’s “chocolate baritone.”",
        "notes": "",
        "tags": [
            "death",
            "ethan hawke",
            "pituitary midgetism",
            "prison revolt",
            "snipes hoaxes"
        ]
    },
    {
        "id": 70,
        "title": "Fact #70",
        "text": "When he was falsely identified as the “sockless ninja” on episode 198 of John Walsh’s hit TV show <em>America’s Most Wanted</em>, Wesley Snipes didn’t immediately sue the Fox Television Network. It was only after Walsh made repeated references to the perpetrator’s stupidity at attempting to rob a cashier at a Cheese King in Pittsboro, West Virginia, using just his naked left foot that Snipes took umbrage. The “sockless ninja” was subsequently discovered to be Rudy Bob Baker, a local miscreant.",
        "notes": "",
        "tags": [
            "america’s most wanted",
            "john walsh",
            "pituitary midgetism"
        ]
    },
    {
        "id": 71,
        "title": "Fact #71",
        "text": "Wesley Snipes’ first critically acclaimed role was his portrayal of Mr. Barudi’s one-legged helper, Little Carlos, on the long-running Puerto Rican children’s drama <em>Avenida Zogata (The Street with Potholes)</em>, about a group of orphaned street musicians who move from town to town with Mr. Barudi performing miracles. Snipes, who was twenty-three at the time, was just coming to grips with his pituitary midgetism.",
        "notes": "",
        "tags": [
            "avenida zogata",
            "little carlos",
            "pituitary midgetism",
            "puerto rican TV shows"
        ]
    },
    {
        "id": 72,
        "title": "Fact #72",
        "text": "In Andus Sepp’s cultural biography of Wesley Snipes, <em>The Snipes Effect</em>, Guillermo del Toro, a Mexican pituitary midget, cited Snipes’ improvised use of a cape in his portrayal of ostracized Louisiana candy factory employeee Ed Balfour in <em>The Last Days of Bobo Stein</em> as the inspiration for <em>Blade</em>, the first vampire film to feature a caped African-American pituitary midget in a starring role.",
        "notes": "",
        "tags": [
            "andus sepp",
            "blade",
            "ed balfour",
            "guillermo del toro",
            "last days of bobo stein",
            "mexican midgets",
            "pituitary midgetism",
            "snipes effect"
        ]
    },
    {
        "id": 73,
        "title": "Fact #73",
        "text": "Wesley Snipes was the legal child of the late Surgeon General C. Everett Koop, who met and later adopted Snipes after the two starred in a series of Department of Health public service announcements lambasting the men’s beard and mustache brush-in color gel industry.",
        "notes": "",
        "tags": [
            "c. everett koop"
        ]
    },
    {
        "id": 74,
        "title": "Fact #74",
        "text": "To prepare himself for the role of Lenny Herrera, a legally blind astronaut lost in a space station ventilation duct for weeks, Wesley Snipes boiled and drank his own urine for three months.",
        "notes": "",
        "tags": [
            "legend of lenny herrera"
        ]
    },
    {
        "id": 75,
        "title": "Fact #75",
        "text": "Wesley Snipes was a close friend and supporter of Dimestore Jim Tchipitoulas, the itinerant antiques maven whose antiques obsession long predated <em>The Antique Roadshow</em>. Following Snipes’ arraignment for tax fraud, Tchipitoulas publicly offered to auction off his personal collection of vintage Sunbeam toasters and donate the money to the Snipes household. In total, it is believed Tchipitoulas offset Snipes’ court-ordered fines — $7 million — by $2,340, a substantial sum for Tchipitoulas, who had been living out of a Free Spirit Leisure Van since 1982.",
        "notes": "",
        "tags": [
            "antique road show",
            "dimestore jim tchipitoulas",
            "tax evasion"
        ]
    },
    {
        "id": 76,
        "title": "Fact #76",
        "text": "In 1993, following the box office success of <em>New Jack City</em>, Wesley Snipes teamed up with celluloid nemesis Judd Nelson to produce a pilot for a primetime television show called <em>Uppity Jones</em>, in which Nelson was to play Mick Rover, an out-of-work Jewish date fixer, and Snipes Uppity Jones, a disgruntled former client of Rover’s, now divorced and sharing an apartment with Rover’s sex-crazed grandmother.",
        "notes": "",
        "tags": [
            "judd nelson",
            "new jack city",
            "uppity jones"
        ]
    },
    {
        "id": 77,
        "title": "Fact #77",
        "text": "According to one-time publicist Michael Devadi, Wesley Snipes had read up to page 516 of the beloved Spanish classic <em>Don Quixote</em> (Grossman edition) numerous times only to turn back — struck by an unnamed fear — and start over again. Despite suggestions from friends and (once) from fellow African-American Hollywood (thyroidal) midget Carl Weathers to stop reading at page 515, skip 516, and pick back up at 517, Snipes, a notorious perfectionist, clung to this ultimately self-defeating approach to the book.",
        "notes": "",
        "tags": [
            "carl weathers",
            "don quixote",
            "michael devadi",
            "thyroidal midgets"
        ]
    },
    {
        "id": 78,
        "title": "Fact #78",
        "text": "There is a Puerto Rican space opera chronicling the exploits of Wesley Snipes’ feckless efforts at tax evasion. In the opera, <em>Big Wise Guys of the Universe</em>, a character named “Snipes” motors to distant pockets of the universe on a pair of fusion-propelled rollerskates inciting short-lived “tax revolutions.”",
        "notes": "",
        "tags": [
            "big wise guys of the universe",
            "puerto rican space operas",
            "tax evasion"
        ]
    },
    {
        "id": 79,
        "title": "Fact #79",
        "text": "The original creator of the failed reality TV show <em>Uncle</em> was Wesley Snipes. In the show, ordinary citizens with intrapersonal grievances would challenge each other to fights in which only knuckle bending was allowed. By the time the show made it to the final round of negotiations, hitmaker Brad Filqetost refused to get involved, citing Snipes’ knuckle bending as his main objection. Filqetost would later go on to create a <em>Survivor</em> spinoff whose contestants were all irate supermarket managers, and <em>Warbucks</em>, a glipse into the thriving Milwaukee subculture of bald millionaires with adopted red-headed children.",
        "notes": "",
        "tags": [
            "brad filqetost",
            "reality tv",
            "survivor spinoffs",
            "uncle",
            "warbucks"
        ]
    },
    {
        "id": 80,
        "title": "Fact #80",
        "text": "Wesley Snipes was the voice of Elmo.",
        "notes": "",
        "tags": [
            "elmo"
        ]
    },
    {
        "id": 81,
        "title": "Fact #81",
        "text": "In 2009, Wesley Snipes was released from prison for four days to fly to New Delhi to shoot martial arts legend Steven Seagal’s nighttime hand scenes in the 2010 sleeper <em>Supplanted Evidence</em>.<sup>1</sup>",
        "notes": "<sup>1</sup>Released in India in 2011 as <em>Pocket Funds</em> and in Pakistan and Bangladesh as <em>The Curious Case of Benjamin Button 2</em>.",
        "tags": [
            "germophobia",
            "steven seagal",
            "supplanted evidence"
        ]
    },
    {
        "id": 82,
        "title": "Fact #82",
        "text": "Before he was shut down in one of Mayor Koch’s notorious shell game sting operations, Wesley Snipes performed in Greenwhich Village’s Washington Square Park as “Louis Two the Original Organ Grinder’s Monkey.” Other famous Manhattan organ grinder’s monkeys include Fyodor Dostoevsky, V.S. Naipul, and Eric Roberts, a.k.a. Louis One, the Original Organ Grinder’s Monkey.",
        "notes": "",
        "tags": [
            "ed koch",
            "eric roberts",
            "fyodor Dostoevsky",
            "many talents of wesley snipes",
            "organ grinder’s monkeys",
            "v.s. naipul"
        ]
    },
    {
        "id": 83,
        "title": "Fact #83",
        "text": "In 1994, Wesley Snipes purchased a multimillion-dollar Malibu villa once owned, but never actually vacated, by actor Mickey Rourke, who continued to inhabit a room in the basement with his drum kit and legendary Hai Karate after shave collection for over a decade.",
        "notes": "",
        "tags": [
            "aftershave collections",
            "mickey rourke"
        ]
    },
    {
        "id": 84,
        "title": "Fact #84",
        "text": "In a critical moment in the Richard Dreyfuss-produced screwball comedy <em>Downtime</em>, Wesley Snipes (Little Boy Bufus) professes a natural fondness for drapes over Venetian-style blinds. The original script called for a fondness for blinds.",
        "notes": "",
        "tags": [
            "downtime",
            "little boy bufus",
            "richard dreyfuss"
        ]
    },
    {
        "id": 85,
        "title": "Fact #85",
        "text": "<em>Codename Newtown</em> (in post-production when Wesley Snipes perished in a garbage chute during a minimum security prison revolt at FCI McKean) saw Snipes pairing off against himself as the Nigerian-born Mbongo Twins, Adelbert and Rufus Mbongo, arrested in 2003 in Marseilles and charged with defrauding over 70,000 French pensioners in a scam that came to be known as the Prince Moses of Togo Letter. Over the course of nine inter-prison visits, Snipes mastered the Mbongo’s signature mannerisms so thoroughly that once, for fun, he sucessfully escaped prison posing as both Mbongo Twins simultaneously.",
        "notes": "",
        "tags": [
            "codename newtown",
            "death",
            "mbongo twins",
            "prince moses of togo letter",
            "prison revolt",
            "prison scams"
        ]
    },
    {
        "id": 86,
        "title": "Fact #86",
        "text": "Until his death, Wesley Snipes was the legal son of fitness guru Richard Simmons.",
        "notes": "",
        "tags": [
            "death",
            "richard simmons"
        ]
    },
    {
        "id": 87,
        "title": "Fact #87",
        "text": "Wesley Snipes’ deeply personal one-man show, <em>In a Manner of Speaking</em>, was the first of its kind in Barbados. The 2001 performance acknowledged in an intimate yet amusing way Snipes’ struggles with his midgetism, which until then he had kept hidden from even his closest friends. Mariah Carey, also a midget of Barbadian descent, cited Snipes’ gutsiness in handling the subject as a major reason for her decision to leave the circus and pursue a career in Hollywood.",
        "notes": "",
        "tags": [
            "in a manner of speaking",
            "barbadian midgets",
            "mariah carey",
            "pituitary midgetism"
        ]
    },
    {
        "id": 88,
        "title": "Fact #88",
        "text": "Kim Kardashian’s left buttock, Hammond Organ, was originally named after Wesley Snipes.",
        "notes": "",
        "tags": [
            "kim kardashian",
            "kim kardashian buttocks"
        ]
    },
    {
        "id": 89,
        "title": "Fact #89",
        "text": "In 2011, Wesley Snipes was scheduled to appear on a special <em>Jeopardy Tax Evaders Edition</em>, Jeopardy host Alex Trebek’s spinoff series of extreme Jeopardy challenges, but was decapitated in prison before filming.",
        "notes": "",
        "tags": [
            "alex trebek",
            "death",
            "tax evasion"
        ]
    },
    {
        "id": 90,
        "title": "Fact #90",
        "text": "The answer to seven down on the March 23rd 2001 <em>New York Times</em> crossword puzzle — “African American little person half-living and half-dead” — was not, as many readers insisted, Wesley Snipes, but Gary Coleman, who had just starred in a limited engagement run of <em>The Menials</em>, in which he played a dwarf frozen in a life-sized cube of ice but later revived.",
        "notes": "",
        "tags": [
            "gary coleman",
            "frozen dwarves",
            "menials"
        ]
    },
    {
        "id": 91,
        "title": "Fact #91",
        "text": "Wesley Snipes collaborated with Bruce Boxleitner on an early version of <em>Snakefish Terror</em> called <em>Termite 179</em> in which Snipes’ character Robby Robbleroy, a retired LAPD bomb squad captain, was lured onto speeding Elder Hostel bus #179, which would be flooded with African cannibal termites should the bus slow to a speed under fifty miles per hour. According to Boxleitner, who financed early drafts of the script, Snipes refused to work with Gary Busey, Boxleitner’s choice for the psychopathic criminal mastermind behind the cannibal termites.",
        "notes": "",
        "tags": [
            "bruce boxleitne",
            "gary busey",
            "termite 179"
        ]
    },
    {
        "id": 92,
        "title": "Fact #92",
        "text": "An avid James Clavell memorabilia collector, Wesley Snipes placed the winning bid (by proxy) on a Pommelroy soaking tub in which Clavell was said to have dictated an early draft of <em>Tai Pan</em>.",
        "notes": "",
        "tags": [
            "james clavell",
            "pommelroy tubs",
            "tai pan"
        ]
    },
    {
        "id": 93,
        "title": "Fact #93",
        "text": "Snipes owned nine Nordstrom customer loyalty cards under the name Kenny Rogers.",
        "notes": "",
        "tags": [
            "kenny rogers"
        ]
    },
    {
        "id": 94,
        "title": "Fact #94",
        "text": "During his lifetime Wesley Snipes siphoned much of his taxable wealth into Selbane Laboratories, a manufacturer of battery-operated Kwanzaa candles whose primary shareholders at the time of Snipes’ beheading were Diane Wiest and Kimbal Musk.",
        "notes": "",
        "tags": [
            "diane wiest",
            "kimbal musk",
            "prison revolt",
            "selbane laboratories"
        ]
    },
    {
        "id": 95,
        "title": "Fact #95",
        "text": "Snipes’ son Akhenaten Kihwa-T Snipes is also a pituitary midget.",
        "notes": "",
        "tags": [
            "akhenaten kihwa-t snipes",
            "pituitary midgetism"
        ]
    },
    {
        "id": 96,
        "title": "Fact #96",
        "text": "Wesley Snipes’ cameo in Michael Jackson’s 1987 music video <em>Bad</em> was eventually cut on the advice of Paula Abdul over concerns that Snipes’ kung fu-inspired dancing would upstage Jackson’s. The deleted Snipes scene appears in the uncut version of <em>Bad</em> released after Jackson’s death. Snipes is the dancing midget in the orange parachute pants.",
        "notes": "",
        "tags": [
            "african-american midgets",
            "michael jackson",
            "paula abdul",
            "pituitary midgetism"
        ]
    },
    {
        "id": 97,
        "title": "Fact #97",
        "text": "In 2009, via closed-circuit prison TV, Wesley Snipes was honored in absentia with a lifetime achievement award from the Metropolitan Detention Center in Guayanabo, Puerto Rico.",
        "notes": "",
        "tags": [
            "puerto rico"
        ]
    },
    {
        "id": 98,
        "title": "Fact #98",
        "text": "Wesley Snipes was a master of Pig Latin.",
        "notes": "",
        "tags": [
            "many talents of wesley snipes",
            "pig latin"
        ]
    },
    {
        "id": 99,
        "title": "Fact #99",
        "text": "In 2002, Wesley Snipes bankrolled a reality show for Canal Nuevo in Puerto Rico called <em>Quitting Time</em> (English translation). Cashing in on the wild popularity of quitting shows in Sweden, <em>Quitting Time</em> featured unhappy Puerto Rican workers berating their abusive employers, who then chose, on the basis of the arguments they heard, to either give them a raise or accept their resignation.",
        "notes": "",
        "tags": [
            "puerto rico",
            "quitting time",
            "reality tv"
        ]
    },
    {
        "id": 100,
        "title": "Fact #100",
        "text": "Lil Dudley’s clone in <em>You Say, I Say</em>, the midget rapper’s first number-one hit in Puerto Rico, wasn’t Wesley Snipes, as many believe, but S.S. Samuels, Wesley Snipes’ stunt double.",
        "notes": "",
        "tags": [
            "lil dudley",
            "midget rappers",
            "s.s. samuels"
        ]
    },
    {
        "id": 101,
        "title": "Fact #101",
        "text": "In 1977, Wesley Snipes brought an Earl Scheib-like franchise called Motoya’s to San Juan, Puerto Rico, where a standard, no-frills paint job cost just $24.99. It was later discovered by vigilante accountant Oscar Ledesma that Motoya’s was actually a pyramid scheme. By late 1978, for every third citizen of Puerto Rico, two Motoya’s paint jobs were circulating.",
        "notes": "",
        "tags": [
            "earl scheib",
            "oscar ledesma",
            "puerto rico"
        ]
    },
    {
        "id": 102,
        "title": "Fact #102",
        "text": "With the exception of his first son, Akhenaten Kihwa-T Snipes, and his fifth son, Bartleby the Scrivener Snipes, all of Wesley Snipes’ first ten documented children are named Wesley Snipes.",
        "notes": "",
        "tags": [
            "akhenaten kihwa-t snipes",
            "bartleby the scrivener snipes"
        ]
    },
    {
        "id": 103,
        "title": "Fact #103",
        "text": "In the hours preceding a thunderstorm, Wesley Snipes’ eyeballs weighed more than this testicles, a condition known as pituitary hypoorchidism.",
        "notes": "",
        "tags": [
            "pituitary hypoorchidism"
        ]
    },
    {
        "id": 104,
        "title": "Fact #104",
        "text": "Wesley Snipes was an avid equestrian. Following his death and decapitation in a minimum security prison revolt, his horse, a pygmy Shetland pony named Mnguni Two, was purchased by Prince Charles of England.",
        "notes": "",
        "tags": [
            "death",
            "many talents of wesley snipes",
            "prison revolt",
            "prince charles",
            "pygmy shetland ponies"
        ]
    },
    {
        "id": 105,
        "title": "Fact #105",
        "text": "Vetted for the role of Tattoo in <em>Return to Fantasy Island</em>, Wesley Snipes ultimately lost out to Armand Assante, a Hodgson’s dwarf.",
        "notes": "",
        "tags": [
            "armand assante",
            "fantasy island",
            "hodgson’s dwarfism"
        ]
    },
    {
        "id": 106,
        "title": "Fact #106",
        "text": "Christopher Walken’s famous sage and chestnut Kwanzaa stuffing recipe was actually Wesley Snipes’.",
        "notes": "",
        "tags": [
            "christopher walken",
            "kwanzaa",
            "kwanzaa recipes",
            "many talents of wesley snipes"
        ]
    },
    {
        "id": 107,
        "title": "Fact #107",
        "text": "Wesley Snipes wore a size-seven slipper.",
        "notes": "",
        "tags": [
            "slippers"
        ]
    },
    {
        "id": 108,
        "title": "Fact #108",
        "text": "On the set of <em>The Good Die Tomorrow</em>,<sup>1</sup> a straight-to-DVD release made from reshot outtakes from three earlier Snipes films, Wesley Snipes borrowed Tom Skerritt’s Gaetano kneepads. According to Harry Dean Stanton, Snipes never returned them.",
        "notes": "<sup>1</sup>Released in Nigeria to universal acclaim as The Apple Pie Boys.",
        "tags": [
            "good die tomorrow",
            "harry dean stanton",
            "nigerian hits",
            "tom skerritt"
        ]
    },
    {
        "id": 109,
        "title": "Fact #109",
        "text": "Val Kilmer wore a “Free Wesley Snipes” T-shirt to the 84th Academy Awards underneath a relaxed Valentino kimono, apparently unaware that Snipes, the victim of a voodoo-inspired head shrinking in a minimum security prison revolt earlier that year, was already dead.",
        "notes": "",
        "tags": [
            "celebrity head shrinkings",
            "death",
            "prison revolt",
            "val kilmer"
        ]
    },
    {
        "id": 110,
        "title": "Fact #110",
        "text": "Snipes’ first wife, Linda Ng, was a pit bull trainer of Vietnamese heritage. They divorced in 1981 after Ng had tried unsuccessfully to set Snipes on fire for the fourth time. The episode was captured on video by Mickey Rourke, whose pug chihuahua mix, Little Shithouse, had been trained by Ng.",
        "notes": "",
        "tags": [
            "linda ng",
            "mickey rourke",
            "pit bulls"
        ]
    },
    {
        "id": 111,
        "title": "Fact #111",
        "text": "Wesley Snipes began his show business career as a palace mime at the summer villa of exiled Cuban dictator Fulgencio Batista.",
        "notes": "",
        "tags": [
            "fulgencio batista",
            "palace mimes"
        ]
    },
    {
        "id": 112,
        "title": "Fact #112",
        "text": "In <em>Passenger 57</em>, Wesley Snipes is shown reading a book. The “book,” viewers have pointed out, is actually a tactical guide to duty free shopping that features, instead of European luxury goods, a seemingly endless list of diabetic South American dictators.",
        "notes": "",
        "tags": [
            "diabetic south american dictators",
            "passenger 57"
        ]
    },
    {
        "id": 113,
        "title": "Fact #113",
        "text": "The Harris Poll ranked Wesley Snipes the second most popular black pituitary midget entertainer in 1997. Many of Snipes’ fans believe that Billy Dee Williams, the most beloved black pituitary midget of 1997, only billed himself as a pituitary midget, whereas in reality he suffered, like Carl Weathers, from a rare form of thyroidal midgetism.",
        "notes": "",
        "tags": [
            "billy dee williams",
            "carl weathers",
            "pituitary midgetism",
            "black crypto thyroidal midgets"
        ]
    },
    {
        "id": 114,
        "title": "Fact #114",
        "text": "For much of his career, Wesley Snipes owned and managed a Long John Silver’s Seafood Restaurant in Beaver, West Virginia.",
        "notes": "",
        "tags": [
            "beaver, west virginia",
            "long john silvers"
        ]
    },
    {
        "id": 115,
        "title": "Fact #115",
        "text": "A respected Platonist, Wesley Snipes complained constantly and bitterly to fellow classicist Eric Roberts of the “infelicities” he had discovered in the Hackforth translation of Plato’s <em>Phaedrus</em>.",
        "notes": "",
        "tags": [
            "eric roberts",
            "plato"
        ]
    },
    {
        "id": 116,
        "title": "Fact #116",
        "text": "In 1999, Wesley Snipes had Nat King Cole exhumed from his final resting place in Marseilles’ Cimetière des Olives and replaced with a life-size replica of Don Cheadle.",
        "notes": "",
        "tags": [
            "don cheadle",
            "nat king cole"
        ]
    },
    {
        "id": 117,
        "title": "Fact #117",
        "text": "Sean Penn and Wesley Snipes’ 2010 update of the 1982 hit single <em>Ebony and Ivory</em> was the only billboard number-one single to have been cut in a minimum security prison. It was also the first hit single to feature a mixed race tandem of entertaining midgets. Penn, a Gershom’s midget, has never publicly acknowledged his midgetism within the U.S. In Venezuela and Haiti, where Penn performs stand-up comedy, Penn’s midgetism is a well-known fact.",
        "notes": "",
        "tags": [
            "eboy and ivory",
            "midget duets",
            "sean penn"
        ]
    },
    {
        "id": 118,
        "title": "Fact #118",
        "text": "A Wesley Snipes Soundboard was dubbed into Korean by South Korean comedian Camp Hoo Park in late 2012. In early 2013, the Snipes Soundboard was smuggled into the People’s Republic of North Korea on the orders of the Republic’s dwarf-dictator Kim Jong Un.",
        "notes": "",
        "tags": [
            "celebrity soundboards",
            "kim jong un"
        ]
    },
    {
        "id": 119,
        "title": "Fact #119",
        "text": "Wesley Snipes laminated his own urine.",
        "notes": "",
        "tags": [
            "urine"
        ]
    },
    {
        "id": 120,
        "title": "Fact #120",
        "text": "Before a lucrative career in acting, Wesley Snipes scripted ringside banter for WWF legends Bobby “The Brain” Heenan and Randy “Macho Man” Savage.",
        "notes": "",
        "tags": [
            "bobby heenan",
            "randy savage"
        ]
    },
    {
        "id": 121,
        "title": "Fact #121",
        "text": "From 1992 to 1994, Wesley Snipes was the host of a hit Puerto Rican television program called <em>Happy Afternoons of the Little People</em> (English translation), which saw Snipes and co-host Alfonso Paul arriving on the stoops of fellow Puerto Rican midgets with gifts of above-ground swimming pools and a guaranteed one-year supply of clean water. Snipes left the show in early 1994 over a contractual dispute.",
        "notes": "",
        "tags": [
            "alfonso paul",
            "happy afternoons of the little people",
            "puerto rican TV shows"
        ]
    },
    {
        "id": 122,
        "title": "Fact #122",
        "text": "In a deleted scene from <em>Blade</em>, Wesley Snipes was asked by director Guillermo del Toro to arrive at the headquarters of his nemesis Dragonetti (Udo Kier) in a giant trench coat on the shoulders of Kris Kristofferson, who would remain hidden under the coat until they were safely inside. When Snipes refused to sit on Kristofferson, del Toro conceived of the now legendary biplane entry in which Snipes glides into Dragonetti’s lair astride a single-seat Sopwith Camel (piloted by Kristofferson) shooting poison arrows.",
        "notes": "",
        "tags": [
            "blade",
            "guillermo del toro",
            "kris kristofferson"
        ]
    },
    {
        "id": 123,
        "title": "Fact #123",
        "text": "Wesley Snipes and Mark Ruffalo are the only Puerto Rican midgets to have performed Sesame Street duets with the Count. ",
        "notes": "",
        "tags": [
            "mark ruffalo",
            "puerto rico",
            "sesame street"
        ]
    },
    {
        "id": 124,
        "title": "Fact #124",
        "text": "After playing Harvey Keitel’s invisible sidekick, Cranks de Foy, in <em>Kreeger’s Alley</em>, Snipes was offered a cameo role in <em>I, Claudius</em> opposite Derek Jacobi as “Unguents Peddler” in a busy street scene.",
        "notes": "",
        "tags": [
            "harvey keitel",
            "derek jacobi",
            "kreeger’s alley"
        ]
    },
    {
        "id": 125,
        "title": "Fact #125",
        "text": "In 2011, Geraldo Rivera filmed the prison reunion of Wesley Snipes and estranged father Lloyd Doodee III of Herman, Mississippi. A week later, Snipes was decapitated and subsequently stuffed and booby-trapped<sup>1</sup> by prison voodooists after an unsuccessful prison tax revolt championed by Snipes and six other tax-evading prison midgets.",
        "notes": "<sup>1</sup>Snipes’ body was later discovered in the prison garbage chute by claims adjusters, who deactivated the booby trap. After touring the sideshows of Eastern Europe for a year, Snipes’ corpse was placed in a cryogenic cellar by father Doodee and Snipes’ seventh wife, Jocelyn Powers Snipes, mother of Four Wheel Drive Snipes (age two, a dwarf) and Grocery List Snipes (age four).",
        "tags": [
            "death",
            "four wheel drive snipes",
            "geraldo rivera",
            "grocery list snipes",
            "joceyln powers",
            "lloyd doodee III"
        ]
    },
    {
        "id": 126,
        "title": "Fact #126",
        "text": "A biological enigma, only Snipes’ right foot sweated, one of three known cases<sup>1</sup> in Hollywood.",
        "notes": "<sup>1</sup>Both James Spader and Lance Henriksen (Pumpkinhead) had sweaty right feet.",
        "tags": [
            "biological enigmas",
            "james spader",
            "lance henriksen"
        ]
    },
    {
        "id": 127,
        "title": "Fact #127",
        "text": "The bright orange light emanating from Jules and Vincent’s briefcase in <em>Pulp Fiction</em> is neither diamonds nor Jules and Vincent’s souls. It is Wesley Snipes.",
        "notes": "",
        "tags": [
            "pulp fiction trivia"
        ]
    },
    {
        "id": 128,
        "title": "Fact #128",
        "text": "In the original script for Tom Cruise’s space thriller <em>Lockdown 144</em>, in which Cruise’s character Lieutenant David Bellows is trapped on an abandoned space station whose 144 rooms are each haunted by a virtual replica of himself, Wesley Snipes appeared in Room 26 as the wise-cracking space shaman Gimcrack.",
        "notes": "",
        "tags": [
            "lockdown 144",
            "tom cruise",
            "space shamans"
        ]
    },
    {
        "id": 129,
        "title": "Fact #129",
        "text": "Between 1995 and 1997, Wesley Snipes performed at the Gateway Dinner Theater in East Las Vegas with a Regis Philbin impersonator. Their routine, <em>The Little Rascals Meet Abbott and Costello</em>, was described in the Reno Casino Gazette as a “must-see.”",
        "notes": "",
        "tags": [
            "dinner theater",
            "regis philbin impersonators"
        ]
    },
    {
        "id": 130,
        "title": "Fact #130",
        "text": "A lifelong semi-competitive Monopoly player, Wesley Snipes was credited, in the 2010 Puerto Rican Monopoly docudrama <em>Little Dreams (of Land Ownership)</em>, with petitioning Hasboro to recognize Puerto Rico’s claims to more competitive “big money” real estate. Prior to Snipes’ advocacy, La Palqua de San Estevan, San Juan’s most expensive property, was rated at less than half the value of Baltic Avenue. Other “low rent” Monopoly countries include: Moldova, the Republic of Chad, Pakistan, Togo, Nigeria, and Dagestan, whose most expensive property, the Tarki Pass, when equipped with three hotels, is worth less than the maximum railroad fine in the Nigerian version of the game. ",
        "notes": "",
        "tags": [
            "little dreams of land ownership",
            "monopoly"
        ]
    },
    {
        "id": 131,
        "title": "Fact #131",
        "text": "Roxane Gay, a Dobson’s midget from Papua New Guinea, was the wet nurse of Grocery List Snipes, Wesley Snipes’ third son by his seventh wife Jocelyn Powers.",
        "notes": "",
        "tags": [
            "dobson’s midgets",
            "joceyln powers",
            "roxane gay"
        ]
    },
    {
        "id": 132,
        "title": "Fact #132",
        "text": "Mel Gibson originally cast Wesley Snipes as Uchechwa, the Aztec high priest’s pastries-obsessed younger brother in his 2011 romantic comedy <em>Apocalypto</em>, a role which ultimately went to John Leguizamo.",
        "notes": "",
        "tags": [
            "apocalypto",
            "john leguizamo",
            "mel gibson"
        ]
    },
    {
        "id": 133,
        "title": "Fact #133",
        "text": "Wesley Snipes turned down the role of Figaroa Brown, Cliff Bemis’s trash-talking midget sidekick in <em>Hell Comes to Frogtown</em>, to play midget hotdog vendor Rory Burke in the 1989 box office bomb <em>Cracker Gotta Big Knife</em>, a prequel to <em>Crocodile Dundee</em> set in Spanish Harlem.",
        "notes": "",
        "tags": [
            "cracker gotta big knife",
            "hell comes to frogtown",
            "rowdy roddy piper films"
        ]
    },
    {
        "id": 134,
        "title": "Fact #134",
        "text": "Wesley Snipes was a close friend of animator Will Vinton. In an extended interview with the Oregon History Museum, which held a retrospective of Vinton’s work in 2008, Vinton admitted that he had considered a Jamaican reboot of his beloved Claymation Christmas Special starring Snipes as jive-talking Pupa Claus.",
        "notes": "",
        "tags": [
            "pupa claus",
            "will vinton"
        ]
    },
    {
        "id": 135,
        "title": "Fact #135",
        "text": "Along with Melina Mercouri, John Belushi, and Bud Preen, Wesley Snipes was an outspoken advocate for the return of the Elgin Marbles to Greece.",
        "notes": "",
        "tags": [
            "bud preen",
            "elgin marbles",
            "john beulshi",
            "melina mercouri"
        ]
    },
    {
        "id": 136,
        "title": "Fact #136",
        "text": "Shortly before he was beheaded by prison jihadists, Wesley Snipes had decided with longtime collaborator and adopted father Richard Simmons to resituate his Pennsylvania-based drama camp for one-handed people — Forty Acres — to Puerto Rico, where it would operate as a leper colony.",
        "notes": "",
        "tags": [
            "death",
            "leper colonies",
            "puerto rico",
            "richard simmons"
        ]
    },
    {
        "id": 137,
        "title": "Fact #137",
        "text": "When Warner Bros concept man Ted Denny conceived of <em>Judge Mathis</em> in 1999, he originally had Wesley Snipes in mind for the part. Snipes, whose five degrees in tertiary education included a degree in jurisprudence from Louie Hines University in downtown San Juan, turned down the lucrative role to write, produce, and direct a remake of Peter Bogdonavich’s <em>The Last Picture Show in Texas</em> starring Rudy Ray Moore as Duane Jackson and Redd Foxx as both Sam the Lion and Ruth Popper (originally played by Cloris Leachman).",
        "notes": "",
        "tags": [
            "cloris leachman",
            "judge mathis",
            "last picture show in texas",
            "peter bogdonavich",
            "rudy ray moore"
        ]
    },
    {
        "id": 138,
        "title": "Fact #138",
        "text": "The playwright Wallace Shawn is the biological child of Wesley Snipes and Rosie Perez, as are actor Luiz Guzman and children’s author Stephan Erik Clark, a dwarf.",
        "notes": "",
        "tags": [
            "luiz guzman",
            "rosie perez",
            "stephan erik clark",
            "wallace shawn"
        ]
    },
    {
        "id": 139,
        "title": "Fact #139",
        "text": "The role of Jodie Foster’s hand puppet in the <em>The Beaver</em> was originally written for Wesley Snipes.",
        "notes": "",
        "tags": [
            "beaver",
            "jodie foster"
        ]
    },
    {
        "id": 140,
        "title": "Fact #140",
        "text": "In 2010, Wesley Snipes collaborated with fellow Puerto Rican little man Vin Diesel on the script for a pilot episode of <em>The Little Princes of Pawn</em>, a reality show about Puerto Rican pawnshop impresarios under five feet tall.",
        "notes": "",
        "tags": [
            "puerto rican TV shows",
            "vin diesel"
        ]
    },
    {
        "id": 141,
        "title": "Fact #141",
        "text": "In 1982, Wesley Snipes, billing himself as Ray “Jelly Bean” Bustamente, fought and knocked out Puerto Rican child singing sensation Aldo in a bantam weight charity bout in Palmer City, Florida.",
        "notes": "",
        "tags": [
            "aldo",
            "boxing",
            "many talents of wesley snipes",
            "puerto rico"
        ]
    },
    {
        "id": 142,
        "title": "Fact #142",
        "text": "Showrunner Mensil Love originally cast Wesley Snipes as the Higgins character in <em>¡Ay Fossie!</em>, a Spanish language remake of Magnum P.I. set on the Canary Islands and starring Gary Busey as Jack Fossie, an alchoholic glass-bottomed boat operator who solves crimes with his one-eyed parrot Bartholemew.",
        "notes": "",
        "tags": [
            "¡ay fossie!",
            "gary busey",
            "mensil love",
            "magnum p.i."
        ]
    },
    {
        "id": 143,
        "title": "Fact #143",
        "text": "While on loan to Firestar Studios after breaking his contract with Paramount over <em>Ned Balaster</em>,<sup>1</sup> Wesley Snipes was immediately cast as “Victim of Voodoo Head Shrinking in Afterlife Waiting Room” in the Tim Burton classic <em>Beetlejuice.</em>.",
        "notes": "<sup>1</sup>Snipes refused to play a detective with a fear of expired milk.",
        "tags": [
            "beetlejuice",
            "ned balaster",
            "tim burton"
        ]
    },
    {
        "id": 144,
        "title": "Fact #144",
        "text": "Gary Senise’s original <em>Of Mice and Men</em> script had an extra part for Wesley Snipes, who was to play Honolulu Jim, Lennie Small’s deceptive older brother who attempts to con Lennie into posing as a human windsock outside his Decatur, Illinois used car lot.",
        "notes": "",
        "tags": [
            "gary senise",
            "john malcovich",
            "of mice and men"
        ]
    },
    {
        "id": 145,
        "title": "Fact #145",
        "text": "Snipes once appeared in diapers with Danny Devito on <em>The Novgorod Fancy Suit Gentlemen’s Dinner Club Party</em>, Russia’s premiere late-night variety show hosted by Nav Silpenski.",
        "notes": "",
        "tags": [
            "danny devito",
            "nav silpenksi",
            "novgorod fancy suit gentlemen's club"
        ]
    },
    {
        "id": 146,
        "title": "Fact #146",
        "text": "In 1981, Wesley Snipes took out a patent for Negresh, a fabric-softening sheet for African Americans.",
        "notes": "",
        "tags": [
            "negresh"
        ]
    },
    {
        "id": 147,
        "title": "Fact #147",
        "text": "Malaysian child-dwarf Suey Park had a prison romance with Wesley Snipes prior to Snipes’ death in the ill-fated minimum security prison revolt in which Snipes perished. Their love child, Dairy Queen “Suey” Snipes, is a child genius who reputedly mentored Arthur Chu to his 2014 Jeopardy victories.",
        "notes": "",
        "tags": [
            "arthur chu",
            "dariry queen suey snipes",
            "death",
            "jeopardy",
            "prison revolt",
            "suey park"
        ]
    },
    {
        "id": 148,
        "title": "Fact #148",
        "text": "Following their Oscar-nominated performances in <em>Grinders</em> (1994) — a thinly disguised fictionalization of the lives of San Juan snowcone peddlers “Barrio” Pete Dávila and Tipitu — Brian Dennehy and Wesley Snipes toured Puerto Rico in a refrigerated Zamboni machine.",
        "notes": "",
        "tags": [
            "brian dennehy",
            "grinders",
            "puerto rico"
        ]
    },
    {
        "id": 149,
        "title": "Fact #149",
        "text": "In 1998, together with <em>Grinders</em> co-star Brian Dennehy, Wesley Snipes bought controlling stock in the family entertainment center Chuck E. Cheese. According to Dennehy’s biographer, Dennehy was very pleased with his purchase and made unadvertised guest appearances in franchises around the Midwest dressed as a mouse. Snipes’ involvement in the venture was known only to close friends. In 2011, when Snipes was decapitated in a minimum security prison revolt, Snipes’ stake in the company was bought out by Asia Argento. It has since been re-sold to Orlando Bloom, a midget.",
        "notes": "",
        "tags": [
            "asia argento",
            "brian dennehy",
            "chuck e. cheese",
            "death",
            "grinders",
            "orlando bloom",
            "prison revolt"
        ]
    },
    {
        "id": 150,
        "title": "Fact #150",
        "text": "It was a young George Lucas<sup>1</sup> who wrote the role of the uppity toilet bowl in Sidney Lumet’s <em>The Wiz</em> for Wesley Snipes, unaware that Lumet had already cast Snipes as a talking toilet in his Hispanicized retelling of Pinocchio, <em>God Help Little Pedro</em> (English translation). The role eventually went to a destitute Carl Weathers, a thyroidal midget who died of pneumonia before reading all his lines, at which point Lumet wrote out the talking toilet in favor of a singing scarecrow, played by Michael Jackson.",
        "notes": "<sup>1</sup>A Gibson’s dwarf",
        "tags": [
            "carl weathers",
            "george lucas",
            "michael jackson",
            "sydney lumet",
            "wiz"
        ]
    },
    {
        "id": 151,
        "title": "Fact #151",
        "text": "In the 1992 Penny Marshall plantation bro-com <em>Spades and Tosh</em>, crotchety Alzheimer victim and plantation owner Captain Tosh (Val Kilmer) confuses his live-in orderly Spades Bailey (Wesley Snipes) for a Union jailer. According to Marshall, the water pistol fight in the Mephis Home Depot Garden Center was entirely unscripted.",
        "notes": "",
        "tags": [
            "penny marshall",
            "spades and tosh",
            "val kilmer"
        ]
    },
    {
        "id": 152,
        "title": "Fact #152",
        "text": "It was Canadian homunculus Alan Thicke who credited Wesley Snipes as the inventor of the Newman Game,<sup>1</sup> popular in Los Angeles in the late-1990s.",
        "notes": "<sup>1</sup>Where a person — the initiator — makes a statement followed by the word Newman. Play continues until someone either forgets to say Newman or says Anti-Newman, whereupon the order of speakers is reversed",
        "tags": [
            "alan thicke",
            "canada",
            "newman game"
        ]
    },
    {
        "id": 153,
        "title": "Fact #153",
        "text": "According to an article in <em>Mississippi Shallow Waters and Ponds Yearly</em> recently unearthed by Richard Simmons, the executor of the Snipes Estate, Wesley Snipes’ father, Lloyd Doodee III, was a dowser with an appalling record of overcharging his customers.",
        "notes": "",
        "tags": [
            "corrupt dowsers",
            "lloyd doodee III",
            "richard simmons"
        ]
    },
    {
        "id": 154,
        "title": "Fact #154",
        "text": "Wesley Snipes’ stepmother Portia Doodee Snipes, a Haitian voodooist, was the daughter of a Portuguese midget and a juggling Slav from the Circus Gleich.",
        "notes": "",
        "tags": [
            "circus gleich",
            "haitian voodoo",
            "portia doodee snipes"
        ]
    },
    {
        "id": 155,
        "title": "Fact #155",
        "text": "For a ten-year period in between his cameo appearance in Martin Scorsese’s <em>Mean Streets</em> and his breakthrough role as loveable cosmetics thief Bobby Rubies on <em>The Young and the Restless</em>, Wesley Snipes worked for Paul Robiforte, the Staten Island gravel mogul.",
        "notes": "",
        "tags": [
            "bobby rubies",
            "martin scorsese",
            "mean streets",
            "paul robiforte",
            "young and the restless"
        ]
    },
    {
        "id": 156,
        "title": "Fact #156",
        "text": "Wesley Snipes’ legal name was Cassian Wallace Fard Doodee I.",
        "notes": "",
        "tags": [
            "cassian wallace fard doodee I"
        ]
    },
    {
        "id": 157,
        "title": "Fact #157",
        "text": "Along with his third wife Houston Astros pitcher Vern Ruhle, Wesley Snipes was an uncompromising collector of costume jade.",
        "notes": "",
        "tags": [
            "vern ruhle"
        ]
    },
    {
        "id": 158,
        "title": "Fact #158",
        "text": "Wesley Snipes’ adopted twin brother, Grover Mt. Pleasant Doodee II, died sterilizing a fish tank a week before Snipes was killed, beheaded, and then taxidermied in prison by a cabal of prison hair stylists.",
        "notes": "",
        "tags": [
            "death",
            "grover mt. pleasant doodee II",
            "prison revolt"
        ]
    },
    {
        "id": 159,
        "title": "Fact #159",
        "text": "Like Inuit fat man Steven Seagal, Wesley Snipes was not only fluent in Russian. According to Arkady Provst, editor of <em>Crazy Party Gossip in the Air</em>, half of Snipes’ box office earnings were the top-grossing Russian <em>Commisar Nevsky</em> series in which Snipes plays the faceless, leather-gloved intelligence operative Barnell Hank.",
        "notes": "",
        "tags": [
            "arkady provost",
            "commisar nevksy",
            "crazy party gossip in the air",
            "steven seagal"
        ]
    },
    {
        "id": 160,
        "title": "Fact #160",
        "text": "Like fellow comedic midget Jerry Lewis, Snipes was more popular in France, where much of his work has been dubbed into French and Arabic. Though he was never inducted into the Société des Artistes, his Puerto Rican Space Opera Buffa <em>The Multicolored Space Bus of Dr. Ricardo</em> (English translation), in which Snipes plays Voss, a crippled Cyborg with an unidentified space sickness, is broadcast every Easter on French state TV.",
        "notes": "",
        "tags": [
            "jerry lewis",
            "multicolored space bus of dr. ricardo",
            "puerto rican space operas"
        ]
    },
    {
        "id": 161,
        "title": "Fact #161",
        "text": "The neon fork Wesley Snipes’ character Doodad — a prophetic kimchi vendor — lent Ricardo Tubbs in Miami Vice Episode 76 “Fool’s Paradise” actually belonged to Snipes. It was a gift from his second wife, Häagen Dazs model Elena Gar. Snipes would claim up until his 2011 death in a minimum security prison revolt that Philip Michael Thomas stole the knife and lost it in a bet to Don Johnson, a Hendrick’s midget.",
        "notes": "",
        "tags": [
            "death",
            "don johnson",
            "hendrick’s midgets",
            "miami vice",
            "philip michael thomas",
            "prison revolt"
        ]
    },
    {
        "id": 162,
        "title": "Fact #162",
        "text": "The original script for Nash Bridges Episode 22 “Wild Card” had Wesley Snipes playing Cedrick “Rick” Hawks, a dental plate repairman visiting Nash Bridges in Cork Basin, Nevada, in order to identify one of his own deceased customers. When it became known to producers that Snipes, a midget, would be driving a miniature vehicle with special raised gas and brake pedals in the climactic final chase scene, production was halted. Citing budget restrictions, CBS hired Philip Michael Thomas to play the part of Hawks, though the backstory was altered so that Hawks was a postal inspector in San Francisco sent to assassinate Bridge’s accountant Joe Dominguez (Cheech Marin). Thomas won an Emmy for his performance.",
        "notes": "",
        "tags": [
            "cheech marin",
            "nash bridges",
            "philip michael thomas"
        ]
    },
    {
        "id": 163,
        "title": "Fact #163",
        "text": "Wesley Snipes was the only celebrity African-American midget to have been invited onto <em>The Wheel of Fortune</em> twice. Snipes appeared once with Vana White, wielding a fescue, for the final puzzle, and then as a contestant on the short-lived <em>Wheel of Fortune: Little People’s Edition</em>.",
        "notes": "",
        "tags": [
            "pituitary midgetism",
            "vana white",
            "wheel of fortune",
            "wheel of fortune spinoffs"
        ]
    },
    {
        "id": 164,
        "title": "Fact #164",
        "text": "The rights to Wesley Snipes’ nameless 1987 black leprechaun epic were optioned by Terrence Malick in 1990. For the next nineteen years, Malick honed and re-honed the script, eventually reaching what close friend James Lipton described as “a physical and moral exhaustion.” It wasn’t until Sean Penn and Brad Pitt were brought aboard in early 2010 that producers and backers convinced Malick to resume work. The resulting film, <em>The Tree of Life</em> (U.S.) and <em>The Little Black Lucky Man and the Bottomless Pot [of Gold]</em>(Puerto Rico) — is considered to be Malick’s most ambitious and visually stunning work to date.",
        "notes": "",
        "tags": [
            "brad pitt",
            "little black lucky man",
            "sean penn",
            "terrence malick",
            "tree of life"
        ]
    },
    {
        "id": 165,
        "title": "Fact #165",
        "text": "Wesley Snipes owned a small parcel of land on Sylvester Stallone’s fourteen-acre La Quinta, California property where he farmed pineapples and avocados. Snipes also had a limited stake in Stallone’s houseboat. Following Snipes’ death and subsequent taxidermification, all interest in Stallone’s Snipes-owned taxable wealth was forfeited to the US government.",
        "notes": "",
        "tags": [
            "death",
            "sylvester stallone"
        ]
    },
    {
        "id": 166,
        "title": "Fact #166",
        "text": "An early believer in bulk internet banner advertising, Wesley Snipes employed a loyal prison crew of buyers and sellers who worked for him around the clock trading banner ads. It was said that upon his death, the midget actor had amassed more than $13 million in taxable banner-related funds. Richard Simmons, Snipes’ adopted father and the executor of the Snipes Estate, denied the figure, stating under oath in Tax Court, where Snipes’ case was reopened posthumously,<sup>1</sup> that Snipes had only dabbled in banners for a few months prior to his death.",
        "notes": "<sup>1</sup>Snipes, who perished in a minimum-security prison revolt in 2011, was subsequently beheaded and taxidermied. However, in a macabre twist of fate, the dead actor’s voice box still produces low-frequency sound waves approximating human speech when a straw is embedded directly in his tracheal cavity and attached to a gramophone ear.",
        "tags": [
            "banner ads",
            "death",
            "prison revolt",
            "richard simmons",
            "tax evasion"
        ]
    },
    {
        "id": 167,
        "title": "Fact #167",
        "text": "Wesley Snipes’ prison nickname was “Salad,” a reference to the millions of untaxable US dollars Snipes had secreted in off-shore Barbadian “lettuce” accounts.",
        "notes": "",
        "tags": [
            "nicknames",
            "tax evasion"
        ]
    },
    {
        "id": 168,
        "title": "Fact #168",
        "text": "Wesley Snipes was a volunteer fireman in Yuba City, California. His vehicle — a modified Shriner parade car with a water-dispensing owl — has since been donated to the Shriners of Panama City, on display daily at the Abou Saad Shrine.",
        "notes": "",
        "tags": [
            "many talents of wesley snipes",
            "shriners"
        ]
    },
    {
        "id": 169,
        "title": "Fact #169",
        "text": "Lieutenant Vincent Boobichaw, Al Pacino’s character in <em>Heat</em>, was originally written as a feisty black midget with attitude problems. Wesley Snipes was given first look at the script and immediately made corrections — most notably, recasting Val Kilmer as a court typist with congenital syphilis. Fearing shooting delays, Michael Mann and his legal team altered the character description to read: “a feisty Italian-American midget who shouts.” Pacino, who is a Cuban Gypsy, signed on within the week.",
        "notes": "",
        "tags": [
            "al pacino",
            "heat",
            "michael mann",
            "val kilmer"
        ]
    },
    {
        "id": 170,
        "title": "Fact #170",
        "text": "To prepare for the role of Elgin Fidus, the zircon appraiser in Matt Dillon’s <em>Dust</em>, the low-budget 1996 biopic of Zales’ founders Morris and William Zale, Wesley Snipes lived out of a ticket booth in the Frank R. Lautenberg (Secaucus Junction) Station for eight months.",
        "notes": "",
        "tags": [
            "dust",
            "matt dillon",
            "zale biopics"
        ]
    },
    {
        "id": 171,
        "title": "Fact #171",
        "text": "Deaf since birth, Wesley Snipes learned to lip read at the age of forty-two.",
        "notes": "",
        "tags": [
            "deafness"
        ]
    },
    {
        "id": 172,
        "title": "Fact #172",
        "text": "For the last year of his incarceration, Wesley Snipes shared a cell with Azerbaijani pituitary midget Norman Reedus, his adopted nephew and co-star in the 1996 Zale Brothers biopic <em>Dust</em>.",
        "notes": "",
        "tags": [
            "dust",
            "norman reedus",
            "pituitary midgetism"
        ]
    },
    {
        "id": 173,
        "title": "Fact #173",
        "text": "In her unauthorized biography, <em>The Most Beautiful Woman</em>, Elizabeth Taylor recalls an outtake from Tom Selleck’s 1988 directorial debut <em>Point Morgan</em>, in which she berates a “colored boom operator” for cutting in line at the craft service table. According to novelist Paul Auster, who wrote the script, Taylor was actually yelling at Wesley Snipes, an extra.",
        "notes": "",
        "tags": [
            "elizabeth taylor",
            "most beautiful woman",
            "paul auster",
            "tom selleck"
        ]
    },
    {
        "id": 174,
        "title": "Fact #174",
        "text": "Wesley Snipes once called Geraldo Rivera “worse than whitey.”",
        "notes": "",
        "tags": [
            "geraldo rivera insults"
        ]
    },
    {
        "id": 175,
        "title": "Fact #175",
        "text": "In his fanciful adaptation of Arthur Miller’s <em>The Death of a Salesman</em>, Boris Vian added Willy Loman’s Conscience as a character just days before he mysteriously vanished. Vian was quickly replaced by Fred “Rerun” Berry. It was Berry who invited fellow <em>Good Times</em> alumnus Wesley Snipes aboard, casting him as Loman’s Evil Conscience.<sup>1</sup>",
        "notes": "<sup>1</sup>Loman’s Good Conscience was played by Matthew Broderick for the first week and then by Val Kilmer. When Berry died of a heart attack three weeks later, Kilmer took over the director’s reins. Snipes, who had artistic differences with Kilmer during the filming of the Penny Marshall-helmed plantation bro-com <em>Spades and Tosh</em>, quit and was replaced by Siri Hustvedt. Boris Vian was never seen again.",
        "tags": [
            "boris vian",
            "death of a salesman",
            "fred berry",
            "good times",
            "matthew broderick",
            "penny marshall",
            "siri hustvedt",
            "spades and tosh",
            "val kilmer"
        ]
    },
    {
        "id": 176,
        "title": "Fact #176",
        "text": "Among Wesley Snipes’ possessions at the time of his death and subsequent taxidermification was a 1962 translation of the <em>I Ching</em> dedicated to Snipes by Ed Asner, who starred with Snipes in Sylvester Stallone’s 1985 musical adaptation of the love sonnets of William Shakespeare. Actuaries hired by fitness guru Richard Simmons, the executor of the Snipes Estate, valued the book at $1000. It was eventually purchased for $29 as one item on a lot of Snipe’s prison memorabilia, which included Snipes’ Espertanto dictionary, mechanical anus, and his pipe cleaner collection, by Snipes’ cellmate Norman Reedus and adopted nephew.",
        "notes": "",
        "tags": [
            "death",
            "ed asner",
            "i ching",
            "norman reedus",
            "richard simmons"
        ]
    },
    {
        "id": 177,
        "title": "Fact #177",
        "text": "On October 5th, 1981, Wesley Snipes, an accomplished fifer, performed with Bubba Smith on the Late Show with Johnny Carson. Smith played drums.",
        "notes": "",
        "tags": [
            "bubba smith",
            "fifing",
            "johnny carson",
            "many talents of wesley snipes"
        ]
    },
    {
        "id": 178,
        "title": "Fact #178",
        "text": "In George Lucas’ original <em>Star Wars: The Empire Strikes Back</em> script, Boba Fett was a jaded casino employer at an interstellar casino where Han Solo won trifling but frequent sums of money. Disenchanted by what he felt was a dead-end career, Fett went on to the more lucrative profession of bounty hunting, purchasing a R2D2-like droid named Boris to accompany him on his assignments. Wesley Snipes, a pituitary midget, read for the part of Boris and was championed fiercely by Lucas, who had earlier cast Snipes as the trash-talking toilet bowl in Sidney Lumet’s <em>The Wiz</em>. According to fitness guru Richard Simmons, the part eventually went to Morris Coleman, brother of midget Gary, and then was dropped from the script entirely.",
        "notes": "",
        "tags": [
            "bobba fett",
            "empire strikes back",
            "george lucas",
            "morris coleman",
            "richard simmons",
            "sidney lumet",
            "wiz"
        ]
    },
    {
        "id": 179,
        "title": "Fact #179",
        "text": "Wesley Snipes was an outspoken believer in the Sherkin Mackerel Diet and appeared in several of Sir Lloyd Sherkin’s popular infomercials prior to Sherkin’s arrest and imprisonment for tax fraud.",
        "notes": "",
        "tags": [
            "sherkin mackerel diet",
            "sir lloyd sherkin"
        ]
    },
    {
        "id": 180,
        "title": "Fact #180",
        "text": "Wesley Snipes’ marriage to second wife Brigitte Neilson ended quickly in divorce with Neilson citing Snipe’s unrelenting demands for piggyback rides as an unreconciable difference.",
        "notes": "",
        "tags": [
            "brigitte neilson"
        ]
    },
    {
        "id": 181,
        "title": "Fact #181",
        "text": "In an interview with Hollywood insider Andrew O’Hehir, Kurt Russell admitted that it was Wesley Snipes who crawled under the table and bit him on the ankle at Goldie Hawn’s fiftieth birthday party in Portales, New Mexico.",
        "notes": "",
        "tags": [
            "andrew o’hehir",
            "goldie hawn",
            "kurt russell"
        ]
    },
    {
        "id": 182,
        "title": "Fact #182",
        "text": "For much of the 1970s, after a partial vasectomy which reduced his plasma production, Snipes was a human crash dummy for Volvo.",
        "notes": "",
        "tags": [
            "midget crash dummies",
            "volvo"
        ]
    },
    {
        "id": 183,
        "title": "Fact #183",
        "text": "<em>X-Men Bloopers</em>, a popular Barbadian reality show, featured outtakes from the popular X-Men franchise into which Wesley Snipes had been posthumously inserted",
        "notes": "",
        "tags": [
            "x-men bloopers"
        ]
    },
    {
        "id": 184,
        "title": "Fact #184",
        "text": "Taiwanese karaoke champion Iggy Azalea is the daughter of Margot Seinfeld and Wesley Snipes.",
        "notes": "",
        "tags": [
            "iggy azalea",
            "margot seinfeld"
        ]
    },
    {
        "id": 185,
        "title": "Fact #185",
        "text": "The extended nine-minute “Ryan Gosling Moobs” tape in which an unidentified caller from Puerto Rico with access to Gosling’s private telephone number pretends to be a private detective looking for Gosling’s “moobs” was neither Wesley Snipes nor fellow midget Norman Reedus, Snipes’ prison cellmate and adopted nephew, as had long been believed.",
        "notes": "",
        "tags": [
            "moobs",
            "norman reedus",
            "puerto rico",
            "ryan gosling"
        ]
    },
    {
        "id": 186,
        "title": "Fact #186",
        "text": "Of Wesley Snipes’ twenty-nine living children, only two — Paul Butterfield Band Snipes and Hoegaarden Bistro Snipes — went on to become actors.",
        "notes": "",
        "tags": [
            "hoegaarden bistro snipes",
            "paul butterfield band snipes"
        ]
    },
    {
        "id": 187,
        "title": "Fact #187",
        "text": "Legless Russian dwarf Vladimir Putin visited Wesley Snipes in prison days before the the Lewis Run Tax Evaders Prison Revolt of 2011, in which Snipes was captured in a net, melted into ingots, and deposited in a Swiss bank account by adopted father Richard Simmons for future disposition. It is believed that Putin encouraged Snipes, through a translator, to deposit himself in Switzerland.",
        "notes": "",
        "tags": [
            "death",
            "prison revolt",
            "richard simmons",
            "russian dwarves",
            "vladimir putin"
        ]
    },
    {
        "id": 188,
        "title": "Fact #188",
        "text": "Lionel Richie estimates that he spent anywhere between $10,000 and $35,000 on denatured alcohol over the course of the “hair bomb” war he waged against Wesley Snipes in the early 1990s. While Snipes instigated the first attack (setting Richie’s hair alight at a stoplight in Port Hueneme), it was Richie who lit Snipes on fire three times over the course of the shooting of the second <em>Blade</em> movie.",
        "notes": "",
        "tags": [
            "blade",
            "lionel richie",
            "lionel richie hair fires"
        ]
    },
    {
        "id": 189,
        "title": "Fact #189",
        "text": "In 1998, the year Seamus Heaney became the first Irish astronaut to successfully complete a space walk, Snipes’ hip-hop label Cobra Records released a deluxe box set of the rare Heaney-Larkin Medicine Show Hour, in which the two esteemed poets improvise poetic exchanges as “Bucky” and “Bojangles,” two elderly Mississippi field hands.",
        "notes": "",
        "tags": [
            "heaney-larkin medicine show hour",
            "philip larkin",
            "seamus heany"
        ]
    },
    {
        "id": 190,
        "title": "Fact #190",
        "text": "In 1989, on the wings of his <em>Burbage</em> fame, Wesley Snipes launched a short-lived line of little men’s ankle coats for sale exclusively at the Men’s Wearhouse.",
        "notes": "",
        "tags": [
            "ankle coats",
            "burbage",
            "men’s warehouse"
        ]
    },
    {
        "id": 191,
        "title": "Fact #191",
        "text": "In 1991, in protest against Reverend Osingbe Sunday’s offensive treatment of Reverend Jesse Jackson on Jackson’s Togo Today Reconciliation Tour, Wesley Snipes ate one hundred Arby’s roast beef sandwiches — the number of psychological switches Reverend Jackson accused Reverend Sunday of landing upon his back.",
        "notes": "",
        "tags": [
            "reverend jesse jackson",
            "reverend osingbe sunday",
            "togo today"
        ]
    },
    {
        "id": 192,
        "title": "Fact #192",
        "text": "It was Lawrence Leto, brother of Jared, a Guatemelan midget, who once mistook Wesley Snipes for Randy Quaid at a Bronson Pinchot pontoon party. Leto, who talked to a Quaid-Snipes character for at least twenty minutes, claimed his confusion stemmed from the fact that a) Quaid had appeared in his infamous C. Everett Koop disguise that night, and b) both Quaid and Snipes had just starred in the Atom Egoyan dystopian Canadian lumberjack drama <em>The Ravaged Lake</em>.",
        "notes": "",
        "tags": [
            "atom egoyan",
            "c. everett koop disguises",
            "bronson pinchot",
            "lawrence leto",
            "ravaged lake",
            "randy quaid"
        ]
    },
    {
        "id": 193,
        "title": "Fact #193",
        "text": "From 1997 to 2003, Wesley Snipes was the official face of King Oscar Sardines.",
        "notes": "",
        "tags": [
            "king oscar sardines"
        ]
    },
    {
        "id": 194,
        "title": "Fact #194",
        "text": "The 2004 update of <em>The Million Dollar Man</em> — with Steve Buscemi as General Cush and Jerry O’Connell playing Steve Austin — was cancelled when Wesley Snipes, Austin’s midget pool man, walked off the set in the third week of production. According to executive producer Matt Damon, O’Connell had referred to Snipes’ character, Lieutenant Lloyd Foist, as the “Five Hundred Dollar Man” over dinner one night. Snipes hadn’t gone public with his midgetism yet.",
        "notes": "",
        "tags": [
            "jerry o’connell",
            "matt damon",
            "million dollar man",
            "pituitary midgetism",
            "steve buscehmi"
        ]
    },
    {
        "id": 195,
        "title": "Fact #195",
        "text": "In an interview with Andrew O’Hehir in the Criterion Collection’s remastered edition of <em>Demolition Man</em>, Wesley Snipes cited Maurice Evans’ interpretation of Dr. Zaius in <em>The Planet of the Apes</em> as the basis for his portrayal of “miniaturized” car thief Simon Phoenix.",
        "notes": "",
        "tags": [
            "andrew o’hehir",
            "demolition man",
            "dr. zaius",
            "maurice evans",
            "planet of the apes"
        ]
    },
    {
        "id": 196,
        "title": "Fact #196",
        "text": "A analogical wax replica of Wesley Snipes based on Frank Stallone’s body measurements stands at the entrance of Madame Tussaud’s in London opposite the Josh Brolin Goonies Dummy.",
        "notes": "",
        "tags": [
            "frank stallone",
            "josh brolin",
            "madame tussaud’s"
        ]
    },
    {
        "id": 197,
        "title": "Fact #197",
        "text": "In 1969, at the age of sixteen, Snipes had a brief role as “The Lowrider” in <em>Riders of the Musk</em>, a Canadian pornographic Western directed by fellow midget Atom Egoyan.",
        "notes": "",
        "tags": [
            "atom egoyan",
            "canada",
            "canadian midgets",
            "riders of the musk"
        ]
    },
    {
        "id": 198,
        "title": "Fact #198",
        "text": "According to a 2013 complaint filed by the state of New Hampshire, where Wesley Snipes operated a chain of celebrity dog grooming parlors, Snipes still owes state income tax amounting to $18.10. New Hampshire is the fourth state to come forward with income tax violations against Snipes following his 2011 death in a minimum security prison revolt.",
        "notes": "",
        "tags": [
            "death",
            "dog grooming",
            "prison revolt",
            "tax evasion"
        ]
    },
    {
        "id": 199,
        "title": "Fact #199",
        "text": "Wesley Snipes loved buckets.",
        "notes": "",
        "tags": [
            "buckets"
        ]
    },
    {
        "id": 200,
        "title": "Fact #200",
        "text": "Before he achieved fame as “The Lowrider,” the midget carnival barker/sexual masseur in the Atom Egoyan pornographic western trilogy <em>Riders of the Musk</em> (<em>Riders of the Musk</em>, <em>Riders of the Musk 2: Lobo’s Revenge</em>, and <em>Diggin’</em>), Wesley Snipes was known throughout Puerto Rico as the face of <em>Grandy’s Dandies</em>,a tobacco-flavored lollipop associated with the thriving midget population of San Juan in the 1980s.",
        "notes": "",
        "tags": [
            "atom egoyan",
            "grandy's dandies",
            "puerto rico",
            "riders of the musk"
        ]
    },
    {
        "id": 201,
        "title": "Fact #201",
        "text": "Josh Brolin is a midget.",
        "notes": "",
        "tags": [
            "josh brolin",
            "josh brolin facts"
        ]
    },
    {
        "id": 202,
        "title": "Fact #202",
        "text": "The “sexy sevens” referred to in the Wesley Snipes-Josh Brolin dry cleaning duet in Atom Egoyan’s <em>The Gray Curtain</em> was actually Brolin’s shoe size. Snipes, who suffered from acromegaly, was a size fifteen though he stood just under four feet tall.",
        "notes": "",
        "tags": [
            "atom egoyan",
            "gray curtain",
            "josh brolin",
            "celebrity shoe sizes"
        ]
    },
    {
        "id": 203,
        "title": "Fact #203",
        "text": "In 2002, Wesley Snipes starred opposite hot-headed homunculus Christian Slater in the Christopher Nolan time travel bro-com thriller <em>Little Daddies</em>. In the film, Slater, a repeat sperm donor with a comic book obsession, is confronted by seven of his progeny from the future (all played by Wesley Snipes) who have traveled back in time to kill him. In an unprecedented twist that divided critics at the time, Slater, actually a detective from an intergalactic abortion agency, turns out to be Snipes’ son, too. Celebrated for its “sweeping visual style” and “nuanced portrayal of midget time travelers,” <em>Little Daddies</em> was eventually released in Japan, where it became the top-grossing film of the year.",
        "notes": "",
        "tags": [
            "christian slater",
            "christopher nolan",
            "japanese box office hits",
            "little daddies"
        ]
    },
    {
        "id": 204,
        "title": "Fact #204",
        "text": "After his comeback as Mr. Whipple’s Evil Conscience in the 2008 Charmin Toilet Paper campaign, Don Johnson was offered a supporting role in James Franco’s low-budget production of Flannery O’Connor’s <em>A Good Man Is Hard to Find</em>. In Franco’s inventive script, all the main characters were to be played by men dressed as mice or mice dressed as men. In prison at the time, Wesley Snipes was signed on to play “a midget.” Fearing a confrontation,<sup>1</sup> Johnson walked off the set. He was later accidentally cast by Franco as Nat DuBois in Franco’s twenty-minute parkour version of Tennessee Williams’ <em>A Streetcar Named Desire</em>.",
        "notes": "<sup>1</sup>Both actors auditioned for the voice of the toilet bowl in Sydney Lumet’s <em>The Wiz</em>, a part which Snipes ultimately won, but which was later cut from the film.",
        "tags": [
            "charmin toilet paper commericials",
            "don johnson",
            "james franco",
            "sydney lumet",
            "wiz"
        ]
    },
    {
        "id": 205,
        "title": "Fact #205",
        "text": "Capitalizing on the success of “Chuck Norris Facts,” the Wesley Snipes Estate launched “Reverend Desmond Tutu Facts” in 2011. Reverend Tutu, a midget, filed a lawsuit against Snipes in 2012, unaware that Snipes had already been taxidermied in a prison tax revolt. Tutu has since dropped the suit against Snipes and refiled against Richard Simmons, the Wesley Snipes Estate executor and legal father of Snipes at the time of Snipes’ taxidermification.",
        "notes": "",
        "tags": [
            "death",
            "desmond tutu",
            "prison revolt",
            "richard simmons"
        ]
    },
    {
        "id": 206,
        "title": "Fact #206",
        "text": "Wesley Snipes’ paternal great-grandfather, Gamaleel Snipes, was a pygmy chieftain.",
        "notes": "",
        "tags": [
            "gamaleel snipes"
        ]
    },
    {
        "id": 207,
        "title": "Fact #207",
        "text": "Harold Becker’s original <em>Taps</em> script was a reworking of Werner Herzog’s <em>Even Dwarves Started Small</em> set on a rural Native American reservation where government agents threaten to shut down a single roulette machine run by local Ho-Chunk midgets. According to Becker’s notes, Wesley Snipes was to have played Ho-Chunk chief Sam “Weewee” Wasabit, a role that would eventually be rewritten for George C. Scott.",
        "notes": "",
        "tags": [
            "george c. scott",
            "harold becker",
            "taps",
            "werner herzog"
        ]
    },
    {
        "id": 208,
        "title": "Fact #208",
        "text": "Wesley Snipes’ final collaboration with Inuit funny man Steven Seagal, <em>Manhole Man</em>, was released in Romania and the Republic of Moldova with limited box office returns. In the film, Snipes’ character, Manhole, is a retired CIA operative living in the sewers of Bucharest who must “re-educate” ex-gangster Lou Diamond Phillips (played by Seagal) in the arts of subterranean warfare. Seagal later claimed that he was unaware at the time of writing of the existence of an American actor named Lou Diamond Phillips. Phillips, a Nicaraguan midget, would later sue both actors for brand infringement.",
        "notes": "",
        "tags": [
            "lou diamond phillips",
            "manhole man",
            "romania",
            "steven seagal"
        ]
    },
    {
        "id": 209,
        "title": "Fact #209",
        "text": "On the heels of their second collaboration, <em>Panza</em>,<sup>1</sup> Wesley Snipes and Val Kilmer each made an initial $2-million investment to franchise a Shugie’s Barbecue Shack restaurant in Detroit. Due to the fiscal mismanagement of Kilmer’s brother-in-law, Al Toomey, an on-again, off-again bookkeeper, Shugie’s went bankrupt within the year.",
        "notes": "<sup>1</sup> A picaresque epic set in inner-city Detroit and told through the eyes of a bedridden shoe salesman (Snipes). Filmed entirely in Barbadian.",
        "tags": [
            "panza",
            "shugie‘s barbecue",
            "val kilmer"
        ]
    },
    {
        "id": 210,
        "title": "Fact #210",
        "text": "Wesley Snipes was raised on Autrey’s Seafood Batter and buttermilk.",
        "notes": "",
        "tags": [
            "autrey’s seafood batter"
        ]
    },
    {
        "id": 211,
        "title": "Fact #211",
        "text": "In 1979, Lawrence “Gas House” Snipes, a maternal uncle, bought The Distinguished Gentleman All-Day House in Macon, Georgia, the first establishment of its kind in the deep south to offer pedicures to non-commissioned African-American naval officers.",
        "notes": "",
        "tags": [
            "african-american pedicures",
            "distinguished gentleman",
            "lawrence snipes"
        ]
    },
    {
        "id": 212,
        "title": "Fact #212",
        "text": "Wesley Snipes was born on a stool in the Tropicana Laundromat in San Juan, Puerto Rico.",
        "notes": "",
        "tags": [
            "birth",
            "puerto rico",
            "tropicana laundromat"
        ]
    },
    {
        "id": 213,
        "title": "Fact #213",
        "text": "Wesley Snipes and Janice Joplin were paternal cousins.",
        "notes": "",
        "tags": [
            "janice joplin"
        ]
    },
    {
        "id": 214,
        "title": "Fact #214",
        "text": "In the last minutes of his life, in a delirium, Wesley Snipes admitted to his cellmate and adopted nephew Norman Reedus to having shot Lee Harvey Oswald.",
        "notes": "",
        "tags": [
            "death",
            "lee harvey oswald",
            "norman reedus"
        ]
    },
    {
        "id": 215,
        "title": "Fact #215",
        "text": "Wesley Snipes turned down the role of Runt, an incontinent jazz saxophonist, in Mario Van Peebles’ <em>Gazelle</em>, the  biopic of “Gazelle Man” Siegfried Arkashian.",
        "notes": "",
        "tags": [
            "gazelle",
            "mario van peebles",
            "siegfriend arkashian"
        ]
    },
    {
        "id": 216,
        "title": "Fact #216",
        "text": "Wesley Snipes used the singular “pant” as a collective noun.",
        "notes": "",
        "tags": [
            "idiosyncracies"
        ]
    },
    {
        "id": 217,
        "title": "Fact #217",
        "text": "In the late 1980s, Wesley Snipes slept in a refrigerator box for a week before all of “Iron” Mike Tyson’s major pay-per-view bouts.",
        "notes": "",
        "tags": [
            "mike tyson"
        ]
    },
    {
        "id": 218,
        "title": "Fact #218",
        "text": "Wesley Snipes’ favorite meal was Brittany mussels fried in Bartles and Jaymes’ Sun Peak Peach wine cooler.",
        "notes": "",
        "tags": [
            "meals"
        ]
    },
    {
        "id": 219,
        "title": "Fact #219",
        "text": "Wesley Snipes was the first black midget in Hollywood to appear in a Nudie suit. His portrayal of Buffalo Jim Crake, the rodeo clown/WW2 code talker, in <em>Sparky</em> earned Snipes his first Oscar nomination, at the age of twenty-two.",
        "notes": "",
        "tags": [
            "buffalo jim crake",
            "midgets in nudie suits",
            "sparky"
        ]
    },
    {
        "id": 220,
        "title": "Fact #220",
        "text": "Wesley Snipes’ eleventh son, Wesley Jr. Lemon Scented Palmolive Snipes, will play “Chubby,” an underwater vampire, in Spike Lee’s new vampire film <em>Dat Sweet Blood</em>.",
        "notes": "",
        "tags": [
            "dat sweet blood",
            "spike lee",
            "wesley jr. lemon scented palmolive snipes"
        ]
    },
    {
        "id": 221,
        "title": "Fact #221",
        "text": "New evidence from Frank Stallone’s oral memoir <em>Man in the Shadows</em> suggests that Wesley Snipes, who was legally deaf, was coached extensively by Burt Young in his early roles. According to Stallone, Young, a mute, communicated with Snipes through a homemade ear pipe.",
        "notes": "",
        "tags": [
            "burt young",
            "frank stallone",
            "man in the shadows"
        ]
    },
    {
        "id": 222,
        "title": "Fact #222",
        "text": "To prove a point to an irate Emmanuel Lewis, Wesley Snipes once ate a Webster’s New World Dictionary.",
        "notes": "",
        "tags": [
            "emmanuel lewis"
        ]
    },
    {
        "id": 223,
        "title": "Fact #223",
        "text": "Months before his death, Wesley Snipes appeared alongside a bed-ridden Max Von Sydow in an unreleased Eric Roberts film about a worldwide flea infestation.",
        "notes": "",
        "tags": [
            "death",
            "eric roberts",
            "max von sydow"
        ]
    },
    {
        "id": 224,
        "title": "Fact #224",
        "text": "In 2011, Spike Lee issued a Wesley Snipes Commemorative Stamp. While not recognized in the Continental U.S., the Snipes Stamp is valid postal currency in Hawaii and Puerto Rico, as well as in Uruguay, Costa Rica, Nicaragua, Senegal, the Ivory Coast, and Nigeria.",
        "notes": "",
        "tags": [
            "snipes commemorative stamp",
            "spike lee"
        ]
    },
    {
        "id": 225,
        "title": "Fact #225",
        "text": "Early in his career Wesley Snipes threatened late-night talk show host Tom Snyder with a plate of melted cheese he claimed was a melted white man. Snyder, who humored Snipes, finished the interview under the assumption that Snipes had killed and melted a man and brought the remains to the CBS studio on a plate.",
        "notes": "",
        "tags": [
            "tom snyder"
        ]
    },
    {
        "id": 226,
        "title": "Fact #226",
        "text": "Wesley Snipes’ original breakdancing troupe, Little W and the Air Attack, disappeared in Los Mochis, Mexico, en route to the Magic Sands Family Hotel in Acapulco in 1992. They were last seen heading West in a dump truck. Snipes, who never traveled with the troupe, arrived in Acapulco a day later by remote control helicopter.",
        "notes": "",
        "tags": [
            "little w and the air attack",
            "mysteries"
        ]
    },
    {
        "id": 227,
        "title": "Fact #227",
        "text": "After learning to read at the age of forty-six, Wesley Snipes became an avid follower of the Carlton Fisk Speed Reading Method, or the Fisk Method. Fisk and Snipes exchanged many emails detailing interpretations of the finer points of the Fisk Method throughout Snipes’ incarceration at Guantanamo Bay. When Fisk died in a rubber cementing accident in 2008, Snipes assumed control of the successful speed reading franchise with majority approval (thirty-one percent) coming from the Fisk Estate. In 2011, in the wake of Snipes’ prison tanninization and subsequent bottling as a fine wine, the Fisk Method and the Two-Minute Fisk Method passed into the hands of fitness guru Richard Simmons, the executor of the Snipes Estates and Snipes’ legal father.",
        "notes": "",
        "tags": [
            "carlton fisk",
            "carlton fisk speed reading method",
            "death",
            "many talents of wesley snipes",
            "richard simmons",
            "speed reading"
        ]
    },
    {
        "id": 228,
        "title": "Fact #228",
        "text": "Wesley Snipes’ ninth wife, Freida Komay, died in a freak timeshare accident.",
        "notes": "",
        "tags": [
            "freida komay"
        ]
    },
    {
        "id": 229,
        "title": "Fact #229",
        "text": "In an extended interview with James Lipton, Wesley Snipes discussed the difficulties of starring in ET as a virtual unknown.",
        "notes": "",
        "tags": [
            "et",
            "james lipton"
        ]
    },
    {
        "id": 230,
        "title": "Fact #230",
        "text": "A lawsuit on behalf of over 1,000 former Black Entertainment Television employees cites Snipes as the originator of the Dahomey Witch Hazel Hemorrhoid Removal Technique, which plagued channel executives for most of the 1990s.",
        "notes": "",
        "tags": [
            "black entertainment television",
            "dahomey witch hazel hemorrhoid removal technique"
        ]
    },
    {
        "id": 231,
        "title": "Fact #231",
        "text": "Wesley Snipes once shot and poisoned director Guy Ritchie with a Somali blowpipe.",
        "notes": "",
        "tags": [
            "guy ritchie"
        ]
    },
    {
        "id": 232,
        "title": "Fact #232",
        "text": "Wesley Snipes’ eleventh wife, Totti Leguizamo, fraternal twin of actor John, divorced Snipes while he was in prison on the grounds that the noises Snipes made licking his fingers while eating corn chips had derailed her acting career.",
        "notes": "",
        "tags": [
            "totti leguizamo"
        ]
    },
    {
        "id": 233,
        "title": "Fact #233",
        "text": "Wesley Snipes pronounced the word Guyana with a soft Brazilian “g.”",
        "notes": "",
        "tags": [
            "guyana"
        ]
    },
    {
        "id": 234,
        "title": "Fact #234",
        "text": "Between May and December 1997, during a rigorous two-week shoot for Robert Altman’s visionary tubular hacking sci-fi dystopia, <em>Rem</em>,<sup>1</sup> Wesley Snipes told reporters he was living in a shoebox mansion on Varnum Street in Washington, D.C. so he could stay in character. According to Wheezy Hendricks, a veteran D.C. bum, Snipes was nowhere near Varnum Street, but lived in a UPS container store on Lamont Street where his then-girlfriend Taiwana Little worked as an undercover air hostess.",
        "notes": "<sup>1</sup> Posits a near future where rollerblading energy runners glide through a hive-like network of tubes to deliver misinformation to their obese overlords",
        "tags": [
            "rem",
            "robert altman",
            "wheezy hendricks"
        ]
    },
    {
        "id": 235,
        "title": "Fact #235",
        "text": "While in prison, Wesley Snipes starred in three episodes of the Nigerian soap opera <em>Lumu on Broad Street</em>, the Nigerian <em>Cheers</em>. Snipes character, Obinse, the Nigerian Norm, was written out of the series shortly after his first appearance with producers citing an obscure Nigerian law forbidding imprisoned actors from appearing in more than three consecutive TV episodes.",
        "notes": "",
        "tags": [
            "lumu on broad street",
            "nigerian soap operas"
        ]
    },
    {
        "id": 236,
        "title": "Fact #236",
        "text": "In the unaired pilot for the mid-‘90s sitcom, <em>Dodee Leaves Frank</em>, Wesley Snipes played a hard-working student guide (Troy Forrests) battling an unspecified sleeping sickness. The pilot was produced by Sammy Hagar and featured a twenty-second Hagar cameo in which Hagar seizes an ownerless chihuahua and shakes it.",
        "notes": "",
        "tags": [
            "dodee leaves frank",
            "sammy hagar",
            "sitcoms"
        ]
    },
    {
        "id": 237,
        "title": "Fact #237",
        "text": "Wesley Snipes’ 2010 prison start-up, <em>Massage in a Bottle</em>, was voted prison innovation of the year by the Black Entertainment Television. In 2011, the business — a massage service where midgets arrived at private residences inside translucent “body tubes” and then “uncorked” themselves to give full-body massages — suffered insurmountable setbacks<sup>1</sup> despite heavy, last-minute donations from an unspecified coterie of Nigerian businessmen.",
        "notes": "<sup>1</sup>Nickie Tumer, brother-in-law of Snipes’ ninth wife, cane sugar cube mogul Eliza Sponza, was believed to have embezzled half of the original investment.",
        "tags": [
            "black entertainment television"
        ]
    },
    {
        "id": 238,
        "title": "Fact #238",
        "text": "Unlike ninety percent of pituitary midgets, Wesley Snipes was not a midget from birth.",
        "notes": "",
        "tags": [
            "pituitary midgetism"
        ]
    },
    {
        "id": 239,
        "title": "Fact #239",
        "text": "In a paid eulogy delivered to the answering machine of Harvey Weinstein, who he had confused for Gerry Heinberg, Snipes’ one-time publicist, Ving Rhames reputedly said that Snipes was a “hard-working midget.” For twenty years following his appearance in <em>Pulp Fiction</em> and his cameo as Dr. Bulgo in <em>The Sweeper</em>, Rhames earned union wages writing and delivering celebrity eulogies.",
        "notes": "",
        "tags": [
            "eulogies",
            "pulp fiction",
            "ving rhames"
        ]
    },
    {
        "id": 240,
        "title": "Fact #240",
        "text": "According to longtime friend Ronda Rousey, due to a boyhood motor-boating incident, Wesley Snipes was physically incapable of vomiting.",
        "notes": "",
        "tags": [
            "ronda rousey",
            "vomiting"
        ]
    },
    {
        "id": 241,
        "title": "Fact #241",
        "text": "To play midget plastic explosives expert Ned Romain Jr., a.k.a “Little Ned,” in <em>The Expendables 3</em>, the Snipes Estate hired Barbara Hundis, a Snipes impersonator best known for her work at Snipes’ funeral as Snipes’ stand-in cadaver.",
        "notes": "",
        "tags": [
            "barbara hundis",
            "expendables 3",
            "stunt doubles"
        ]
    },
    {
        "id": 242,
        "title": "Fact #242",
        "text": "Playing Jewish provocateur Nelson Piles in Paul Greengrass’s 2009 remake of the 1969 academy award-winning <em>The Rug</em>, Wesley Snipes, out on two-week furlough, purportedly ate a bag of raw mixed hot peppers to prepare for his final scene with maniac Persian rug salesman Denny Cavendish (Barry Pepper).",
        "notes": "",
        "tags": [
            "barry pepper",
            "paul greengrass",
            "rug"
        ]
    },
    {
        "id": 243,
        "title": "Fact #243",
        "text": "To play dental tape mogul Delmore Schwartz in <em>Give Me Mercy: The Delmore Schwartz Story</em>, Wesley Snipes gained sixity-five pounds and taught himself Yiddish.",
        "notes": "",
        "tags": [
            "delmore schwartz",
            "give me mercy",
            "many talents of wesley snipes"
        ]
    },
    {
        "id": 244,
        "title": "Fact #244",
        "text": "Wesley Snipes wasn’t the only midget to read for the voice of Blemish, a Colombian soft taco truck in Mel Schumacher’s <em>Transformers 4: Rise of the Two-Wheel Drive Menaces</em>. Comedian John Oliver and Peter Weller also claimed to have auditioned for the part, which ultimately went to Pepe Serna, a Hobson’s dwarf of Israeli-Austrian descent",
        "notes": "",
        "tags": [
            "john oliver",
            "mel schumacher",
            "pepe serna",
            "peter weller"
        ]
    },
    {
        "id": 245,
        "title": "Fact #245",
        "text": "Wesley Snipes was tapped for the role of Jefferson Kotto in Chico Ojiro’s <em>High Chapparal: The Yaphet Kotto Story</em>. At the last minute, however, Ojiro withdrew the offer when he found out that Snipes, a notorious tax evading midget, had died in prison.",
        "notes": "",
        "tags": [
            "chico ojiro",
            "high chapparal",
            "yaphet kotto"
        ]
    },
    {
        "id": 246,
        "title": "Fact #246",
        "text": "Cannibal priestess/moon goddess Dr. Brittney Cooper dedicated her latest Kickstarter project <em>Gaza: A Tribute to Harriet Tubman</em> to Wesley Steenburgen Snipes, Snipes’ stepson from his fifth marriage to adopted daughter of Mary Steenburgen, Lena “Jerry Lee Lewis” Steenburgen.",
        "notes": "",
        "tags": [
            "brittney cooper",
            "lena jerry lee lewis steenburgen",
            "wesley steenburgen snipes"
        ]
    },
    {
        "id": 247,
        "title": "Fact #247",
        "text": "Wesley Snipes’ great maternal uncle, Renaldo Escobar de Suiza, re-invented asphalt in Puerto Rico in 1957. Puerto Rican asphalt, nicknamed “de Suiza,” is used today in Sierra Leone, Madagascar, and the breakaway Republic of Lesser Kazakhstan. It was also the preferred driving surface of monotesticled Texan bicyclist Lance Armstrong.",
        "notes": "",
        "tags": [
            "asphalt",
            "lance armstrong",
            "puerto rico",
            "renaldo escobar de suiza"
        ]
    },
    {
        "id": 248,
        "title": "Fact #248",
        "text": "A week before his death in the ill-fated Lewis Run Tax Evaders Prison Revolt, Wesley Snipes performed a Haitian voodoo rite with fellow entertaining midget Sean Penn to ward off future hurricanes in the Carribeans. The performance also starred Alex Trebek, Tonya Harding (on her comeback tour), Hubert Gerulaitus (brother of the late Vitus and a supporter of Penn’s philanthropic work in Haiti), and Jesse Orosco. The ceremony was broadcast throughout the prison on closed circuit TV.",
        "notes": "",
        "tags": [
            "alex trebek",
            "death",
            "haitian voodoo",
            "hubert gerulaitus",
            "jesse orosco",
            "prison revolt",
            "sean penn",
            "tonya harding"
        ]
    },
    {
        "id": 249,
        "title": "Fact #249",
        "text": "Wesley Peabody Snipes was the youngest midget to have been inducted into the Little Performers wing of the Little Men’s Hall of Fame in Marin County, California.",
        "notes": "",
        "tags": [
            "little men’s hall of fame"
        ]
    },
    {
        "id": 250,
        "title": "Fact #250",
        "text": "It was Wesley Snipes, playing a nameless German sniper, who shot Mark Lee in Peter Weir’s 1981 Dune spinoff <em>Gallipoli</em>. Snipes would later remark that upon realizing he was a midget, Weir jokingly suggested that he should get paid in proportion to his body size. In retribution, Snipes shouted in Pig Latin<sup>1</sup> at the critical moment when Lee is shot for a record 200 takes, at which point Weir fired Snipes and brought in Austrian figure skating champion Klaus Kinski.",
        "notes": "<sup>1</sup>Snipes is a respected Pig Latinist.",
        "tags": [
            "gallipoli",
            "klaus kinksi",
            "pig latin",
            "peter weir"
        ]
    },
    {
        "id": 251,
        "title": "Fact #251",
        "text": "Wesley Snipes was known to refuse noodles as many as three times a night.",
        "notes": "",
        "tags": [
            "noodles"
        ]
    },
    {
        "id": 252,
        "title": "Fact #252",
        "text": "Wesley Snipes never had a zip code.",
        "notes": "",
        "tags": [
            "celebrities without zip codes"
        ]
    },
    {
        "id": 253,
        "title": "Fact #253",
        "text": "Wesley Snipes’ final request before his death was to hear midget friend and fellow Pig Latinist Sean Penn re-record Harry Belafonte’s classic <em>Banana Boat Song</em> with the Chipmunks.",
        "notes": "",
        "tags": [
            "chipmunks",
            "harry belafonte",
            "pig latin",
            "sean penn"
        ]
    },
    {
        "id": 254,
        "title": "Fact #254",
        "text": "Wesley Snipes was the nephew of film critic Roger Ebert.",
        "notes": "",
        "tags": [
            "roger ebert"
        ]
    },
    {
        "id": 255,
        "title": "Fact #255",
        "text": "For the final scene of <em>Trigger Happy</em>, in which all the other characters drink paint thinner before shooting each other in the shins at the bidding of Barba Grossa (Al Pacino), Wesley Snipes was the lone voice of dissent, demanding that his refreshment be clearly labeled “Liquid Kickass.” Referencing the scene on Inside the Actors Studio with one-time French pimp James Lipton, Pacino remembered Snipes as a “classy but repugnant little man.”",
        "notes": "",
        "tags": [
            "al pacino",
            "inside the actors studio",
            "james lipton",
            "trigger happy"
        ]
    },
    {
        "id": 256,
        "title": "Fact #256",
        "text": "As a child Snipes never learned how to play marbles.",
        "notes": "",
        "tags": [
            "many talents of wesley snipes",
            "marbles"
        ]
    },
    {
        "id": 257,
        "title": "Fact #257",
        "text": "The part of Moses Hightower (Bubba Smith) in <em>Police Academy</em> was originally written for a young Wesley Snipes.",
        "notes": "",
        "tags": [
            "bubba smith",
            "police academy"
        ]
    },
    {
        "id": 258,
        "title": "Fact #258",
        "text": "Brian Dennehey and Wesley Snipes collaborated on a children’s book called <em>The Awesome Adventures of Chuck E. Cheese</em>. The book was co-written with dwarf vegetarian Jonathan Safran Foer.",
        "notes": "",
        "tags": [
            "brian dennehy",
            "chuck e. cheese",
            "jonathan safran foer"
        ]
    },
    {
        "id": 259,
        "title": "Fact #259",
        "text": "<em>The Awesome Adventures of Chuck E. Cheese</em>, inspired by a series of finger paintings Brian Dennehy made as a chicken while under deep hypnosis, was the first children’s book to see a working collaboration between an African American midget (Wesley Snipes) and a Caucasian dwarf (Jonathan Safran Foer).",
        "notes": "",
        "tags": [
            "brian dennehy",
            "chuck e. cheese",
            "jonathan safran foer"
        ]
    },
    {
        "id": 260,
        "title": "Fact #260",
        "text": "In at least five Parisian district courts Jonathan Safran Foer is considered the only living heir to the Wesley Snipes Estate.",
        "notes": "",
        "tags": [
            "jonathan safran foer"
        ]
    },
    {
        "id": 261,
        "title": "Fact #261",
        "text": "Jonathan Safran Foer, heir to Wesley Snipes’ tax-adjusted estate in France, is a dwarf.",
        "notes": "",
        "tags": [
            "jonathan safran foer",
            "celebrity dwarfs"
        ]
    },
    {
        "id": 262,
        "title": "Fact #262",
        "text": "Joyce Carol Oates, who dedicated her 1996 novel <em>We Were the Mulvaneys</em> to Wesley Snipes, is a dwarf, not a midget.",
        "notes": "",
        "tags": [
            "joyce carol oates",
            "celebrity dwarfs"
        ]
    },
    {
        "id": 263,
        "title": "Fact #263",
        "text": "Wesley Snipes petitioned the John D. MacArthur Foundation for a genius grant once a year between 1994 and 2011, believing falsely that the MacArthurs were all midgets.<sup>1</sup>",
        "notes": "<sup>1</sup>Like writer Jonathan Safran Foer, they are dwarves.",
        "tags": [
            "celebrity dwarfs",
            "john r. macarthur",
            "macarthur foundation"
        ]
    },
    {
        "id": 264,
        "title": "Fact #264",
        "text": "Wesley Snipes was once slidetackled at Ben Gurion airport by Yoram Globus.",
        "notes": "",
        "tags": [
            "yoram globus"
        ]
    },
    {
        "id": 265,
        "title": "Fact #265",
        "text": "In an ironic twist of fate, it was Wesley Snipes’ half-brother, Neville Doodee II, who was voted “most likely to evade his taxes” at high school graduation.",
        "notes": "",
        "tags": [
            "neville doodee II",
            "tax evasion"
        ]
    },
    {
        "id": 266,
        "title": "Fact #266",
        "text": "To many in the entertainment community, including John Heard, Wesley Snipes’ midgetism was a total shock.",
        "notes": "",
        "tags": [
            "john heard",
            "pituitary midgetism"
        ]
    },
    {
        "id": 267,
        "title": "Fact #267",
        "text": "According to prison comedian Leo “Boombox” Simmons, Wesley Snipes was visited in prison twice by commodities agents from the Bank of Ecuador.",
        "notes": "",
        "tags": [
            "bank of ecuador",
            "leo boombox simmons"
        ]
    },
    {
        "id": 268,
        "title": "Fact #268",
        "text": "In 1993, Wesley Snipes rewrote the Paraguayan national anthem with Mexico’s “little toreador” Herman El Tigre Muñoz. Snipes and Muñoz’s revisions were never officially adopted by Paraguay.",
        "notes": "",
        "tags": [
            "herman el tigre munoz",
            "paraguay"
        ]
    },
    {
        "id": 269,
        "title": "Fact #269",
        "text": "In 2001, after nearly two decades of sporadic touring, Wesley Snipes’ Danish-backed Credence Clearwater Revival cover band played its final concert at Thomas “The Hitman” Hearns’ Good Vibes Beach Bar in Paramaribo, Suriname.",
        "notes": "",
        "tags": [
            "credence clearwater revival",
            "thomas the hitman hearns"
        ]
    },
    {
        "id": 270,
        "title": "Fact #270",
        "text": "When counting to five, Snipes typically used both of his thumbs, a gesture originally attributed to Steven Seagal.",
        "notes": "",
        "tags": [
            "steven seagal"
        ]
    },
    {
        "id": 271,
        "title": "Fact #271",
        "text": "Wesley Snipes’ corpse will be catapulted from a steam train and then used as a toboggan by Dolph Lundgren in <em>The Expendables 4</em>.",
        "notes": "",
        "tags": [
            "death",
            "dolph lundgren",
            "expendables 4"
        ]
    },
    {
        "id": 272,
        "title": "Fact #272",
        "text": "A recently discovered script of Sydney Lumet’s final film-in-progress, <em>Black Ice</em>, reveals that Wesley Snipes was to have played the titular comic book hero whose chief power was his ability to turn himself into any black substance in existence, including something called “black ice.” His nemesis Folderall, a shape-shifting bucket, was to have been played by Val Kilmer.",
        "notes": "",
        "tags": [
            "black ice",
            "sydney lumet",
            "val kilmer"
        ]
    },
    {
        "id": 273,
        "title": "Fact #273",
        "text": "After Brian Dennehy sold his shares in the Chuck E. Cheese franchise to Frank Stallone, Wesley Snipes enticed the aging actor into investing in limited edition ebony and vanilla-flavored <em>Flavor Sticks</em>. The product, which was available in twelve shades ranging from “moonglow white” to “wenge blackout”, was available for three weeks at participating Wawa convenience stores.",
        "notes": "",
        "tags": [
            "brian dennehy",
            "chuck e. cheese",
            "flavor sticks",
            "frank stallone"
        ]
    },
    {
        "id": 274,
        "title": "Fact #274",
        "text": "Chris Rock’s Jerry Seinfeld spinoff <em>Dwarves at the Carwash</em> was inspired in part by an unpublished Wesley Snipes telephone rant.",
        "notes": "",
        "tags": [
            "dwarves at the carwash",
            "jerry seinfeld"
        ]
    },
    {
        "id": 275,
        "title": "Fact #275",
        "text": "When Cheech Marin was offered the role of Banzai the Hyena in Martin Amis’s <em>The Lion King</em>, Wesley Snipes bombarded Disney studio executives with credible hyena impersonations until they promised him the role of “Singing Grass” in the Veldt Transformation scene. The scene was ultimately cut from the film.",
        "notes": "",
        "tags": [
            "cheech marin",
            "lion king",
            "martin amis",
            "singing grass"
        ]
    },
    {
        "id": 276,
        "title": "Fact #276",
        "text": "Wesley Snipes’ paternal great-aunt, Joan Doodee, was the early face of King Biscuit Seafood Dredge.",
        "notes": "",
        "tags": [
            "joan doodee",
            "king biscuit seafood dredge"
        ]
    },
    {
        "id": 277,
        "title": "Fact #277",
        "text": "Despite his mechanical anus, Wesley Snipes once defeated Robert Guillaume in an arm-wrestling match.",
        "notes": "",
        "tags": [
            "mechanical anuses",
            "robert guillaume"
        ]
    },
    {
        "id": 278,
        "title": "Fact #278",
        "text": "It was Wesley Snipes who convinced Dylan Cash to grow the mustache that ultimately sabotaged Cash’s post-General Hospital career.",
        "notes": "",
        "tags": [
            "dylan cash",
            "general hospital"
        ]
    },
    {
        "id": 279,
        "title": "Fact #279",
        "text": "In 1995, Wesley Snipes approached TV Tokyo studio executives in Japan with an idea for a <em>Benson</em> prequel in which the Benson character (played by Snipes) wandered French suburban supermarkets in search of backgammon opponents. According to Snipes, the ensuing supermarket confrontations would be entirely unscripted and filmed with hidden cameras.",
        "notes": "",
        "tags": [
            "benson prequel"
        ]
    },
    {
        "id": 280,
        "title": "Fact #280",
        "text": "Snipes was one of six historical midgets to be equipped with a functioning mechanical anus. Other celebrities with mechanical anuses include: Sean Penn, Huey Lewis, Gary Coleman, Victor Ortiz, and Mahatma Gandhi.",
        "notes": "",
        "tags": [
            "gary coleman",
            "huey lewis",
            "mahatma gandhi",
            "mechanical anuses",
            "sean penn",
            "victor ortiz"
        ]
    },
    {
        "id": 281,
        "title": "Fact #281",
        "text": "Melvin Van Peebles’ <em>The Life and Times of Edgar J. Pony</em>, a Harlem man convinced he was a couch, was the first film in which Snipes was cast as a midget. Ironically, the real Edgar J. Pony was not a midget.",
        "notes": "",
        "tags": [
            "life and times of edgar j. pony",
            "melvin van peebles"
        ]
    },
    {
        "id": 282,
        "title": "Fact #282",
        "text": "Wesley Snipes began his career as one half of the comedy duo Doctor Bonzo (Rick Moranis) and the Dandelion Kid. As the Dandelion Kid, Snipes would pop out of one of three man-sized flower pots in a yellow suit complete with a puffy dandelion head piece. Moranis, a blind fiddler, would then try to hose Snipes down with topical poisons. Eventually, Snipes would belay down from the rafters on a silk string, landing on Moranis’s head and pulling off his glasses. Doctor Bonzo and the Dandelion Kid were a hit in provincial Canada.",
        "notes": "",
        "tags": [
            "canada",
            "doctor bonzo and the dandelion kid",
            "rick moranis"
        ]
    },
    {
        "id": 283,
        "title": "Fact #283",
        "text": "Wesley Snipes was forty-eight when he was incinerated in his prison waste basket.",
        "notes": "",
        "tags": [
            "death"
        ]
    },
    {
        "id": 284,
        "title": "Fact #284",
        "text": "Among his earliest memories of Puerto Rico, Wesley Snipes cites the 1958 theft of Moses Dardanelles’ hubcaps. Dardanelles, a cigar thief and midget, would go on to become the second unofficial president of Puerto Rico, whose Casita Blanca was an exact 1:4 replica of the U.S. White House.",
        "notes": "",
        "tags": [
            "moses dardanelles",
            "puerto rico"
        ]
    },
    {
        "id": 285,
        "title": "Fact #285",
        "text": "In prison, Wesley Snipes became an avid jigsaw puzzler. Snipes’ unique contributions to the sport include an annoted list of competitive jigsaw puzzling shortcuts, a signed copy of which fetched $45,000 at a posthumous Sootheby’s auction.",
        "notes": "",
        "tags": [
            "competitive puzzling",
            "sootheby's"
        ]
    },
    {
        "id": 286,
        "title": "Fact #286",
        "text": "In Burkina Faso, a Bocce-playing Wesley Snipes in knee-length tube socks is worshipped as a tutelary deity.",
        "notes": "",
        "tags": [
            "bocce",
            "burkina faso"
        ]
    },
    {
        "id": 287,
        "title": "Fact #287",
        "text": "In an obscure Malibu criminal lawsuit, Jewish midget and Wesley Snipes impersonator Aaaron Schwab, Jr. accused actor Sean Penn of attempted first-degree murder, claiming Penn had placed a $30,000 fatwa on his head. At the bidding of Wesley Snipes, Penn sent Schwab a Broil King Imperial 490 gas grill to difuse the situation.",
        "notes": "",
        "tags": [
            "aaron schwab",
            "sean penn"
        ]
    },
    {
        "id": 288,
        "title": "Fact #288",
        "text": "According to inmate publicist Adam Modine, the allegation that Wesley Snipes couldn’t stand uncooked bacon in the vicinity of his toiletries was invented by prison crack-up Leroy Weathers.",
        "notes": "",
        "tags": [
            "adam modine",
            "leroy weathers"
        ]
    },
    {
        "id": 289,
        "title": "Fact #289",
        "text": "In W.S. Merwin’s poem <em>The Thief of Time And Time</em>, the frozen pelican at the foot of the Wacambe Tree was said to be midget Wesley Snipes (motion in stasis), while the pelican flying into his frozen reflection (Gary Busey, a close friend of Merwin) symbolized “the horrors of Hollywood and Iraq.”",
        "notes": "",
        "tags": [
            "gary busey",
            "w.s. merwin"
        ]
    },
    {
        "id": 290,
        "title": "Fact #290",
        "text": "As an early backer of Carl Stanley Submersibles, Wesley Snipes became the first<sup>1</sup> African-American midget to break the underwater mile barrier.",
        "notes": "<sup>1</sup>In late 2013, Canadian midget Robin Thicke became the second.",
        "tags": [
            "african-american midgets",
            "carl stanley submeribles",
            "robin thicke"
        ]
    },
    {
        "id": 291,
        "title": "Fact #291",
        "text": "In response to Pepperidge Farm’s Vanilla Chip Cookies (2003), Wesley Snipes took out a full-page ad in <em>Ebony Magazine</em> plugging a Mexican cookie he called “The Villechaize,” after fellow entertaining midget Herve Villechaize.<sup>1</sup>",
        "notes": "<sup>1</sup> Villechaize who was French, not Mexican, was dead at the time, having drowned in chocolate sauce in his bathtub a decade earlier.",
        "tags": [
            "cookies",
            "ebony magazine",
            "pepperidge farms",
            "herve villechaize"
        ]
    },
    {
        "id": 292,
        "title": "Fact #292",
        "text": "When he launched it from prison in 2010, Snipes’ <em>Negro Messiah</em> cologne sparked an unprecedented number of lawsuits for brand infringement. Eventually, a class action lawsuit was filed. Plaintiffs included: Hank Azaria, Israeli dwarf/prime minister Benjamin Netanyahu, the City State of Ethiopia, and guitarist Steve Winwood, whose own Negro Messiah cologne is still for sale in department stores in British Columbia.",
        "notes": "",
        "tags": [
            "benjamin netanyahu",
            "canadian colognes",
            "hank azaria",
            "negro messiah",
            "steve winwood"
        ]
    },
    {
        "id": 293,
        "title": "Fact #293",
        "text": "Snipes 1994 album <em>Snootin’: A Tribute to Billy Carter</em> was once hailed by former president Jimmy Carter as a “long-awaited remedy to Nashville’s tired regurgitation of country standards and…[other types of] popcorn music.”",
        "notes": "",
        "tags": [
            "billy carter",
            "jimmy carter",
            "many talents of wesley snipes",
            "snootin’"
        ]
    },
    {
        "id": 294,
        "title": "Fact #294",
        "text": "Wesley Snipes was an accomplished nose flautist, an instrument he took up in the Cairo, Illinois lock-up after passing a bad check at Smokey D’s Family Restaurant.",
        "notes": "",
        "tags": [
            "cairo illinois",
            "many talents of wesley snipes",
            "smokey d’s"
        ]
    },
    {
        "id": 295,
        "title": "Fact #295",
        "text": "In Monrovia, Liberia, Gumba Tuesday, a holiday devoted to plaid-shorts-wearing Portuguese trickster divinity Gumba, was recently replaced by Snipes-a-thon Tuesday.<sup>1</sup>",
        "notes": "<sup>1</sup>On the second Tuesday of every month, Liberian state TV will be broadcasting Snipes’ movies non-stop. Rights to the films were granted to Eldor Malabi’s TV 9 in perpetuity by Richard Simmons, executor of the Snipes Estate.",
        "tags": [
            "gumba tuesday",
            "liberia",
            "richard simmons"
        ]
    },
    {
        "id": 296,
        "title": "Fact #296",
        "text": "Orson Scott Card’s Middle Earth YA Erotic Thriller <em>The Seeds of Clarisian</em> was optioned by the Snipes Estate in 2012, a year after Snipes’ mysterious disappearance from the prison laundry room,<sup>1</sup> with the following standard post-mortem contractual riders: 1) any character taller than Snipes would appear in the film on a paddle-driven wheel-and-board apparatus; 2) Snipes CGI avatar would be equipped with a crossbow that could double as a bullhorn.",
        "notes": "<sup>1</sup> Snipes’ desiccated corpse was discovered weeks later as 375 pieces of flesh-formed double-ply fabric softener sheets in a box being smuggled out of the prison cafeteria",
        "tags": [
            "death",
            "orson scott card",
            "seeds of clarisian"
        ]
    },
    {
        "id": 297,
        "title": "Fact #297",
        "text": "In 1974, as the voice of Dumpass, Fat Albert’s tamale-peddling second cousin, a teenage Wesley Snipes earned an Emmy nomination. It was his second collaboration with Bill Cosby. Dumpass was eventually cut from the series. By that time Snipes had already achieved critical acclaim as the child-pimp in Martin Scorsese’s <em>Mean Streets</em>.",
        "notes": "",
        "tags": [
            "bill cosby",
            "dumpass",
            "martin scorsese",
            "mean streets"
        ]
    },
    {
        "id": 298,
        "title": "Fact #298",
        "text": "In 1989, with sometime collaborator Mugs Foster (best known as Rudy Ray Moore’s dentist), Snipes optioned rights for a serialization of Foster’s screenplay <em>The Cube</em>, a stop-motion animated adventure starring a talking Rubik’s Cube (Ed Asner) and Sacheen Littlefeather, father of Snipes’ fifth son, Robert Cookies and Cream Twix Mugs Snipes.",
        "notes": "",
        "tags": [
            "ed asner",
            "mugs foster",
            "robert cookies and cream twix mugs snipes",
            "rudy ray moore",
            "sacheen littlefeather"
        ]
    },
    {
        "id": 299,
        "title": "Fact #299",
        "text": "Wesley Snipes had a fraught friendship with Canadian harpist Michael Bolton. And yet, when Bolton staged his comeback tour, <em>Goethe for Organ and Fife</em>, in 1996 and was incapacitated by gout, it was Snipes, disguised as an imp, who operated Bolton’s foot pedals.",
        "notes": "",
        "tags": [
            "gout",
            "michael bolton"
        ]
    },
    {
        "id": 300,
        "title": "Fact #300",
        "text": "On a red-eye flight to Chicago, Wesley Snipes challenged aging actor Lloyd Bridges to a spitball fight. The melee that ensued eventually grounded the Boeing 767 in St. Paul, an hour short of its destination. Bridges later recalled the flight as the happiest of his life.",
        "notes": "",
        "tags": [
            "lloyd bridges",
            "memorable spitball fights"
        ]
    },
    {
        "id": 301,
        "title": "Fact #301",
        "text": "As a struggling actor in Paris in the late 1980s, Wesley Snipes posed as cement outside Restaurant Lapérouse.",
        "notes": "",
        "tags": [
            "paris",
            "restaurant laperouse",
            "many talents of wesley snipes"
        ]
    },
    {
        "id": 302,
        "title": "Fact #302",
        "text": "Ocean Pacific’s original velcro wallet midget was Wesley Snipes.",
        "notes": "",
        "tags": [
            "ocean pacific"
        ]
    },
    {
        "id": 303,
        "title": "Fact #303",
        "text": "Out on furlough in late 2009, Wesley Snipes carried out a bag of LeBron James’ trash. James claimed that Snipes, who left his gated village waving from the cockpit of a John Deer mini-digger, told him he was on his way to take out country western singer Willie Nelson’s trash.",
        "notes": "",
        "tags": [
            "lebron james",
            "willie nelson"
        ]
    },
    {
        "id": 304,
        "title": "Fact #304",
        "text": "According to Alan Zerbe, Roman Coppola’s one-time dog walker, rumors that Coppola had been “wagered” by Wesley Snipes as collateral in an all-night poker tournament with <em>Sunshine Buddies of Tchoupitoulas Street</em> co-stars Don Johnson (Spitball Eddie) and Morgan Freeman (Garbage Jackson) were true. Coppola, whose Screen Writers Guild membership fees had lapsed, disqualifying him from legal aid, became Johnson’s indentured servant for a year.",
        "notes": "",
        "tags": [
            "alan zerbe",
            "don johnson",
            "morgan freeman",
            "roman coppola"
        ]
    },
    {
        "id": 305,
        "title": "Fact #305",
        "text": "<em>Mr. McClutsky’s Gift</em>, about a purportedly toxic rabbit who brings a special Christmas message to a poor Detroit suburb, was Wesley Snipes’ fifth collaboration with Helmond Cameron (<em>Lights, Camera, Sit!</em>, <em>Carmine Is No Longer Your Carmine</em>, <em>Vital Idol</em>, etc.) The film was nominated for Best Original Materials Used in a Credits Sequence.",
        "notes": "",
        "tags": [
            "mr. mclutsky’s gift",
            "helmond cameron"
        ]
    },
    {
        "id": 306,
        "title": "Fact #306",
        "text": "Prior to his success as Hank Schrader, a Mexican hammock salesman in the AMC original <em>Breaking Bad</em>, Dean Norris was Wesley Snipes’ white midget stand-in.",
        "notes": "",
        "tags": [
            "breaking bad",
            "dean norris"
        ]
    },
    {
        "id": 307,
        "title": "Fact #307",
        "text": "Bob Dylan, a Symmond’s dwarf,<sup>1</sup> dedicated an unreleased bootleg recording of the Dave Van Ronk classic <em>Hey, Little Man!</em> to Wesley Snipes following Snipes’ third unsuccessful parole hearing.",
        "notes": "<sup>1</sup>Symmond’s dwarves are usually born with an extra first vertebra, also called “lemur neck.” Dylan was born with an extra second toe.",
        "tags": [
            "bob dylan",
            "dave van ronk",
            "tax evasion"
        ]
    },
    {
        "id": 308,
        "title": "Fact #308",
        "text": "Wesley Snipes once played the bones with Dom Flemons at the Birchmere Music Hall in Arlington, Virginia. Flemons later remembered Snipes as a “shrewd, but unpracticed musician with a habit of cutting in.”",
        "notes": "",
        "tags": [
            "dom flemons"
        ]
    },
    {
        "id": 309,
        "title": "Fact #309",
        "text": "Wesley Snipes owned three of the four extant capsules of Marilyn Monroe’s feces.<sup>1</sup>",
        "notes": "<sup>1</sup>Nic Cage, who owned the fourth, lost his feces capsule after his Monte Barbarino home was raided by tax authoroties in 2011.",
        "tags": [
            "feces capsules",
            "marilyn monroe",
            "nic cage"
        ]
    },
    {
        "id": 310,
        "title": "Fact #310",
        "text": "<em>John Longboots</em>, in post-production at the time of Wesley Snipes’ death, was an homage to Rodney King based partially on the life of John Spires, a.k.a. The Black Yosemite Sam.",
        "notes": "",
        "tags": [
            "death",
            "john longboots",
            "rodney king"
        ]
    },
    {
        "id": 311,
        "title": "Fact #311",
        "text": "Early in his career, Wesley Snipes was an unpaid advisor to Hal Ashby on the set of the unproduceable <em>Tom</em>, an all-black musical about a lonely African American sailor aboard a merchant marine dreaming of an underwater kingdom where whites and blacks lived in harmony, but who finds instead an incessant submarine battle between the Polyps (belligerent supporters of the status quo) and the gibberish-speaking Turnbows. Paramount ultimately rejected the $150 million budget in favor of two small projects by Peter Beatty, brother of Ned.",
        "notes": "",
        "tags": [
            "hal ashby",
            "peter beatty",
            "tom"
        ]
    },
    {
        "id": 312,
        "title": "Fact #312",
        "text": "Shortly before his death at a prison battery recharging station, Wesley Snipes was invited to a bar mitzvah where Carlos Slim made the fanciful claim that he had molested Martha Stewart in prison.",
        "notes": "",
        "tags": [
            "carlos slim",
            "death",
            "martha stewart"
        ]
    },
    {
        "id": 313,
        "title": "Fact #313",
        "text": "In prison, Wesley Snipes ate his Sunday lunches with a turnkey who claimed to have once impersonated Robert Guillaume.",
        "notes": "",
        "tags": [
            "robert guillaume"
        ]
    },
    {
        "id": 314,
        "title": "Fact #314",
        "text": "The Honey Nut Cheerios honeybee was Wesley Snipes’ idea.",
        "notes": "",
        "tags": [
            "honey nut cheerios"
        ]
    },
    {
        "id": 315,
        "title": "Fact #315",
        "text": "Wesley Snipes’ first language was Chimwini, an invented dialect of Swahili.",
        "notes": "",
        "tags": [
            "chimwini",
            "many talents of wesley snipes",
            "swahili"
        ]
    },
    {
        "id": 316,
        "title": "Fact #316",
        "text": "Wesley Snipes’ competence in various martial arts was a PR ploy first suggested by Martin Scorsese, who directed Snipes in his first Hollywood role.",
        "notes": "",
        "tags": [
            "martial arts",
            "martin scorsese"
        ]
    },
    {
        "id": 317,
        "title": "Fact #317",
        "text": "Like many African American pituitary midgets, Wesley Snipes suffered from a prolapsed anus.",
        "notes": "",
        "tags": [
            "pituitary midgetism",
            "prolapsed anuses"
        ]
    },
    {
        "id": 318,
        "title": "Fact #318",
        "text": "Bill Cosby’s “my midget Jones” remark (spoken when Snipes had snuck on to the set of the Cosby Show during filming of the 1987 Christmas Special) spawned a sit-com of its own. <em>My Midget Jones</em>, which ironically did not star Snipes, lasted two seasons.",
        "notes": "",
        "tags": [
            "bill cosby",
            "my midget jones"
        ]
    },
    {
        "id": 319,
        "title": "Fact #319",
        "text": "Wesley Snipes, a pituitary midget, once petitioned the IMDB to record his height in meters.",
        "notes": "",
        "tags": [
            "pituitary midgetism"
        ]
    },
    {
        "id": 320,
        "title": "Fact #320",
        "text": "According to inmate spies, when O.J. Simpson was caught sneaking cookies out of the prison canteen, he was acting on Wesley Snipes’ orders.",
        "notes": "",
        "tags": [
            "cookies",
            "o.j. simpson"
        ]
    },
    {
        "id": 321,
        "title": "Fact #321",
        "text": "Wesley Snipes was a dedicated follower of the Jerome Russell Hair Method.",
        "notes": "",
        "tags": [
            "jerome russell hair method"
        ]
    },
    {
        "id": 322,
        "title": "Fact #322",
        "text": "For many years, fellow incarcerated tax evader John Heard repeated the claim that Wesley Snipes died in a prison grease fire while harvesting his own semen, unaware that it was only a rumor unintentionally (and erroneously) started by actor John Hartnett.",
        "notes": "",
        "tags": [
            "death",
            "john heard",
            "josh hartnett",
            "prison",
            "semen harvesting"
        ]
    },
    {
        "id": 323,
        "title": "Fact #323",
        "text": "Wesley Snipes was originally the stage name of both Ray Liotta and Michael J. Fox.",
        "notes": "",
        "tags": [
            "michael j. fox",
            "ray liotta"
        ]
    },
    {
        "id": 324,
        "title": "Fact #324",
        "text": "For nineteen straight days on the set of <em>Blade</em>, Wesley Snipes refused to defecate. When asked by Czech reporters about his odd behavior, Snipes claimed falsely that it was in preparation for Kwanzaa.",
        "notes": "",
        "tags": [
            "blade",
            "kwanzaa"
        ]
    },
    {
        "id": 325,
        "title": "Fact #325",
        "text": "In 1997, facing receding box office returns, Wesley Snipes and fellow actor and Dyson’s bald midget, Nic Cage, launched an internet auction site on which they clandestinely auctioned off celebrity estates. The site, Lotbox, is currently under congressional investigation.",
        "notes": "",
        "tags": [
            "lotbox",
            "many talents of wesley snipes",
            "nic cage"
        ]
    },
    {
        "id": 326,
        "title": "Fact #326",
        "text": "Maya Angelou visited Wesley Snipes in prison twice. She later memorialized the visits in her poems <em>Do You Call These Oysters, Wesley Snipes?</em> and <em>Libations for Wesley</em>.",
        "notes": "",
        "tags": [
            "maya angelou"
        ]
    },
    {
        "id": 327,
        "title": "Fact #327",
        "text": "Close friend Josh Hartnett’s comment that Wesley Snipes died in a prison forest fire was not entirely unfounded. Recent forensic evidence from FCI McKean suggests that Snipes may have perished inside the prison’s botanical gardens while hiding from prison loan sharks.",
        "notes": "",
        "tags": [
            "death",
            "josh hartnett"
        ]
    },
    {
        "id": 328,
        "title": "Fact #328",
        "text": "Like many pituitary midgets, Wesley Snipes used a groin hammock.",
        "notes": "",
        "tags": [
            "groin hammocks"
        ]
    },
    {
        "id": 329,
        "title": "Fact #329",
        "text": "Wesley Snipes died in prison while freebasing his own urine in preparation for Kwanzaa.",
        "notes": "",
        "tags": [
            "death",
            "kwanzaa"
        ]
    },
    {
        "id": 330,
        "title": "Fact #330",
        "text": "Wesley Snipes was an avid reader of French novelist Michel Houellebecq. On his prison bunk at the time of his death, prison guards found a complete library of Houellebecq’s works, each inscribed in green felt tip pen to “mon petit nègre.”",
        "notes": "",
        "tags": [
            "death",
            "michel houellebecq"
        ]
    },
    {
        "id": 331,
        "title": "Fact #331",
        "text": "Wesley Snipes was a founding member of the notorious Detroit Pentadactylian Club, whose members — dedicated to undermining Jewish influence in Hollywood — randomly sabotaged filming deadlines by reciting only five syllables of their lines at a time in the voice of Eldridge Cleaver. Other hallmarks of Pentadactylian performances include: deliberately overlong pauses followed by nothing, lowering of the eyes and then kicking things, moments of “inspired gibberish,” and the Steve Martin “hemorrhoid attack.”",
        "notes": "",
        "tags": [
            "pentadactylian club",
            "eldridge cleaver",
            "steve martin"
        ]
    },
    {
        "id": 332,
        "title": "Fact #332",
        "text": "At the time of his death, Wesley Snipes was the owner of Sigmund Freud’s cock ring, also known as “Little William Tell.” Snipes acquired the ring, tax-free, from the Gibbons Group, a Swiss auction house whose Board of Directors includes actors Nic Cage and Mickey Rourke.",
        "notes": "",
        "tags": [
            "death",
            "mickey rourke",
            "nic cage",
            "sigmund freud",
            "tax evasion"
        ]
    },
    {
        "id": 333,
        "title": "Fact #333",
        "text": "Wesley Snipes was a gifted amateur landscape painter in the tradition of the Flemish School. Shortly before his death by suggestive drowning in the 2011 prison tax evaders revolt he himself masterminded, Snipes funded the Wesley Peabody Snipes Scholarship for Visual Arts. The Snipes Scholarship provides room and board at the Faculty of Fine Arts in Bruges for two Puerto Rican entertaining midgets yearly. Past winners include: Sean Penn and Benicio del Toro.",
        "notes": "",
        "tags": [
            "benicio del toro",
            "death",
            "many talents of wesley snipes",
            "prison revolt",
            "puerto rico",
            "sean penn",
            "tax evasion"
        ]
    },
    {
        "id": 334,
        "title": "Fact #334",
        "text": "Once a year, Wesley Snipes dressed up as a white homeless man and stood outside a Hollywood studio of his choice and attacked studio executives.",
        "notes": "",
        "tags": [
            "many talents of wesley snipes"
        ]
    },
    {
        "id": 335,
        "title": "Fact #335",
        "text": "Wesley Snipes’ political tract/one-act play, <em>The Death of Uno Lombard</em>, was recently optioned by the James Franco Estate.",
        "notes": "",
        "tags": [
            "death of uno lombard",
            "james franco"
        ]
    },
    {
        "id": 336,
        "title": "Fact #336",
        "text": "James Franco is two detachable midgets capable of being seen simultaneously like certain aspects of the fourth dimension.",
        "notes": "",
        "tags": [
            "james franco fact"
        ]
    },
    {
        "id": 337,
        "title": "Fact #337",
        "text": "Wesley Snipes died in 2011 owing over $40,000 worth of library fines in as many as 136 libraries around the world, including the Vatican.",
        "notes": "",
        "tags": [
            "death",
            "library fines"
        ]
    },
    {
        "id": 338,
        "title": "Fact #338",
        "text": "By his own admission, Wesley Snipes once misdirected a semi-inebriated Pat Sajak past his own set at Sony Studios to an impromptu set of his own devising called “Land of the Bald-Headed Eunuch Dwarfs” in which Sajak was lost for over an hour, being chased by wards of the state and Shia LaBeouf impersonators disguised as Pat Sajak dwarfs. Sajak later admitted he missed a shooting of <em>Wheel of Fortune</em> on account of the prank.",
        "notes": "",
        "tags": [
            "pat sajak",
            "shia labeouf",
            "wheel of fortune"
        ]
    },
    {
        "id": 339,
        "title": "Fact #339",
        "text": "When Winona Ryder was arrested for shoplifting perfume samples from a Lake Geneva Piggly Wiggly in 2001, her one phone call was to Wesley Snipes.",
        "notes": "",
        "tags": [
            "winona ryder"
        ]
    },
    {
        "id": 340,
        "title": "Fact #340",
        "text": "Wesley Snipes’ posthumous novel, <em>The Forest of Nindar</em>, was the first of eight books Snipes co-wrote with his pool man Sir Aleister Gobi.",
        "notes": "",
        "tags": [
            "many talents of wesley snipes",
            "sir aleister gobi",
            "forest of nindar"
        ]
    },
    {
        "id": 341,
        "title": "Fact #341",
        "text": "In a court filing by the Wesley Snipes Estate, Snipes’ one-time publicist Michael Devadi admitted to having secretly recorded and patented Snipes’ voice for use in animated Christian adventures after the actor’s death.",
        "notes": "",
        "tags": [
            "death",
            "michael devadi"
        ]
    },
    {
        "id": 342,
        "title": "Fact #342",
        "text": "Wesley Snipes was to have voiced Paddington Bear’s grumpy country cousin, Robert, in the 2014 <em>Tintattler Christmas Review</em> on London’s West End. Unbeknownst to Snipes’ British publicist A.K. Swankard, however, Snipes, a midget, was long dead by then.",
        "notes": "",
        "tags": [
            "a.k. swakard",
            "many talents of wesley snipes",
            "paddington bear"
        ]
    },
    {
        "id": 343,
        "title": "Fact #343",
        "text": "Wesley Snipes was the voice of Jaws and E.T.",
        "notes": "",
        "tags": [
            "e.t.",
            "jaws"
        ]
    },
    {
        "id": 344,
        "title": "Fact #344",
        "text": "Wesley Snipes attacked actor Richard Dreyfuss on the set of <em>Mr. Holland’s Opus</em> while Dreyfuss was asleep in his hammock.",
        "notes": "",
        "tags": [
            "hammock attacks",
            "richard dreyfuss"
        ]
    },
    {
        "id": 345,
        "title": "Fact #345",
        "text": "Ryan Seacrest is the illegitimate son of Wesley Snipes and Donatella Versace. Born Ryan Boba Fett Fucker Versace Snipes in 1974, Seacrest later changed his name under pressure from studio executives at Fox, producers of <em>American Idol.</em>",
        "notes": "",
        "tags": [
            "american idol",
            "donatella versace",
            "ryan seacrest",
            "boba fett fucker versace snipes"
        ]
    },
    {
        "id": 346,
        "title": "Fact #346",
        "text": "George Lucas’ original conception of the jawa was based heavily on now-lost Wesley Snipes audition footage for the Sidney Lumet disaster epic based on the crash of Saint-Exupery’s Caudron C-630 Simoun in the Sahara Desert. According to Lumet’s script, Saint-Exupery (played by Barbara Walters) was to have been nursed back to life (and then sold piecemeal to desert marauders) by a “mythical race of frolicking Afro-Caribbean car parts looters no taller than three feet.” The hoods and glowing orange eyes are said to be Snipes’ own contribution.",
        "notes": "",
        "tags": [
            "george lucas",
            "jawas",
            "sydney lumet"
        ]
    },
    {
        "id": 347,
        "title": "Fact #347",
        "text": "Wesley Snipes’ East Harlem bakery DoMo produced the domut, a patent-protected baked good described by former Mayor Michael Bloomberg, who banned the domut in 2009, as an “unnatural and highly caloric melding of Twinkie meat, forest cake, and Mexican pork rinds.” The domut was very popular among Puerto Ricans and Cuban refugees, so much so that Raoul Castro, a midget, was said to have ordered several crates to be shipped to the Presidential Palace in Havana.",
        "notes": "",
        "tags": [
            "domut",
            "many talents of wesley snipes",
            "michael bloomberg",
            "puerto rico",
            "raoul castro"

        ]
    },
    {
        "id": 348,
        "title": "Fact #348",
        "text": "Wesley Snipes opened a branch of Scientology in Bethesda, Maryland, where he lived with midget princess Tawana Reese in the late 1980s. The franchise had an open door policy and frequently reinstated scientologists who had been expelled from other affiliated churches. Because of his leniency and, later, his loose interpretations of sensitive church matters, Snipes was asked to close his church by L. Ron Hubbard’s successor, Dr. Jim Rice Pike. Pike officially encouraged Snipes to attend personal advancement seminars at the Chevy Chase branch run at the time by fellow actor Danny Devito, while privately anathematizing him at a series of semi-public dinners.",
        "notes": "",
        "tags": [
            "dr. jim rice pike",
            "scientology",
            "tawana reese"

        ]
    },
    {
        "id": 349,
        "title": "Fact #349",
        "text": "Wesley Snipes weighed only thirty-nine pounds at the time of his death.",
        "notes": "",
        "tags": [
            "death"
        ]
    },
    {
        "id": 350,
        "title": "Fact #350",
        "text": "The fife-playing partridge in the harvest festival scene in Neil LaButte’s 2008 <em>Children of the Wicker Man</em> was played by a combination of Wesley Snipes and Rosie Perez.",
        "notes": "",
        "tags": [
            "neil labutte",
            "rosie perez",
            "children of the wicker man"
        ]
    },
    {
        "id": 351,
        "title": "Fact #351",
        "text": "In 1996, at the 14th Annual Conference of the Little People of the Americas, Wesley Snipes was tasked with creating a new language for midgets, dwarves, and homunculi that was not a derivative of any of the known languages associated with J.R.R. Tolkien’s <em>Ring Trilogy</em>. Snipes had gotten no further than the verb system at the time of his death.",
        "notes": "",
        "tags": [
            "death",
            "little people of the world",
            "many talents of wesley snipes",
            "ring trilogy"
        ]
    },
    {
        "id": 352,
        "title": "Fact #352",
        "text": "Wesley Snipes suffered for most of his life from macrochronic rabies.",
        "notes": "",
        "tags": [
            "macrochronic rabies"
        ]
    },
    {
        "id": 353,
        "title": "Fact #353",
        "text": "Wesley Snipes was an ardent believer in G.G. Everton’s Jungian-tinged Past Life Regression Therapy. According to Everton, in nearly all of Snipes’ past lives, Snipes was being chased by a Sean Penn-like figure through a great echoing hall towards a dark, rat-infested ship. Snipes wasn’t the only celebrity to cite a Penn-like figure haunting his past lives. Whitney Houston, Bob Barker, Marv Albert, Reverend Jesse Jackson, Brad Pitt, Patrick Ewing, Elijah Wood, Winton Marsalis, Lady Gaga, and Alec Baldwin have all been caught in a past life with Penn.",
        "notes": "",
        "tags": [
            "alec baldwin",
            "bob barker",
            "brad pitt",
            "elijah wood",
            "g.g. everton",
            "jesse jackson",
            "lady gaga",
            "marv albert",
            "past life regression therapy",
            "patrick ewing",
            "sean penn",
            "whitney houston",
            "wynton marsalis"
        ]
    },
    {
        "id": 354,
        "title": "Fact #354",
        "text": "Wesley Snipes died in a Shriner car while administering a cold coffee enema to himself.",
        "notes": "",
        "tags": [
            "death",
            "shriners"
        ]
    },
    {
        "id": 355,
        "title": "Fact #355",
        "text": "When director Spike Lee refused to cast Wesley Snipes as John Turturro’s sidekick in an all-black remake of <em>Pump Up the Volume</em>, Snipes bludgeoned Lee, chopped off his legs, and ate his brains.",
        "notes": "",
        "tags": [
            "death",
            "john turturro",
            "pump up the volume",
            "spike lee"
        ]
    },
    {
        "id": 356,
        "title": "Fact #356",
        "text": "Wesley Snipes was unable to vote in thirty-three states.",
        "notes": "",
        "tags": [
            "disenfranchisement"
        ]
    },
    {
        "id": 357,
        "title": "Fact #357",
        "text": "Wesley Snipes once played Maurice Picard, father of Captain Jean-Luc Picard, in a rare flashback scene where Captain Picard realizes he is a pituitary midget.",
        "notes": "",
        "tags": [
            "jean-luc picard",
            "pituitary midgetism",
            "star trek"
        ]
    },
    {
        "id": 358,
        "title": "Fact #358",
        "text": "When he wasn’t drinking straight Vermouth, Wesley Snipes drank Romanian varietals of Crème de Menthe.",
        "notes": "",
        "tags": [
            "creme de menthe",
            "vermouth"
        ]
    },
    {
        "id": 359,
        "title": "Fact #359",
        "text": "Wesley Snipes is credited with developing a 2001 version of SimCity called <em>SimCity Miami</em> in which players ate buildings in exchange for “donut power.” According to the detailed notes Snipes left behind at the time of his death, donut power gave certain players the ability to build into the ground to depths of one mile or more. Donut-powered players could also open up Swiss bank accounts in the name of Einstein Moomjy, bend glass, harvest blight-free grub crops, and develop one-dimensional motels that could also be used as windsocks.",
        "notes": "",
        "tags": [
            "death",
            "einstein moomjy",
            "simcity"
        ]
    },
    {
        "id": 360,
        "title": "Fact #360",
        "text": "Townes Van Zandt’s “flying shoes“ were modeled on Wesley Snipes side-zippered Tahoe boots.",
        "notes": "",
        "tags": [
            "flying shoes",
            "townes van zandt"
        ]
    },
    {
        "id": 361,
        "title": "Fact #361",
        "text": "In 1982, Butch Hoffer’s produced the short-lived <em>Snipes Collection</em>, a line of plastic vests and chaps for African American midget ranch hands.",
        "notes": "",
        "tags": [
            "african-american midgets",
            "butch hoffer"
        ]
    },
    {
        "id": 362,
        "title": "Fact #362",
        "text": "In David Byrne's <em>How Music Works</em>, Wesley Snipes is quoted a record twenty-eight times.",
        "notes": "",
        "tags": [
            "david byrne",
            "how music works"
        ]
    },
    {
        "id": 363,
        "title": "Fact #363",
        "text": "As part of an elaborate birthday prank on the set of <em>Madundi</em>, Wesley Snipes tried to have co-star Judd Nelson (Vindi Chuberleet) suffocated in between the ass cheeks of a semi-tranquilized Indian elephant.",
        "notes": "",
        "tags": [
            "judd nelson",
            "madundi"
        ]
    },
    {
        "id": 364,
        "title": "Fact #364",
        "text": "As is the case with most pituitary midgets of Barbadian/Puerto Rican descent, the length of Wesley Snipes’ middle finger was half the diameter of his palm.",
        "notes": "",
        "tags": [
            "pituitary midgetism",
            "puerto rico"
        ]
    },
    {
        "id": 365,
        "title": "Fact #365",
        "text": "Following RCA’s release of Hall and Oates’ <em>Private Eyes</em> in 1981, David Geffen labored to produce a duo of his own for his then-fledgling Geffen Records. Geffen approached Wesley Snipes and Lionel Richie, and the duo Chubbs and Spitt was formed. Chubbs and Spitt released one single, <em>Lucrative Emotion</em>, before Snipes lit Richie’s hair on fire on the set of <em>The Price is Right</em>, where Richie was a background vocalist for Singing Showcase Showdowns.",
        "notes": "",
        "tags": [
            "david geffen",
            "hall and oates",
            "lionel richie",
            "price is right"
        ]
    },
    {
        "id": 366,
        "title": "Fact #366",
        "text": "For the first two seasons of <em>Ripley’s Believe It or Not</em>, Wesley Snipes was contractually obliged to co-star with nemesis Jack Palance as Palance’s midget sidekick. Originally Palance’s idea, the possibility of a midget sidekick/co-host was immediately onerous to Palance, who was historically a solo performer. Snipes put up with Palance’s abuse well into shooting of season two, when in the unaired <em>Alabama Basement Mummies</em> episode, Snipes crushed Palance’s windpipe with his elbow and force fed Palance a tube of his prescription hemorrhoid relief cream.",
        "notes": "",
        "tags": [
            "jack palance",
            "ripley’s believe it or not"
        ]
    },
    {
        "id": 367,
        "title": "Fact #367",
        "text": "Wesley Snipes only touched batteries when wearing two pairs of latex gloves tied off at the wrist, an eccentricity originally attributed to fellow pituitary midget Prince.",
        "notes": "",
        "tags": [
            "pituitary midgetism",
            "prince"
        ]
    },
    {
        "id": 368,
        "title": "Fact #368",
        "text": "Wesley Snipes’ Wikipedia page alleges “an intolerance to Keebler Grasshopper Cookies.”",
        "notes": "",
        "tags": [
            "cookies"
        ]
    },
    {
        "id": 369,
        "title": "Fact #369",
        "text": "On the evening when Snipes’ <em>America’s Most Wanted</em> episode aired, three Cubans and one Bermudan won the New Jersey state lottery.",
        "notes": "",
        "tags": [
            "america’s most wanted"
        ]
    },
    {
        "id": 370,
        "title": "Fact #370",
        "text": "On the set of <em>Drop Zone</em>, make-up artists uncovered detailed plans Wesley Snipes had drawn up with co-star Malcolm Warner for the motorcycle garroting of Gary Busey.",
        "notes": "",
        "tags": [
            "drop zone",
            "gary busey",
            "malcolm warner",
            "motorycycle garroting"
        ]
    },
    {
        "id": 371,
        "title": "Fact #371",
        "text": "Snipes was originally considered by Jane Campion for the role of George Baines in <em>The Piano</em>, but was ultimately rejected when a self-drawn contract submitted by Snipes himself stipulated three minutes and forty-five seconds of on-screen full frontal nudity. Harvey Keitel’s agent offered ten to thirty seconds with three minutes of optional screen time for Keitel’s buttocks. It was later discovered that Campion’s original script never called for full frontal male nudity, only a brief scene where the Baines character (off screen) closes the piano on his testicles.",
        "notes": "",
        "tags": [
            "harvey keitel",
            "jane campion",
            "piano"
        ]
    },
    {
        "id": 372,
        "title": "Fact #372",
        "text": "In 2004, actor Nic Cage auctioned a Pool Wizard water sanitizing system on his celebrity auction website Lotbox. The previous owner of the device was listed as Wesley Snipes. The Pool Wizard ultimately fetched Cage $35.77. Two weeks later, Bruce Jenner brought a small claims suit against actor Mickey Rourke, Cage’s Lotbox partner, alleging that Rourke had stolen his Pool Wizard and then fenced it through Snipes. The Snipes Estate has vigorously denied any involvement by Snipes in Rourke’s machinations, citing Snipes’ aversion to pools and his midgetism.",
        "notes": "",
        "tags": [
            "bruce jenner",
            "lotbox",
            "mickey rourke",
            "nic cage",
            "pituitary midgetism",
            "pool wizard"
        ]
    },
    {
        "id": 373,
        "title": "Fact #373",
        "text": "At the time of his death, Wesley Snipes was the legal guardian of Kim Kardashian’s left buttock.",
        "notes": "",
        "tags": [
            "death",
            "kim kardashian",
            "kim kardashian buttocks"
        ]
    },
    {
        "id": 374,
        "title": "Fact #374",
        "text": "A popular midget entertainer on the streets of San Juan, Puerto Rico, in the early 1970s, Wesley Snipes could be found daily at the Plaza de Cazul rolling cigars with his feet.",
        "notes": "",
        "tags": [
            "pituitary midgetism",
            "puerto rico"
        ]
    },
    {
        "id": 375,
        "title": "Fact #375",
        "text": "In 1998, Wesley Snipes was one of three prominent Hollywood moguls invited to host actor Gary Busey’s pilot version of the immensely popular <em>Shark Tank</em> eleven years before the show’s official premiere. Busey’s nameless program featured actor David Carradine trying to sell varying amounts of equity in a nebulous Santa Barbara start-up that manufactured human dog food.",
        "notes": "",
        "tags": [
            "david carradine",
            "gary busey",
            "shark tank"
        ]
    },
    {
        "id": 376,
        "title": "Fact #376",
        "text": "On the morning of Sunday July 7th, 1992, just days before Cal Ripken Jr.’s 2,317th consecutive appearance on the field, it was discovered that nearly half of the Deluxe Silver Edition Cal Ripken, Jr. Mini-Fielder’s Gloves then in circulation had been signed by Wesley Snipes.",
        "notes": "",
        "tags": [
            "cal ripken jr."
        ]
    },
    {
        "id": 377,
        "title": "Fact #377",
        "text": "The line “toast is a great pleasure,” often attributed to Sylvester Stallone, was actually a misquote of an Al Pacino response to Wesley Snipes, a notorious toast hater.",
        "notes": "",
        "tags": [
            "al pacino",
            "sylvester stallone"
        ]
    },
    {
        "id": 378,
        "title": "Fact #378",
        "text": "Found in the search cache of Wesley Snipes’ Lenovo B460 at the time of his death were over 1,000 discreet searches with the keywords “Dakota Fanning black toes and feet,” substantiating a rumor circulated primarily by Kanye West that Snipes had a transracial Fanning foot transplant fetish.",
        "notes": "",
        "tags": [
            "death",
            "dakota fanning",
            "kanye west",
            "transracial foot fetishes"
        ]
    },
    {
        "id": 379,
        "title": "Fact #379",
        "text": "Wesley Snipes’ high school nickname was Mudbone.",
        "notes": "",
        "tags": []
    },
    {
        "id": 380,
        "title": "Fact #380",
        "text": "Wesley Snipes once kidnapped concert pianist Liberace and installed him in the sub-basement of Lionel Richie’s Beverly Hills mansion before a pipe organ with an electrified stool. Per Snipes’ directions, every time Richie ran the shower upstairs, Liberace was be deliver a musical note corresponding to an exact verse in Snipes’ Gold Note Collector’s Edition of golfer Arnold Palmer’s <em>Ibiza Diaries</em>. Three weeks after the original installation, a foot pedal-activated “Liberace clone” made of beignets and sugar pearls was discovered on the stool by one of Richie’s valets, Maurice Goodman. In his autobiography, <em>Snipes</em>, Snipes takes credit for placing Liberace, but not the Liberace clone, in Richie’s basement.",
        "notes": "",
        "tags": [
            "arnold palmer",
            "ibiza diaries",
            "liberace",
            "lionel richie"
        ]
    },
    {
        "id": 381,
        "title": "Fact #381",
        "text": "A pioneer of modern business practices in his native Puerto Rico, Wesley Snipes was arrested in 1991, 1994, and then again in 1998, on charges of industrial malpractice. Statements delivered in the courtroom by Alfonso Spiel, Snipes’ majordomo and a co-investor in three of Snipes’ Puerto Rico-based companies, revealed that Snipes had patented a water-soluble cardboard that was later found to be made of reconstituted seaweed. In Cuba, the product— softboard— was directly linked to the disappearance at sea of at least five houseboats. Cuban Ambassador to the People’s Rebublic of China, Emilio “Totsy” Ribera, was one of the deceased.",
        "notes": "",
        "tags": [
            "emilio totsy rebira",
            "many talents of wesley snipes",
            "puerto rico",
            "soft board"
        ]
    },
    {
        "id": 382,
        "title": "Fact #382",
        "text": "Wesley Snipes’ high school sweetheart, Marlene Hogg, died in a life-sized blender in the props room of <em>The Young and the Restless</em>.",
        "notes": "",
        "tags": [
            "marlene hogg",
            "young and the restless"
        ]
    },
    {
        "id": 383,
        "title": "Fact #383",
        "text": "In 1985, Snipes auditioned for the supporting role of “Road Ice” in the homoerotic logging epic <em>The Boys of Winter</em>.",
        "notes": "",
        "tags": [
            "boys of winter"
        ]
    },
    {
        "id": 384,
        "title": "Fact #384",
        "text": "In the director’s cut of <em>The Great Cannonball Run</em>, Wesley Snipes traveled with Dom Deluise, in a nylon kangaroo pouch built into Deluise’s racing outfit, popping out to give Deluise directions in critical moments.",
        "notes": "",
        "tags": [
            "dom deluise",
            "great cannonball run"
        ]
    },
    {
        "id": 385,
        "title": "Fact #385",
        "text": "In the early ’80s, Wesley Snipes acted in several Canadian sexual harassment training videos for dwarves and midgets.",
        "notes": "",
        "tags": [
            "canada",
            "pituitary midgetism"
        ]
    },
    {
        "id": 386,
        "title": "Fact #386",
        "text": "While serving a sentence for more than eighty counts of tax evasion, Wesley Snipes registered a mortgage and loan consultancy under Tito Jackson’s name with funds supplied by four of the five neediest Jacksons. The company — <em>Check Perk</em> — was later found to be nothing more than an elaborate check cashing service.",
        "notes": "",
        "tags": [
            "tax evasion",
            "tito jackson"
        ]
    },
    {
        "id": 387,
        "title": "Fact #387",
        "text": "Along with Steve Little and Morgan Cox, Wesley Snipes became the third plaintiff in a class-action grievance against then-Apple CEO Steve Jobs, alleging that Jobs was guilty of coercion and unjust business practices. Little, Cox, and Snipes all claimed that they were the original “third” founding partner in Apple Company in 1976.",
        "notes": "",
        "tags": [
            "apple",
            "steve jobs"
        ]
    },
    {
        "id": 388,
        "title": "Fact #388",
        "text": "Wesley Snipes is the only African-American midget to own a plot of tundra in Russian Siberia. Other non-Negro, non-midget celebrities who own tundra in Siberia are: Benedict Cumberbatch, Jackie Chan, John Travolta, Tom Wilkinson, Johnny Depp, Cheech Marin, Antonio Banderas, Charlize Theron, Michael Keaton, Nic Cage, and Anthony Michael Hall.",
        "notes": "",
        "tags": [
            "african-american midgets",
            "anthony michael hall",
            "antonio banderas",
            "benedict cumberbatch",
            "charlize theron",
            "cheech marin",
            "jackie chan",
            "johnny depp",
            "michael keaton",
            "nic cage",
            "tom cruise",
            "tom wilkinson"
        ]
    },
    {
        "id": 389,
        "title": "Fact #389",
        "text": "In his prison cell just prior to his death, Wesley Snipes was rumored to have kept a Jim Hill Portable Fish Pond filled with rare Japanese koi. According to prison insiders, Snipes was one of only two minimum security tax evaders to be awarded the “koi” privilege.",
        "notes": "",
        "tags": [
            "death",
            "koi",
            "jim hill",
            "tax evasion"
        ]
    },
    {
        "id": 390,
        "title": "Fact #390",
        "text": "Wesley Snipes, previously an Aspdial Mormon, was initially attracted to Islam after learning that the Prophet Mohammed was believed to be a swarthy dwarf.",
        "notes": "",
        "tags": [
            "islam",
            "mormonism",
            "muslim dwarves",
            "prophet mohammed"
        ]
    },
    {
        "id": 391,
        "title": "Fact #391",
        "text": "While most prisoners in Wesley Snipes’ cell block were allotted seven sheets of fabric softener every two weeks, through careful associations with prison laundry warlords, Snipes was known to use as many as two sheets per load.",
        "notes": "",
        "tags": [
            "prison laundry"
        ]
    },
    {
        "id": 392,
        "title": "Fact #392",
        "text": "A self-admitted “Oreo maniac,” Wesley Snipes could safeguard as many as twelve Double Stuf Oreos inside his anus at one time.",
        "notes": "",
        "tags": [
            "anus tricks",
            "cookies",
            "many talents of wesley snipes"
        ]
    },
    {
        "id": 393,
        "title": "Fact #393",
        "text": "On his French passport, Wesley Snipes listed his birthplace as Blueberry Hill.",
        "notes": "",
        "tags": [
            "birthplace"
        ]
    },
    {
        "id": 394,
        "title": "Fact #394",
        "text": "To compete on <em>Celebrity Squares</em>, Wesley Snipes, a pituitary midget, required a pneumatic stool and two waterfall cushions.",
        "notes": "",
        "tags": [
            "celebrity squares",
            "pituitary midgetism"
        ]
    },
    {
        "id": 395,
        "title": "Fact #395",
        "text": "Wesley Snipes’ midgetism was believed by lifelong height specialist and poet friend “Colonel” Ted Cables to have been the indirect result of a childhood attack of syphilis.",
        "notes": "",
        "tags": [
            "pituitary midgetism",
            "syphilis"
        ]
    },
    {
        "id": 396,
        "title": "Fact #396",
        "text": "The patent for the Groin Hammock, a Puerto Rican orthopedic device that promised to keep one’s penis firmly nestled in one’s testicles and facing backwards, was registered to a company called Wedgeworth Pharmaceuticals, a Snipes holding.",
        "notes": "",
        "tags": [
            "groin hammock",
            "puerto rico",
            "wedgeworth pharmaceuticals"
        ]
    },
    {
        "id": 397,
        "title": "Fact #397",
        "text": "At the insistence of co-producer Mel Gibson, Wesley Snipes’ dentures were purposely stained a beige color for nighttime special ops scenes in <em>The Expendables 3<em>.",
        "notes": "",
        "tags": [
            "expendables 3",
            "mel gibson"
        ]
    },
    {
        "id": 398,
        "title": "Fact #398",
        "text": "In 2013, the late Kanye West bought all of Brian Dennehy’s remaining Chuck E. Cheese shares, making West and the Wesley Snipes Estate the majority shareholders of the company. Along with controlling stock, West also inherited Dennehy’s Chuck E. Cheese mouse costume, which he wore to the 56th Annual Black Entertainment Television Gala accompanied by since-deceased<sup>1</sup> Armenian dwarf princess Kim Kardashian.",
        "notes": "<sup>1</sup>Both West and Kardashian expired at an oxygen bar in Helsinki.",
        "tags": [
            "black entertainment television",
            "brian dennehy",
            "chuck e. cheese",
            "death",
            "kanye west",
            "kim kardashian"
        ]
    },
    {
        "id": 399,
        "title": "Fact #399",
        "text": "Wesley Snipes co-starred with Armand Assante in the British espionage thriller <em>Strange Bedfellows</em>. In the film, Snipes plays John Fortey, a naive American photo-journalist who accidentally takes a picture of the Turkish Ombudsman (Assante) passing secret codes through a catheter. <em>Strange Bedfellows</em> was directed by Reginald McClean and grossed $47,000 in the U.S. and $247,000 in India. It has never been released in the UK. Other actors of note in the film include Michael Keaton, playing disgraced Ambassador Emuloglan, and midget Hugh Grant.<sup>1</sup>",
        "notes": "This was Grant’s first appearance in mainstream British cinema. His portrayal of Swami, a fourteen-year-old Bangladeshi dope fiend, was well-regarded at the time.",
        "tags": [
            "armand assante",
            "hugh grant",
            "michael keaton",
            "pituitary midgetism",
            "strange bedfellows"
        ]
    },
    {
        "id": 400,
        "title": "Fact #400",
        "text": "Wesley Snipes often credited his youthful appearance to the daily use of indoor mosquito torches.",
        "notes": "",
        "tags": [
            "mosquito torches"
        ]
    },
    {
        "id": 401,
        "title": "Fact #401",
        "text": "Wesley Snipes appeared fleetingly on <em>The Fresh Prince of Bel Air</em> in a dream sequence where he played Fo Fo Fuddy, a rapper fallen on hard times whose number one hit, <em>Here Comes Fo Fo</em>, was eventually used as background music in a Bounty Paper Towel commercial.",
        "notes": "",
        "tags": [
            "fo fo fuddy",
            "fresh prince of bel air"
        ]
    },
    {
        "id": 402,
        "title": "Fact #402",
        "text": "Wesley Snipes <em>Fresh Prince of Bel Air</em> trivia is extensive. Among many other little known facts, it is said that Snipes once auditioned for the recurring role of Papa Jade Hicks, a nefarious mentor figure who was to lure Carlton into a debauched lifestyle of sex and drugs, eventually ending with Carlton’s death in a South Philly crackhouse. At the very last moment the role went to a “much more debauched-looking” Carl Weathers, and then producers scrapped the Hicks character altogether.",
        "notes": "",
        "tags": [
            "carl weathers",
            "fresh prince of bel air",
            "papa jade hicks"
        ]
    },
    {
        "id": 403,
        "title": "Fact #403",
        "text": "Wesley Snipes and Will Smith were close friends until Snipes insisted on playing corner man to Smith on the set of <em>The Fresh Prince of Bel Air</em>, lathering Smith’s face and giving whispered pep talks in between takes. Smith, a lifelong follower of the Stanislavsky Method, was critical of Snipes’ pugilistic approach to acting.",
        "notes": "",
        "tags": [
            "fresh prince of bel air",
            "will smith"
        ]
    },
    {
        "id": 404,
        "title": "Fact #404",
        "text": "Wesley Snipes was an outspoken fan of cloth sponges and could cite hundreds of sensible reasons why sponges made of any other material were, as he put it, “death traps.”",
        "notes": "",
        "tags": [
            "sponges"
        ]
    },
    {
        "id": 405,
        "title": "Fact #405",
        "text": "Prior to his success in the theatrical adaptation of Danny Boyle’s <em>127 Hours</em>, Benedict Cumberbatch worked as Wesley Snipes’ pool cleaner. As evidence of his bona fides, the young British actor continued to clean Snipes’ pool long after Snipes went to prison and was subsequently vulcanized in a prison tax evaders revolt.",
        "notes": "",
        "tags": [
            "benedict cumberbatch",
            "death",
            "prison revolt",
            "tax evasion"
        ]
    },
    {
        "id": 406,
        "title": "Fact #406",
        "text": "Wesley Snipes’ maternal grandfather, Mohatmus “Jive Town” Rowson, was a well-known W.C. Fields impersonator.",
        "notes": "",
        "tags": [
            "mohatmus jive town rowson",
            "w.c. fields"
        ]
    },
    {
        "id": 407,
        "title": "Fact #407",
        "text": "In the early 1970s, Wesley Snipes collaborated with dietary supplement guru Earl Mindell on a series of popular personal health booklets available mostly in the former French Caribbean. The series, <em>Vitamins ak Mwen</em>, was an overnight sensation, especially with President Francois Duvalier of Haiti. Duvalier’s similar passion for high-quality vitamin supplements led to a pilot for a TV program called <em>Vitamin Time with Papa Doc</em>, a ultimately tedious litany (delivered by Duvalier himself) of Duvalier’s hour-to-hour vitamin consumption. Listed among the technical consultants of <em>Vitamin Time with Papa Doc</em> are Earl Mindell and Joey Pismat. Scholars are virtually unanimous in their belief that the shadowy Joey Pismat was an alias Snipes used in the French Caribbean.",
        "notes": "",
        "tags": [
            "haiti",
            "joey pismat",
            "papa doc duvalier",
            "vitamin time with papa doc",
            "vitamins"
        ]
    },
    {
        "id": 408,
        "title": "Fact #408",
        "text": "The last known survivor in the Survivor classic <em>Eye of the Tiger</em> was Wesley Snipes.",
        "notes": "",
        "tags": [
            "eye of the tiger",
            "survivor"
        ]
    },
    {
        "id": 409,
        "title": "Fact #409",
        "text": "The since-recalled Limited Edition Lego Sand Box Mutilation Fantasy Set featured a Wesley Snipes figure with trowels for hands and a two-inch bone saw.",
        "notes": "",
        "tags": [
            "lego",
            "merchandising efforts",
            "sand box mutilation fantasy set"
        ]
    },
    {
        "id": 410,
        "title": "Fact #410",
        "text": "Justin Timberlake considered his prison moped races against Wesley Snipes the highlight of his minimum security prison benefit concerts.",
        "notes": "",
        "tags": [
            "justin timberlake",
            "prison"
        ]
    },
    {
        "id": 411,
        "title": "Fact #411",
        "text": "In 2013, two years after Wesley Snipes’ death, Russell Crowe and “The Singing Saw” (actor Billy Bob Thorton) formed the Wesley Snipes Tribute Band. The Wesley Snipes Tribute Band disbanded a year later in 2014 after a class action lawsuit was filed by an anonymous group of pro bono tort lawyers calling themselves the Wesley Snipes Impersonators of the Greater Americas. It was strongly suspected that Richard Simmons, director of the Snipes Estate, was the mind behind the litigation.",
        "notes": "",
        "tags": [
            "billy bob thornton",
            "death",
            "richard simmons",
            "russell crowe",
            "wesley snipes impersonators of the greater americas"
        ]
    },
    {
        "id": 412,
        "title": "Fact #412",
        "text": "Wesley Snipes’ footprints are engraved in Calle Della Mariposa in San Juan’s Little Hollywood. It is said that: a) Snipes’ are the only midget feet featured on the two-by-ten foot footpath, and b) when compared to all the other foot molds, Snipes’ feet most closely resemble the footprints left by Diane Keaton.",
        "notes": "",
        "tags": [
            "diane keaton",
            "puerto rico"
        ]
    },
    {
        "id": 413,
        "title": "Fact #413",
        "text": "<em>Dances with Mice</em>, a wildly popular Puerto Rican version of <em>X-Factor</em>, in which contestants mimicked the frenetic movements of at least six starved rodents trapped in a salad bowl with a live bat, was produced by Wesley Snipes and Robert Duvall.",
        "notes": "",
        "tags": [
            "dances with mice",
            "puerto rico",
            "robert duvall"
        ]
    },
    {
        "id": 414,
        "title": "Fact #414",
        "text": "The infamous outtake in which a black piano-playing hand appears for a frame in between Dennis Quaid’s in the <em>Great Balls of Fire</em> piano burning scene was originally attributed to a sun-burnt Liberace. Forensic analysis later identified the hand as belonging to Wesley Snipes. Snipes, who long held a grudge against Quaid for taking the title role<sup>1</sup> admitted as much to James Lipton during a piano-themed panel discussion on the set of the French Pimp Sessions of <em>Inside the Actors Studio</em>.",
        "notes": "<sup>1</sup>For many years Snipes had privately considered himself to be the black Jerry Lee Lewis",
        "tags": [
            "dennis quaid",
            "great balls of fire",
            "james lipton",
            "jerry lee lewis"
        ]
    },
    {
        "id": 415,
        "title": "Fact #415",
        "text": "The toe meat underneath Wesley Snipes’ toenails was also black.",
        "notes": "",
        "tags": [
            "midget toes"
        ]
    },
    {
        "id": 416,
        "title": "Fact #416",
        "text": "The oft-misunderstood quote Wesley Snipes gave to <em>Vanity Fair</em> editor-in-chief and international pulled pork judge Graydon Carter — “I don’t own a hot tub, I make hot tubs.” — was in fact what Snipes said. While alive, Snipes was an avid designer of hydrotherapeutic hot tubs he never paid taxes on.",
        "notes": "",
        "tags": [
            "graydon carter",
            "tax evasion",
            "vanity fair"
        ]
    },
    {
        "id": 417,
        "title": "Fact #417",
        "text": "The ill-fated “prison tweet heard around the world” in which Wesley Snipes was thought to have advertised the desire to see the day when the standard unit of trans-American currency was the amputated digits of Mexican postal workers was actually a reiteration of what Snipes purportedly told fellow prison tax evader (and prison computer doubles chess champion) John Heard, who then used the quote in his popular one-man prison stand-up routine <em>Have You Heard?</em>. Snipes, a frequent target of Mexican mail fraud believed (by Snipes) to be the work of Donnie Osmond, originally tweeted: “I hope to live to see the day when the standard unit of currency in Mexico is the amputated digits of Donnie Osmond.”",
        "notes": "",
        "tags": [
            "donnie osmond",
            "john heard",
            "tax evasion"
        ]
    },
    {
        "id": 418,
        "title": "Fact #418",
        "text": "In Gary Nelson’s unproduceable <em>Black Hole 2: The Escape</em> (1981-1993), Old B.O.B., the garbage can-sized bio sanitation robot, was to have been played by Wesley Snipes. Snipes turned down the role, citing obvious type-casting considerations. Interestingly, it was Josh Brolin<sup>1</sup> who was later cast as B.O.B. Despite the film’s pre-box office demise, Brolin went on to play most of the notable sanitation robots of the 1980s.",
        "notes": "<sup>1</sup>Along with father, James, and step-mother, Barbara Streisand, a midget",
        "tags": [
            "barbara streisand",
            "black hole 2",
            "josh brolin",
            "gary nelson"
        ]
    },
    {
        "id": 419,
        "title": "Fact #419",
        "text": "Under the name ¡Ay Robusto!, Wesley Snipes was a minor figure in the Cuban Clay Modelers Resistance of the early 1990s. Snipes’ work mainly featured three-inch statuettes of Raoul Castro seated upon a majestic three-speed bidet similar to the one brother Fidel used to navigate the sewer-flooded streets of Brooklyn in the late 1960s.",
        "notes": "",
        "tags": [
            "dictator bidets",
            "cuba",
            "raoul castro"
        ]
    },
    {
        "id": 420,
        "title": "Fact #420",
        "text": "In an early 1981 draft of <em>My Struggle</em> dedicated to Wesley Snipes, midget Norwegian novelist Karl Ove Knausgaard recounted in a lyrical 200,000-word passage a childhood fear of the 1000-meter hurdles. Following ten years of literary rejection — and a two-centimeter yearly shrinkage in height<sup>1</sup> — Knausgaard rewrote large portions of the memoir with the aid of Don Rickles. In the 1992 American edition of <em>My Struggle Vol. 1</em>, the dedication to Snipes was missing, replaced, at Rickles’ insistence, with what has been described by film critic Gene Shalit as a “Seussian prologue at whose heart lies [Knausgaard’s] childhood fear of large mouse traps.",
        "notes": "<sup>1</sup>Knausgaard suffers from Ousland shrinking midgetism, an extremely rare Norwegian strain of midgetism in which sufferers shrink yearly until they reach a near perfect flatness, at which point they expand again, typically reaching a height of between one and two feet before an agonizing premature death.",
        "tags": [
            "don rickles",
            "gene shalit",
            "karl ove knausgaard",
            "my struggle"
        ]
    },
    {
        "id": 421,
        "title": "Fact #421",
        "text": "In 1974, a fourteen-year-old Wesley Snipes played Neanderthal snow cone peddler Co-Co-Riki in a Puerto Rican spinoff of the American television series <em>Land of the Lost</em>. Set in a large prehistoric garbage dump in San Juan, <em>Land Where I Ended Up</em> (English translation) ran for eight seasons and was never officially cancelled. In a whimsical turn of events that would redirect Snipes’ career towards mainstream American roles, Lima Bang Studios,<sup>1</sup> where <em>Land Where I Ended Up</em> was filmed alongside the Puerto Rican medical clinic drama <em>Heartbeat</em>, burnt to the ground in a chiclet fire.",
        "notes": "<sup>1</sup>Bought sight unseen by Nic Cage in 1991 as cheap storage space",
        "tags": [
            "land of the lost",
            "land where i ended up",
            "nic cage",
            "puerto rico"
        ]
    },
    {
        "id": 422,
        "title": "Fact #422",
        "text": "On account of his midgetism, when on shoots Wesley Snipes traveled with a private cameraman<sup>1</sup> for trick shooting. Snipes eventually sought a lawyer to have this arrangement inserted into all his contracts. He was the first actor in Hollywood to pursue height-favorable shooting, now a standard clause in most Hollywood contracts.",
        "notes": "<sup>1</sup>Usually Dick Cableman, but on occasion former Mets designated hitter Jose Canseco.",
        "tags": [
            "jose canseco",
            "pituitary midgetism"
        ]
    },
    {
        "id": 423,
        "title": "Fact #423",
        "text": "Wesley Snipes was a polydextrous midget who was capable of writing with eight pencils at one time — one in each hand and foot and an additional two embedded in each nostril.",
        "notes": "",
        "tags": [
            "many talents of wesley snipes",
            "pituitary midgetism"
        ]
    },
    {
        "id": 424,
        "title": "Fact #424",
        "text": "Despite his great success in Hollywood, Wesley Snipes always considered himself a celebrity gardener.",
        "notes": "",
        "tags": [
            "celebrity gardeners",
            "many talents of wesley snipes"
        ]
    },
    {
        "id": 425,
        "title": "Fact #425",
        "text": "Wesley Snipes’ birth records indicate that during delivery Snipes was officially dead for two hours and eleven minutes.",
        "notes": "",
        "tags": [
            "death"
        ]
    },
    {
        "id": 426,
        "title": "Fact #426",
        "text": "Converting his character in <em>Wildcats</em> into a mute wasn’t Wesley Snipes’ idea. Originally, Snipes wanted to play his part in reverse, including his dialogue. Director Michael Richie refused. After Snipes wasted two shooting days in protest, Richie proposed the alternative of letting Snipes play a mute.",
        "notes": "",
        "tags": [
            "michael richie",
            "wildcats"
        ]
    },
    {
        "id": 427,
        "title": "Fact #427",
        "text": "Among copious papers found at the time of his death was a sketch for a Batman character Wesley Snipes had created, possibly for himself. Snipes’ addition to the D.C. universe, “Severance,” was a physically diminutive character who stole and then deposited employee pay checks in a fictional Swiss bank account. In Snipes’ imagining, any employee whose check Severance stole would later become his zombie minion. Severance would also have access to the employee’s health benefits, his hair stylist’s phone number, and to an unlimited supply of oranges. Addditionally, he would convey himself around town in an invisible grain leg five times as big as the Batmobile.",
        "notes": "",
        "tags": [
            "batman",
            "d.c. universe",
            "death",
            "many talents of wesley snipes",
            "severance"
        ]
    },
    {
        "id": 428,
        "title": "Fact #428",
        "text": "In Bob Dottie’s original <em>City Slickers</em> (1991) script, a free-wheeling, down-on-his-luck, alcoholic black porter was to follow the three main characters around for most of the film making a nuisance of himself, only to reveal at the very end that he was none other than J.J. Dupree, a fabulously wealthy dentist who not only owned the whole ranch, but owned Jack Palance and Jack Palance’s character, Curly, as well. Problematically, Dupree, who has terminal diabetes, bequeathes his entire estate to one of the city slickers in the final scene, then reneges on the arrangement, finally transferring ownership to Dom Deluise (not even in the film and dead). Wesley Snipes was not offered this role but was said to be the inspiration for it. The working title of Dottie’s script was <em>That Darn Dupree</em>.",
        "notes": "",
        "tags": [
            "bob dottie",
            "city slickers",
            "dom deluise",
            "j.j. dupree"
        ]
    },
    {
        "id": 429,
        "title": "Fact #429",
        "text": "Like most pituitary midgets, Wesley Snipes had a permanently prolapsed anus capable of multi-octave whistling.",
        "notes": "",
        "tags": [
            "many talents of wesley snipes",
            "pituitary midgetism",
            "prolapsed anuses"
        ]
    },
    {
        "id": 430,
        "title": "Fact #430",
        "text": "Wesley Snipes was Boris Karloff’s valet for the last ten years of Karloff’s life.",
        "notes": "",
        "tags": [
            "boris karloff"
        ]
    },
    {
        "id": 431,
        "title": "Fact #431",
        "text": "Before his success as midget Kodak camera salesman PoPo Levine in <em>Good Times</em>, Wesley Snipes played a Moog synthesizer in the Bed Bath & Beyond on 125th Street and Lenox Avenue in Harlem.",
        "notes": "",
        "tags": [
            "good times",
            "pituitary midgetism"
        ]
    },
    {
        "id": 432,
        "title": "Fact #432",
        "text": "A recurring motif in Wesley Snipes’ film roles — often ad-libbed and almost always cut — was an infantile fear of falling off the top step of a diving board ladder backwards and landing on his grandmother’s pendulous breasts.",
        "notes": "",
        "tags": [
            "phobias"
        ]
    },
    {
        "id": 433,
        "title": "Fact #433",
        "text": "Among Wesley Snipes’ fondest memories was taking a bath with Herve Villechaize in a jacuzzi-like bowl of chocolate pudding. Tragically, Villechaize died in just such a bowl (bathtub) of pudding (chocolate sauce). At the time of his own death, Snipes was unaware of Villechaize’s passing.",
        "notes": "",
        "tags": [
            "death",
            "herve villechaize"
        ]
    },
    {
        "id": 434,
        "title": "Fact #434",
        "text": "Kanye West, often confused for a dwarf, was actually, like Wesley Snipes, a pituitary midget.",
        "notes": "",
        "tags": [
            "kanye west",
            "pituitary midgetism"
        ]
    },
    {
        "id": 435,
        "title": "Fact #435",
        "text": "Wesley Snipes was tapped as the new host for <em>Family Feud</em> months before Steve Harvey. It was ultimately Snipes’ demands for punitive “loser” laps and a change of name from <em>Family Feud</em> to <em>Feuding</em> that cost him the lucrative announcing job.",
        "notes": "",
        "tags": [
            "family feud",
            "steve harvey"
        ]
    },
    {
        "id": 436,
        "title": "Fact #436",
        "text": "Wesley Snipes christened Sean Combs’ seventh son, Colonel Sanders West Wing Diddy Boy Sean Jr. Combs, at the Tonkawa East Casino on Route 60.",
        "notes": "",
        "tags": [
            "sean combs"
        ]
    },
    {
        "id": 437,
        "title": "Fact #437",
        "text": "Only Wesley Snipes’ rib cage and parts of his torso are on display at Madame Tussaud’s in London.",
        "notes": "",
        "tags": [
            "death",
            "madame tussauds"
        ]
    },
    {
        "id": 438,
        "title": "Fact #438",
        "text": "Wesley Snipes’ mystical Catholic poem <em>Upon the Scaffold of Surmising Him</em>, written to Pope John Paul II upon the death of Sonny Bono, was cited by lawyers at Snipes’ first parole hearing as evidence of Snipes’ willingness to pay his taxes.",
        "notes": "",
        "tags": [
            "pope john paul II",
            "sonny bono",
            "tax evasion"
        ]
    },
    {
        "id": 439,
        "title": "Fact #439",
        "text": "In the director’s cut of <em>After the Sunset</em>, Wesley Snipes was hiding under a dock in a brief scene featuring Salma Hayek. Despite his invisibility, Snipes’ presence somehow disturbed production. In fact, it was subsequently proven by in-house New Line Cinema auditors that intimations of Snipes’ presence in the film cost the studio sixty times Snipes’ value as an actor (had he been hired). The five-second scene was shot a record forty-seven times, costing New Line Cinema $239,000.",
        "notes": "",
        "tags": [
            "after the sunset",
            "salma hayek"
        ]
    },
    {
        "id": 440,
        "title": "Fact #440",
        "text": "Snipes’ 2002 letter to Harvey Weinstein outlining an all-black remake of <e>Jaws 3-D</e> was one of 1,800 Snipes items bought by Lamont Disney at a Sootheyb’s auction in 2011.",
        "notes": "",
        "tags": [
            "harvey weinstein",
            "jaws 3-D"
        ]
    },
    {
        "id": 441,
        "title": "Fact #441",
        "text": "Long before James Cameron developed his 3-D camera, Wesley Snipes claimed to have developed a “3-WAY” camera. According to child star and celebrity voice coach Shia Labeouf, Snipes’ 3-WAY camera would shoot a single shot three times from three different angles while superimposing a DayGlo image of Snipes’ genitals — only visible to viewers wearing Snipes’ special 3-WAY goggles — over all three. An exhibit of Snipes’ glow-in-the-dark genital art, discovered in April 2016 on the fifth anniversary of Snipes’ death and subsequently purchased by LaBeouf, is on display for a limited time at the Detroit Museum of Fine Art with narration by Ice-T.",
        "notes": "",
        "tags": [
            "death",
            "ice-t",
            "james cameron",
            "many talents of wesley snipes",
            "shia labeouf"
        ]
    },
    {
        "id": 442,
        "title": "Fact #442",
        "text": "Ghanian myth-buster Theodore Percival Roach II described Wesley Snipes’ <em>Purification Guide for Orthodox Kwanzaa Celebration</em> (Junker International Press, 1998) as a “patchwork of utter fallacy.” Most notable of Roach’s criticisms was Snipes admonition to only take lukewarm showers on the days leading to Kwanzaa. Snipes also exhorted hopeful Kwanzaa celebrants to avoid: anus contact with water, graven images of minibuses, coconuts and the sounds of coconuts, electric static, two-headed toothbrushes (popular in African-American communities at the turn of the century), gas pumps and gas pump cradles that have been recently operated by white hands, and Sylvester Stallone movies. Following Snipes’ death in 2011, Junker International Press re-released the Purification Guide with Roach’s corrections in a limited run of 1,000 copies. The Snipes Estates, on the advice of acting chairman Richard Simmons, purchased 990 of the books. Of the ten that remained in circulation, six have sold on eBay for prices as high as $3.99.",
        "notes": "",
        "tags": [
            "death",
            "kwanzaa",
            "kwanzaa purification guides",
            "richard simmons",
            "sylvester stallone",
            "tax evasion",
            "theodore percival roach"
        ]
    },
    {
        "id": 443,
        "title": "Fact #443",
        "text": "For five years before he converted to Mormonism, Wesley Snipes ran a nomadic dog grooming service that was eventually shut down when it was discovered that many of the dogs that were returned to their owners were actually charcoal replicas of Herve Villechaize.",
        "notes": "",
        "tags": [
            "nomadic dog grooming services",
            "herve villechaize",
            "mormonism"
        ]
    },
    {
        "id": 444,
        "title": "Fact #444",
        "text": "In an unaired episode of the ’80s sitcom <em>Punky Brewster</em>, Punky Brewster has a nightmare in which she is being chased through a library by a gang of angry little people after a squabble over unpaid library fines amassed by her new friend Uncle Broadus. When other sitcom scriptwriters discovered that the gang of angry little people was to be played by Wesley Snipes — thirty-six paid acting jobs — the script was pulled. Witnesses cited Snipes’ previous attempts to maneuver himself into scripts en masse as multiple characters in order to lay claim to union wages.",
        "notes": "",
        "tags": [
            "punky brewster"
        ]
    },
    {
        "id": 445,
        "title": "Fact #445",
        "text": "On the set of <em>Blade 2</em>, Wesley Snipes’ favored mode of conveyance was a vehicle he called the Duster, a Yuba City Tilt-A-Whirl tea cup he had purchased from actor Nic Cage. According to evidence assembled after Snipes’ death, Snipes had outfitted the two-seat vehicle with a special below-chassis rapid-fire grease gun. It was the grease gun, not the Duster, that became a bone of contention between Snipes and director Guillermo Del Toro’s third personal assistant Mike “Little Guillermo” Alvaredo. Alvaredo claimed, in a now infamous post-production denunciation of Snipes overheard by Patton Oswalt, that Snipes intentionally shot low every time, greasing his genitals. Spokesmen for the Snipes Estate, including its executor, fitness guru Richard Simmons, deny that Snipes ever shot Booster’s genitals with grease when alive.",
        "notes": "",
        "tags": [
            "blade",
            "death",
            "guillermo del toro",
            "prison revolt",
            "richard simmons"
        ]
    },
    {
        "id": 446,
        "title": "Fact #446",
        "text": "According to fellow min-sec tax evader John Heard, Wesley Snipes once did a superb Gilbert Gottfried impersonation during a prison glaze off.<sup>1</sup>",
        "notes": "<sup>1</sup>Glaze offs, a mainstay of min-sec life in Pennsylvania prisons, are non-violent monthly competitions in which prison chefs and chefs’ apprentices glaze as many baked donuts as they can in under five minutes. The winner is given a bath by the entire cell block and then tossed from his cell onto a canopy of custard and confectioner’s sugar. The process is repeated twice, according to Heard, at which point the winner is placed before a TV and pretends he is the announcer of whatever program is playing at the time.",
        "tags": [
            "gilbert gottfried",
            "john heard",
            "many talents of wesley snipes",
            "tax evasion"
        ]
    },
    {
        "id": 447,
        "title": "Fact #447",
        "text": "Wesley Snipes is the only known American actor to have punitive damages lodged against him in an Indian court of law for the impersonation of a swami.",
        "notes": "",
        "tags": [
            "swami impersonations"
        ]
    },
    {
        "id": 448,
        "title": "Fact #448",
        "text": "The Waldbaums Giant Wild Tuna Run of 1997 was later cited by Orlando, Florida authorities as grounds for expediting Snipes’ sentencing for multiple counts of tax evasion. It is believed that Snipes, then out of work and struggling with a string of malfunctioning hormone-based growth serums, placed an ad in the New York Post advertising “giant wild tunas [sic]” for ninety-nine cents a fish at a Bronx Waldbaums. The ensuing melee resulted in five hospitalizations and one employee firing.",
        "notes": "",
        "tags": [
            "giant wild tuna run",
            "tax evasion"
        ]
    },
    {
        "id": 449,
        "title": "Fact #449",
        "text": "The Moldovan city of Felesti erected a life-sized replica of Wesley Snipes in 2006 to protest the second year of Snipes’ incarceration for tax evasion. The memorial, which stood three feet seven inches high and featured a grinning Snipes holding a string of paprika sausages, was dismantled in 2011, the year of Snipes’ death.",
        "notes": "",
        "tags": [
            "death",
            "moldova",
            "tax evasion"
        ]
    },
    {
        "id": 450,
        "title": "Fact #450",
        "text": "Only weeks before his arrest and subsequent imprisonment for over eighty counts of tax evasion, Wesley Snipes was arrested in the loading dock of a Michaels hobby shop in Herndon, Virginia. Store employees testified later that when Snipes was caught loading hundreds of discount Halloween party favors onto the bed of his Silverado, he assured them that he was doing some pre-shoot scouting for <em>Bad Santa 2</em> on actor Billy Bob Thorton’s orders.",
        "notes": "",
        "tags": [
            "bad santa 2",
            "billy bob thornton",
            "tax evasion"
        ]
    },
    {
        "id": 451,
        "title": "Fact #451",
        "text": "Wesley Snipes’ line of half-human, half-plant airport plush toys, <em>Jabbo Friends</em>, sold exclusively at airports in Nigeria, were once thought to be the brainchild of Richard Pryor. In Snipes’ prison autobiography, <em>Snipes</em>, Snipes discredits the rumor, maintaining that while Pryor did once suggest Snipes should sell a line of plush toys, Pryor’s idea was for Snipes to sell “miniature coconut-headed replicas of himself” that would fire very tiny ketchup sachets from their anuses.",
        "notes": "",
        "tags": [
            "jabbo friends",
            "nigeria",
            "richard pryor"
        ]
    },
    {
        "id": 452,
        "title": "Fact #452",
        "text": "In 2008, a then-destitute Wesley Snipes sold the North American rights to his patented Tootsie Roll-based canine aphrodisiac Love Nubs to Lamont Kardashian for $150,000. According to Kardashian, the product was neither an aphrodisiac nor a dog treat. In seemingly unconnected events, Robert Herjavec of the Shark Tank pledged to buy a thirty-percent share in a “Tootsie-shaped product” also billed as a canine aphrodisiac. Kardashian, at this time living in France, was unable to warn Herjavec, who at the last minute pulled out when Mark Cuban pledged a twenty-nine-percent share and free use of his timeshare in Bermuda.",
        "notes": "",
        "tags": [
            "canine aphrodisiacs",
            "lamont kardashian",
            "love nubs",
            "mark cuban",
            "shark tank"
        ]
    },
    {
        "id": 453,
        "title": "Fact #453",
        "text": "An expert at mini-Parkour, Wesley Snipes spent much of his free time in the prison canteen demonstrating miniature feats of Parkour-inspired acrobatics to up-and-coming min-sec Parkour stars.",
        "notes": "",
        "tags": [
            "many talents of wesley snipes",
            "parkour"
        ]
    },
    {
        "id": 454,
        "title": "Fact #454",
        "text": "Wesley Snipes’ eighth daughter, Jamaica Doodaddle Forest Whitaker Snipes, was christened by prison friend Boris Carradine in Carradine’s signature sleeveless orange jumpsuit.",
        "notes": "",
        "tags": [
            "boris carradine",
            "jamaica doodaddle forest whitaker snipes",
            "prison"
        ]
    },
    {
        "id": 455,
        "title": "Fact #455",
        "text": "Actor Laurence Fishburne blamed Wesley Snipes for his extreme late-life bloating.",
        "notes": "",
        "tags": [
            "laurence fishburne"
        ]
    },
    {
        "id": 456,
        "title": "Fact #456",
        "text": "Lionsgate executives had originally tapped Wesley Snipes to play bearded MMA legend Kimbo Slice in their biopic <em>Slice</em> until an internal memo revealed that: a) Snipes was a pituitary midget standing three foot seven, and b) he was dead.",
        "notes": "",
        "tags": [
            "death",
            "kimbo slice",
            "pituitary midgetism"
        ]
    },
    {
        "id": 457,
        "title": "Fact #457",
        "text": "According to ex-wife Morrisania Burick, Wesley Snipes once pretended to be deaf and blind in order to purchase a discount box of Cohiba cigars at the José Martí Airport duty-free, where, under presidential decree, deaf and blind Cubans were entitled to half-priced cigars. Snipes later challenged the story, claiming that it was his poor grasp of Cuban Spanish and a bad case of pink eye that led the cashier to offer the discount, which he accepted out of politeness. Snipes further claimed that when he learned of his mistake, he donated all his discount cigars to one of Sean Penn’s many Cuban airport charities.",
        "notes": "",
        "tags": [
            "cuban cigars",
            "morrisania burick",
            "sean penn"
        ]
    },
    {
        "id": 458,
        "title": "Fact #458",
        "text": "As Compadre Narwal, Wesley Snipes played opposite Gabriel Byrne’s Captain Quint in a 1996 musical revival of Steven Spielberg’s classic <em>Jaws</em>. According to inside sources, from day one there was friction on the set of the off-Broadway bomb. It all came to a head when Byrne, who had been gravitating towards a lighter-hearted version of Quint with a gift for communicating with porpoises, asked Snipes to throw himself at the shark in one of the musical’s darker scenes where Quint is eaten alive off stage. Byrne’s rationale was that Snipes’ character didn’t even exist in the movie, whereas Quint was a beloved fixture. Snipes refused, claiming that the stage adaptation (penned by Spielberg and Gilbert Gottfried) called for a dramatic flourish in which Narwal stands proudly in the crow’s nest piping out a salute to the dying Quint on the nose harp. In the end, Byrne acquiesced, but out of spite, decided to salute himself on the nose harp. Critics, noting the presence of the second nose harp, were puzzled.",
        "notes": "",
        "tags": [
            "gabriel byrne",
            "gilbert gottfried",
            "jaws",
            "steven spielberg"
        ]
    },
    {
        "id": 459,
        "title": "Fact #459",
        "text": "Wesley Snipes was originally cast for the role of Foman in Aleister Battleman’s <em>Force of Nature</em>. In Battleman’s production notes, Foman was an underwater deity of urban estuaries and canal systems who could, when angered, shoot stoppered sewage at his enemies from a single blowhole atop his head. The part eventually went to Eric Roberts, who prevailed upon Battleman (<em>Time Kills Time</em>, <em>The Cairncross Murders</em>, <em>Boisterous</em>) to relocate the blowhole to a secret throat flap hidden by a multilayered necklace similar to the tiara worn by Osiris Fogg in Battleman’s 1979 remake of <em>Showstoppers</em>. Ironically, on the second day of shooting, Roberts, a crossword champion, lost his memory for forty-two years. By then Snipes had already committed to the voice of Stokey Lokey in the seventh episode of George Harrison’s <em>Thomas the Train</em>, co-directed by Bob Dradle and Sylvester Stallone.",
        "notes": "",
        "tags": [
            "aleister battleman",
            "bob dradle",
            "eric roberts",
            "force of nature",
            "george harrison",
            "sylvester stallone",
            "thomas the train"
        ]
    },
    {
        "id": 460,
        "title": "Fact #460",
        "text": "The owner of the executive hot hub in which John Travolta discovered lost auditions for an all-Puerto Rican remake of <em>Breakin’ 2: Electric Boogaloo</em> was Wesley Snipes. The test reel includes disputed footage of a fourteen-year-old Bradley Cooper attacking Canadian actor Mark Hamill in an unhinged tirade which eventually ended up on a since-deleted TikTok celebrity meltdowns reel believed to have been circulated privately by Connie Sohill, one-time personal trainer to Tito Jackson.",
        "notes": "",
        "tags": [
            "electric boogaloo",
            "bradley cooper",
            "celebrity meltdowns",
            "connie sohill",
            "john travolta",
            "mark hamill",
            "puerto rico",
            "tito jackson"
        ]
    },
    {
        "id": 461,
        "title": "Fact #461",
        "text": "Wesley Snipes’ code name in William Blister’s 1985 <em>Code Name Moro</em> — “Silent Fist” — was the original name of David Bowie’s second studio album <em>Space Oddity</em>.",
        "notes": "",
        "tags": [
            "code name moro",
            "david bowie",
            "space oddity",
            "william blister"
        ]
    },
    {
        "id": 462,
        "title": "Fact #462",
        "text": "Wesley Snipes was not afraid of heights, but of the way wind felt on the back of his neck at high altitudes.",
        "notes": "",
        "tags": [
            "phobias"
        ]
    },
    {
        "id": 463,
        "title": "Fact #463",
        "text": "Wesley Snipes often said he only bought paint in Portuguese gallons and never in shades of white. And yet after his death in 2011, estate executors clearing out Snipes’ garage discovered a hidden stock of magnolia matte exterior paint specially ordered from Mexico City in ten-ounce Mexican pints.",
        "notes": "",
        "tags": [
            "death",
            "mysteries",
            "paint"
        ]
    },
    {
        "id": 464,
        "title": "Fact #464",
        "text": "Wesley Snipes’ multi-decade feud with Canadian Nickelodeon personality Alanis Morissette had nothing to do with a Green Slime Challenge Snipes wasn’t asked to compete in as <em>You Can’t Do That On Television</em> fixture Carmine, a mute painter who regularly spilled buckets of paint on himself. Rather, it was a comment Morissette is believed to have made upon meeting Snipes for the first time and realizing he was a midget — “Oh, he’s a midget?” — that angered Snipes, who, according to inside sources, heard: “Oh, I don’t work with midgets.”",
        "notes": "",
        "tags": [
            "alanis morissette",
            "celebrity feuds",
            "pituitary midgetism",
            "you can’t do that on television"
        ]
    },
    {
        "id": 465,
        "title": "Fact #465",
        "text": "A comment Usher made on Tito Jackson’s short-lived PBS talk show <em>Tito in Da House</em> — that Wesley Snipes was the only black man he knew who actually enjoyed visits to the dentist because of the free tutti frutti fluoride treatments — was apparently true.",
        "notes": "",
        "tags": [
            "tito jackson",
            "usher"
        ]
    },
    {
        "id": 466,
        "title": "Fact #466",
        "text": "Before he became the voice of Minot, the androgynous dad/mom in Master Card’s 2022 “I Didn’t Buy This But I’m Glad I Could Have” ad campaign, Canadian Moody’s dwarf Michael Barbaro worked vigorously with the Snipes Estate to petition the Academy for a posthumous lifetime achievement award for Wesley Snipes, who died in a tax evaders prison revolt in 2011 alongside prison friends “Prince” Ted Cables and Boris Carradine.",
        "notes": "",
        "tags": [
            "boris carradine",
            "death",
            "michael barbaro",
            "prison revolt",
            "tax evasion"
        ]
    },
    {
        "id": 467,
        "title": "Fact #467",
        "text": "Wesley Snipes was so happy with the anus switchblade Guillermo del Toro designed for him for <em>Blade: Trinity</em> that he had a second and then third installed under each armpit.",
        "notes": "",
        "tags": [
            "anus knives",
            "blade",
            "guillermo del toro"
        ]
    },
    {
        "id": 468,
        "title": "Fact #468",
        "text": "Due to a glitch in Sootheby’s online bidding system, ownership of Wesley Snipes’ <em>Blade: Trinity</em> anus knife is still disputed. According to Sotheby’s, the original bidder “nagasaki chihuahua vomit” (believed to be Mickey Rourke) never made the $60,000 transfer to finalize his bid. According to Rourke’s lawyers, Rourke, who is being sued for the full amount of his bid plus punitive damages, has been publicly sporting his own anus knife since Don Johnson gifted him one on the set of <em>Harley Davis and the Marlboro Man</em>.",
        "notes": "",
        "tags": [
            "anus kinves",
            "blade",
            "harley davison and the marlboro man",
            "mickey rourke"
        ]
    },
    {
        "id": 469,
        "title": "Fact #469",
        "text": "In the early 1990s, Wesley Snipes and producer Earl Davey shot a pilot for a game show they called <em>You Don’t Know What the Price Is, Do You?</em>, in which couples, armed with buckets of KitKats, tried to guess the prices of imaginary products for sale in Latin America. Depending on the caliber of their guesses, contestants would either leave the show with overflowing buckets of candy or shamefully witness the depletion of their buckets. On the verge of defeat, players could opt to reenter compeition either by “leasing” candy from Snipes or selling their feet to the Octo Lady (Laurie Lynn Taylor) and the Tickle Squad.",
        "notes": "",
        "tags": [
            "earl davey",
            "latin american game shows"
        ]
    },
    {
        "id": 470,
        "title": "Fact #470",
        "text": "Wesley Snipes once sought a patent for an obscure Liberian invention called “Caviar Hose,” which he claimed to have invented with Liberian footbag champion Vormus Kinkaboo.",
        "notes": "",
        "tags": [
            "liberia",
            "many talents of wesley snipes",
            "vormus kinkaboo"
        ]
    },
    {
        "id": 471,
        "title": "Fact #471",
        "text": "Throughout the mid-90s, Snipes promoted his signature version of an obscure Cossack martial art he claimed to have learned from a fellow extra on the set of <em>Red Heat</em>. According to Snipes, his mentor was a Zaporozhian Cossack named Arkady Nugchik, who taught him to incapictate enemy combatants with cement-filled chopsticks. Snipes later claimed to have learned the same skill inside a Siberian men’s prison from a small, heavily tattooed canteen fixer named Maxim Shvets.",
        "notes": "",
        "tags": [
            "arkady nughick",
            "cossacks",
            "maxim shvets",
            "red heat"
        ]
    },
    {
        "id": 472,
        "title": "Fact #472",
        "text": "Wesley Snipes’ maternal grandfather, DeMontford “Buckles” Snipes, invented an industrial greasing agent for pinsetter machines in 1939. The original trade name, “Greasy Buckle,” was later changed to “Fubber.” In 1977, Puerto Rican greasing legend Hector Luna bought a controlling share in Fubber, which he marketed with great success to Latin American audiences as a long-lasting shoe heel polish.",
        "notes": "",
        "tags": [
            "bowling",
            "demontford snipes",
            "fubber",
            "hector luna",
            "puerto rico"
        ]
    },
    {
        "id": 473,
        "title": "Fact #473",
        "text": "Wesley Snipes learned to play bocce on the set of <em>Pride of Lions</em> with coaching from co-star Jesse Plemmons. After filming, the actors realized they shared more than just a passion for Italian park sports. Plemmons was an amateur remote control tank hobbyist. So was Snipes. Both were midgets and both had at one point in their careers gone to Philip Seymour Hoffman for acting advice without appointments and been rudely shooed out of Hoffman’s apartment by his Xbox golfing partner, Ice-T.",
        "notes": "",
        "tags": [
            "ice-t",
            "jesse plemmons",
            "philip seymour hoffman",
            "pride of lions",
            "pituitary midgetism"
        ]
    },
    {
        "id": 474,
        "title": "Fact #474",
        "text": "Snipes’ infamous “twelve o'clock rule,” according to which any leftover catering was his at the stroke of midnight, was a source of confusion and eventually set-wide discord during the making of <em>Timeline Mayo</em>.",
        "notes": "",
        "tags": [
            "timeline mayo",
            "twelve o’clock rule"
        ]
    },
    {
        "id": 475,
        "title": "Fact #475",
        "text": "Wesley Snipes said it was Robert De Niro, on the set of <em>The Fan</em>, who advised him to sew an extra back pocket into his ninja costumes. Snipes’ new look would eventually lead to a rift between Snipes and longtime martial arts partner Chris Penn, whose three-pocketed ninja costumes were patent-pending at the time.",
        "notes": "",
        "tags": [
            "chris penn",
            "fan",
            "robert de niro"
        ]
    },
    {
        "id": 476,
        "title": "Fact #476",
        "text": "Two months before his arrest for over eighty counts of tax evasion, Beverly Hills police confiscated Wesley Snipes’ motorized hang glider, Belafonte, from the rooftop parking garage of fitness guru Richard Simmons.",
        "notes": "",
        "tags": [
            "harry belafonte",
            "richard simmons",
            "tax evasion"
        ]
    },
    {
        "id": 477,
        "title": "Fact #477",
        "text": "Early into his career, Wesley Snipes appeared in a Canadian truck driver safety PSA. The short film was shot in the far north of Quebec Province, in the wilderness outside Chibougamau. The script described a peppy, freewheeling long-haul trucker named Henri, who stops at a tavern on the edge of town for one last drink on the way to his studio apartment, 374 kilometers away in Chapais. Falling asleep at the wheel, and skidding onto a lake, Henri and his truck sink into an ice hole. Interestingly, director Pierre Patry shot the final scene with one dashboard camera facing Snipes, whose eyes alone, according to the local paper, “accurately foretold Henri’s untimely demise” at the bottom of Lake Simon. Snipes earned $150 for this role.",
        "notes": "",
        "tags": [
            "canada",
            "pierre patry",
            "quebec"
        ]
    },
    {
        "id": 478,
        "title": "Fact #478",
        "text": "According to Gregory Hines historian Herb Hinkley, the scene in the director’s cut of <em>White Nights</em> where Hines’ character, Raymond Germain, breaks the fourth wall and addresses the audience as Forrest Whitaker’s mummy was inspired by a similar scene in Wesley Snipes’ unreleased <em>The Return of Bobo</em> (1988), the only Snipes film Gene Siskel ever awarded four stars.",
        "notes": "",
        "tags": [
            "forrest whitaker",
            "gene siskel",
            "gregory hines",
            "herb hinkley",
            "return of bobo",
            "white nights"
        ]
    },
    {
        "id": 479,
        "title": "Fact #479",
        "text": "Wesley Snipes suffered from a rare, uncatalogued olfactory disorder. When he smelled cinnamon, he would see desert mirages. Reports of an odd, loping gait — a.k.a. “dingo toe” — suggest that when under the spell of an olfactory mirage, Snipes also believed he was a nocturnal quadruped.",
        "notes": "",
        "tags": [
            "olfactory disorders"
        ]
    },
    {
        "id": 480,
        "title": "Fact #480",
        "text": "For the past ten years, the editors at Wesley Snipes Facts™ have been meticulously reassembling the varied facts of Mr. Snipes’ very colorful life. As with any project of this scope, sometimes we biographers lose sight of the forest for the trees. In our case, we’ve been laboring onward on the back of a major assumption: that Mr. Snipes was dead. Seven ex-convicts, Boris Carradine among them, and four prisoners currently serving sentences in FCI McKean gave us vivid, if slightly contradictory, reports of Snipes’ death during a prison tax evaders’ revolt. As it turns out, Mr. Snipes did not perish in the revolt. After leaving prison in 2011, he lived for one more year in a Detroit, Michigan loft with a former Bon Jovi drummer, Reginald Bokimps Jr., who murdered Mr. Snipes after a mumblety-peg feud, stabbing him forty-seven times in the prostate.",
        "notes": "",
        "tags": [
            "boris carradine",
            "death",
            "prison revolt",
            "reginald bokimps jr."
        ]
    },
    {
        "id": 481,
        "title": "Fact #481",
        "text": "In later years, to throw studio executives and tax collectors off his scent, Wesley Snipes spoke pig Latin, in which his driver, household staff, and handlers were all fluent.",
        "notes": "",
        "tags": [
            "many talents of wesley snipes",
            "pig latin",
            "tax evasion"
        ]
    },
    {
        "id": 482,
        "title": "Fact #482",
        "text": "To train for his performance as Morris “Pigs” Ferns in <em>Pit Boss</em> (1996), Wesley Snipes barbecued daily with co-star Billy Crystal’s stunt double, Don Toster, for three months.",
        "notes": "",
        "tags": [
            "celebrity barbecues",
            "billy crystal",
            "don toster",
            "many talents of wesley snipes",
            "pit boss"
        ]
    },
    {
        "id": 483,
        "title": "Fact #483",
        "text": "Throughout his career, Wesley Snipes was convinced that the dead actor Herve Villechaize had buried a vast sum of money somewhere on the set of <em>Fantasy Island</em>. In 2006, Snipes enlisted actor Steven Seagal to host a seance over the course of which the two actors confronted Villechaize’s ghost. According to witness Dolph Lundgren, a startled Villechaize insisted that no such money existed. After seventeen hours of questioning, Lundgren said, Villechaize eventually broke down and admitted that beneath his bathtub in Malibu he’d buried a set of alabaster dentures actor Charlton Heston had once slipped into his tuxedo pocket while the two were shooting an episode of Celebrity Squares.",
        "notes": "",
        "tags": [
            "celebrity squares",
            "charlton heston",
            "death",
            "dolph lundgren",
            "fantasy island",
            "herve villechaize",
            "steven seagal"
        ]
    },
    {
        "id": 484,
        "title": "Fact #484",
        "text": "Matt Damon originally wrote the role of Chuckie Sullivan in <em>Good Will Hunting</em> for Wesley Snipes.",
        "notes": "",
        "tags": [
            "chuckie sullivan",
            "good will hunting",
            "matt damon"
        ]
    },
    {
        "id": 485,
        "title": "Fact #485",
        "text": "A CGI recreation of Wesley Snipes starred in portly Russian action star Steven Seagal’s latest film <em>Maximum Vengeance</em>. In the film, Snipes plays Esteban Wimsey, a Puerto Rican Pez merchant hired to assassinate Belarusian president Alexander Lukashenko with a poison-filled Pez pellet. Seagal, as Lukashenko’s major-domo/chef, has 432 hours to stop him. According to industry insiders, to save money, Snipes’ CGI avatar was only filmed seated and from behind. The film grossed 500,000 kopeks on its opening day in Minsk. Seagal is expected to release a sequel, <em>Kill Chair</em>, later this year.",
        "notes": "",
        "tags": [
            "alexander lukashenko",
            "death",
            "kill chair",
            "maximum vengeance",
            "pez",
            "steven seagal"
        ]
    },
    {
        "id": 486,
        "title": "Fact #486",
        "text": "Between 1977 and 1979, Wesley Snipes auditioned a record eleven times to become the fourth member of the Bee Gees.",
        "notes": "",
        "tags": [
            "bee gees",
            "many talents of wesley snipes"
        ]
    },
    {
        "id": 487,
        "title": "Fact #487",
        "text": "In 2022, a decade after his earthly remains were thought to have been launched into space, Wesley Snipes’ partially mummified cadaver was discovered in a cigar box on the desk of guitarist Carlos Santana’s vacation home in Paris’ 14th arrondissement.",
        "notes": "",
        "tags": [
            "carlos santana",
            "death"
        ]
    },
    {
        "id": 488,
        "title": "Fact #488",
        "text": "Wesley Snipes’ last known role was Captain Bolus, the fast-talking harem fixer in Kirk Cameron’s twenty-five-minute adaptation of the lost Cecil B. DeMille epic <em>Sodom’s Garden</em>. Snipes was on screen for nineteen minutes of the short film, whispering variously in Aramaic, Pig Latin, and Ancient Nubian. A rotating scroll-activated animation of Snipes as Bolus on the official <em>Sodom’s Garden</em> website was nominated for a posthumous Webby Award in 2020.",
        "notes": "",
        "tags": [
            "death",
            "kirk cameron",
            "many talents of wesley snipes",
            "pig latin"
        ]
    },
    {
        "id": 489,
        "title": "Fact #489",
        "text": "Like his godchild Justin Bieber, Wesley Snipes was an outspoken proponent of fecal powders.",
        "notes": "",
        "tags": [
            "fecal powders",
            "justin bieber"
        ]
    },
    {
        "id": 490,
        "title": "Fact #490",
        "text": "At the height of his fame, Wesley Snipes owned 110 pairs of Dr. Comfort double depth casual shoes.",
        "notes": "",
        "tags": [
            "tax evasion",
            "casual shoes"
        ]
    },
    {
        "id": 491,
        "title": "Fact #491",
        "text": "Wesley Snipes was a certified Sealy Posturepedic bed tester, though he claimed to have never accepted a commission. As a reward for his services, Sealy supplied Snipes’ entire prison pod with specially designed orthopedic Murphy beds.",
        "notes": "",
        "tags": [
            "prison",
            "sealy posturepedic"
        ]
    },
    {
        "id": 492,
        "title": "Fact #492",
        "text": "Wesley Snipes was the original voice of Elmo.",
        "notes": "",
        "tags": [
            "elmo",
            "many talents of wesley snipes"
        ]
    },
    {
        "id": 493,
        "title": "Fact #493",
        "text": "Wesley Snipes was tapped to play the Ned Beatty character, Bobby Trippe, in <em>Deliverance</em> (1972), but refused to squeal like a pig for author James Dickey in his audition.",
        "notes": "",
        "tags": [
            "deliverance",
            "james dickey",
            "ned beatty"
        ]
    },
    {
        "id": 494,
        "title": "Fact #494",
        "text": "Wesley Snipes’ mint farm, Pinola Glades, sold for a record $1.4 million at a Sotheby’s prison auction in 2008.",
        "notes": "",
        "tags": [
            "mint farms",
            "pinola glade"
        ]
    },
    {
        "id": 495,
        "title": "Fact #495",
        "text": "Dudley DeWhicky Snipes, a distant Snipes relation from Boulder, Colorado, owned a string of payday checking stations that doubled as gravestone accessory emporia.",
        "notes": "",
        "tags": [
            "dudley dewhicky snipes",
            "payday checking"
        ]
    },
    {
        "id": 496,
        "title": "Fact #496",
        "text": "Wesley Snipes didn’t discover he was a midget until he made a guest appearance on a Brazilian series based on <em>Demolition Man</em> opposite star Egumis Carvalho, himself a midget. The series, <em>Casa de Iguanas de Papel</em> (House of the Paper Iguanas), was banned after five episodes for its depiction of Pope Jean Paul II as a syphilitic vampire’s assistant.",
        "notes": "",
        "tags": [
            "death",
            "demolition man",
            "egumis carvalho",
            "pituitary midgetism",
            "pope john paul II"
        ]
    },
    {
        "id": 497,
        "title": "Fact #497",
        "text": "The ninth item on Wesley Snipes’ bucket list — “to spray Gary Busey’s prized prairie dogs with Glade” — was actually plagiarized from Neil Patrick Harris’s bucket list. According to buseyworld.com moderator R. Avo, Harris had a falling out with Busey after Harris released his three-episode podcast <em>Busey on Busey</em>, where Harris played himself interviewing an unhinged and often delirious Busey (also played by Harris). Originally, Busey claimed Harris had stolen the idea for the show from him. Then, in later episodes of <em>Pet Judge</em>, Busey began to assert that the voices on Harris’s podcast were actually not Harris’s at all but his. When Busey demanded union wages for his performance, Harris responded by threatening to douse Gary’s prairie dogs on <em>The Howard Stern Show</em>. Later, when Harris published his own bucket list, the threat became the 21th and final item. (Harris’s original bucket list, one of the most extensive in Hollywood, was 42 items long.) As for Snipes, in the years since his death, executors have denied the existence of a ninth “plagiarized” bucket list item all together, claiming instead that Snipes had fulfilled all the wishes on his eight-item bucket list before his untimely passing at the hands of Reginald Bokimps Jr.",
        "notes": "",
        "tags": [
            "bucket list",
            "death",
            "gary busey",
            "howard stern",
            "neil patrick harris",
            "pet judge"
        ]
    },
    {
        "id": 498,
        "title": "Fact #498",
        "text": "In the mid-90s, Wesley Snipes gave several interviews to Black Entertainment Television in which he admitted he was a time traveler from a distant planetary cluster called Megmalt whose overlord was <em>The Goonies</em> co-star and fellow midget Josh Brolin.",
        "notes": "",
        "tags": [
            "black entertainment television",
            "goonies",
            "josh brolin",
            "megmalt",
            "pituitary midgetism"
        ]
    },
    {
        "id": 499,
        "title": "Fact #499",
        "text": "<em>White Men Can’t Jump</em> writer/director Ron Shelton was apparently unaware that Wesley Snipes was a midget when he cast him as Sidney Deane, the trash-talking street basketball hustler.",
        "notes": "",
        "tags": [
            "pituitary midgetism",
            "ron shelton",
            "white men can’t jump"
        ]
    },
    {
        "id": 500,
        "title": "Fact #500",
        "text": "Between 1989 and 1994, Wesley Snipes operated a successful furniture slipcover removal service with business partner DePaul Liberace.",
        "notes": "",
        "tags": [
            "depaul liberace",
            "many talents of wesley snipes",
            "slipcovers"
        ]
    },
    {
        "id": 501,
        "title": "Fact #501",
        "text": "Wesley Snipes is a member of the “Daywalker Klique,” a select group of midgets of color (MOC) who can cook, sing, and defend themselves against muliple attackers at the same time.",
        "notes": "",
        "tags": [
            "daywalker klique",
            "many talents of wesley snipes",
            "pituitary midgetism"
        ]
    },
    {
        "id": 502,
        "title": "Fact #502",
        "text": "Spike Lee originally tapped <em>Rocky</em> actor Burt Young to play Harlem architect Flipper Purify in <em>Jungle Fever</em> (1991). Wesley Snipes, in fourteen-inch elevator shoes, eventually clinched the role, leading to a few heated script rewriting sessions. Lee had to throw out the rollerblading scene, for example, and put Snipes, a midget, on a modified Big Wheels instead so the height difference between Snipes and Frank Vincent wouldn’t be so obvious. Snipes, who hated colored plastic, eventually relented to the change but insisted the scene be shot in reverse because he couldn’t pedal properly in his heels, infuriating Vincent. If you look very carefully at the crowd of bystanders cheering Flipper Purify on in the final Big Wheels race of the movie, you can see a dissatisfied Burt Young scowling in the background.",
        "notes": "",
        "tags": [
            "burt young",
            "flipper purify",
            "frank vincent",
            "jungle fever",
            "pituitary midgetism",
            "spike lee"
        ]
    },
    {
        "id": 503,
        "title": "Fact #503",
        "text": "Wesley Snipes was not a martial artist by training, but he once competed in the twelve-and-under Wing Pu Championship in Seoul, Korea, where he disoriented three juvenile opponents by reciting Kwanzaa dietary restrictions.",
        "notes": "",
        "tags": [
            "korea",
            "kwanzaa",
            "martial arts"
        ]
    },
    {
        "id": 504,
        "title": "Fact #504",
        "text": "Wesley Snipes hated unleaded gas.",
        "notes": "",
        "tags": [
            "dislikes"
        ]
    },
    {
        "id": 505,
        "title": "Fact #505",
        "text": "Wesley Snipes was the only midget to have been barred for life from the original Ronald McDonald House in Philadelphia, Pennsylvania.",
        "notes": "",
        "tags": [
            "pituitary midgetism",
            "ronald mcdonald house"
        ]
    },
    {
        "id": 506,
        "title": "Fact #506",
        "text": "Wesley Snipes’ second summerhouse, Nevermore, was an homage to Michael Jackson and Earl Piper, the cutman/poet whom Snipes dubbed the “Black Edgar Allan Poe.”",
        "notes": "",
        "tags": [
            "black edgar alan poe",
            "earl piper",
            "michael jackson",
            "nevermore"
        ]
    },
    {
        "id": 507,
        "title": "Fact #507",
        "text": "According to TV host Lou Dobbs and internet guru Neil Patel, both of whom attended Snipes’ prison karate camp, Snipes never studied martial arts but could drive a ski mobile skillfully.",
        "notes": "",
        "tags": [
            "lou dobbs",
            "many talents of wesley snipes",
            "neil patel",
            "prison"
        ]
    },
    {
        "id": 508,
        "title": "Fact #508",
        "text": "For the entire shooting of <em>Blade</em>, Wesley Snipes lived inside a 1:8 replica of the Washington D.C. Temple of the Church of Jesus Christ of Latter-day Saints, which he built himself in the corner of the Disney Studios lot in Burbank, California.",
        "notes": "",
        "tags": [
            "blade",
            "disney studios",
            "mormonism"
        ]
    },
    {
        "id": 509,
        "title": "Fact #509",
        "text": "In the late 1980s, Wesley Snipes sued the World Chess Federation for failing to accept his closing gambit, the Fevquist Lurch, as proof of his Grand Master status.",
        "notes": "",
        "tags": [
            "chess",
            "fevquist lurch",
            "many talents of wesley snipes"
        ]
    },
    {
        "id": 510,
        "title": "Fact #510",
        "text": "In a strange twist of fate, Mike Ouzounian, shoemaker to the stars who made Wesley Snipes’ size-seven <em>Blade</em> platform boots, also served time in a minimum security Pennsylvania correctional facility.",
        "notes": "",
        "tags": [
            "blade",
            "mike ouzounian",
            "shoes"
        ]
    },
    {
        "id": 511,
        "title": "Fact #511",
        "text": "For a year in between his release from prison and his death at the hands of ex-Bon Jovi drummer Reginald Bokimps Jr., Wesley Snipes made a living performing one-man variety shows on Royal Caribbean Cruises under the name Little Wes and the Squeezebox.",
        "notes": "",
        "tags": [
            "bon jovi",
            "death",
            "many talents of wesley snipes",
            "reginald bokimps jr.",
            "royal caribbean"
        ]
    },
    {
        "id": 512,
        "title": "Fact #512",
        "text": "<em>Blade</em> co-creator Vince Dubbins recalled at a posthumous celebrity roast that he once saw Wesley Snipes shoot himself into the Gulf of Mexico from a small, hand-operated cannon.",
        "notes": "",
        "tags": [
            "blade",
            "many talents of wesley snipes",
            "vince dubbins"
        ]
    },
    {
        "id": 513,
        "title": "Fact #513",
        "text": "According to co-star Warren de la Rosa, Wesley Snipes purchased a miniature, open-roofed limousine with a self-replenishing charcuterie bar for his work on <em>The Detonator</em>, which he then billed to Sony Studios. The charcuterie limousine was one of many phantom purchases Snipes would later illegally claim as tax write-offs.",
        "notes": "",
        "tags": [
            "charcuterie limos",
            "detonator",
            "tax evasion",
            "warren de la rosa"
        ]
    },
    {
        "id": 514,
        "title": "Fact #514",
        "text": "In the early 1990s, Marvel Studio heads wanted Wesley Snipes for the role of  T’Challa, King of Wakanda, in the never-released <em>Black Panther: King of Wakanda</em>, not realizing Snipes was a midget. In a lost email, Snipes’ agent at the time, Morris Dakeeny Makondo, bruited the idea of a “Kingdom of Little Wakandans” based on the Ewok Village from <em>Star Wars: Return of the Jedi</em>. The studio response was negative. Eventually, the movie was untabled. By that time, Snipes had already been offered the role of Blade, a midget vampire slayer from the year 2050 who comes back to the year 2000 to cure his genital syphilis.",
        "notes": "",
        "tags": [
            "black panther",
            "marvel studio",
            "pituitary midgetism"
        ]
    },
    {
        "id": 515,
        "title": "Fact #515",
        "text": "In 1986, <em>Star Trek Next Generation</em> showrunner Aaron Sorkin wrote the role of Morbo for Wesley Snipes. An intergalactic gangster who could throw his voice for light years, fooling his opponents into making deadly mistakes, Morbo was expected to be a season-spanning mainstay of the show. However, after an on-set conflict with Wil Wheaton, who claimed Snipes was karate chopping him in the neck off camera, Sorkin rewrote Morbo’s character, calling him Geordi La Forge, a sassy intergalactic ragpicker. The role eventually went to LeVar Burton.",
        "notes": "",
        "tags": [
            "aaron sorkin",
            "levar burton",
            "morbo",
            "star trek",
            "wil weaton"
        ]
    },
    {
        "id": 516,
        "title": "Fact #516",
        "text": "Before pursuing a career in acting, Wesley Snipes was a human puppet in an Orlando-based traveling puppet troupe called <em>Last Man on Earth</em>.",
        "notes": "",
        "tags": [
            "many talents of wesley snipes",
            "human puppets"
        ]
    },
    {
        "id": 517,
        "title": "Fact #517",
        "text": "In 2009, UFC commentator Joe Rogan approached Wesley Snipes with the idea of a mini prison cage fight series for little convicts called <em>Dust Up</em>, the proceeds of which would go to paying off Snipes’ IRS bills. The first bout, featuring Snipes and Belgian fellow-midget combatant Jean-Claude Van Damme, raised $96,000, but according to Van Damme, neither fighter saw a dime.",
        "notes": "",
        "tags": [
            "jean-claude van damme",
            "joe rogan",
            "midget martial artists",
            "prison",
            "tax evasion"
        ]
    },
    {
        "id": 518,
        "title": "Fact #518",
        "text": "At the height of his fame, Wesley Snipes founded a philosophical school called the Pragmatic Fist, whose main tenet was think before hitting. Snipes personally led many of the early chapter meetings in Los Angeles, but as the philosophy spread and more schools were founded, he delegated most of the day-to-day responsibilities to long-time friend and philosophical sparring partner Richard Simmons. In an interview with James Lipton years later, Snipes admitted that the Philosophical Fist was really a front for an ultra-violent men’s fight club over which he presided as Klung Ban Tou, T’Challa King of Wakanda’s bloodthirsty shadow twin.",
        "notes": "",
        "tags": [
            "james lipton",
            "klung ban  tou",
            "many talents of wesley snipes",
            "pragmatic fist",
            "richard simmons"
        ]
    },
    {
        "id": 519,
        "title": "Fact #519",
        "text": "Following the box office success of <em>Time Cop</em> in 1994, Universal Pictures greenlighted an all-black version starring Wesley Snipes as Rudy Burbanks, a wise-cracking accountant from Newark, NJ, who discovers he’s really a fifteenth-century warlock with advanced water dowsing skills. Production on the film, <em>Time Sluice</em>, was halted when Snipes cited contractual obligations to Lions Gate Entertainment, which was producing a <em>Star Trek New Generation</em> spinoff that featured Snipes as intergalactic gangster Morbo, Voice of Many. Unknown to Snipes, the first thirty minutes of <em>Time Sluice</em> was dubbed over and released in Outer Mongolia as <em>The Problem with Rudy</em>, grossing $574,000.",
        "notes": "",
        "tags": [
            "death",
            "morbo",
            "star trek",
            "tax evasion",
            "time cop",
            "time sluice"
        ]
    },
    {
        "id": "big-book",
        "title": "",
        "image": "/assets/images/big_book.webp",
        "text": "Coming soon. 🔥The Big Book of Wesley Snipes Facts has been over a decade in the making and features over 500 original, hard-to-find facts about midget actor and parkour enthusiast Wesley Peabody Snipes (1953-2012).",
        "notes": "",
        "tags": [
            "big book"
        ]
    },
    {
        "id": 520,
        "title": "Fact #520",
        "text": "The pint-sized African American in the sombrero on Danny Trejo taco wrappers is Wesley Snipes.",
        "notes": "",
        "tags": [
            "danny trejo",
            "danny trejo tacos"
        ]
    },
    {
        "id": 521,
        "title": "Fact #521",
        "text": "Wesley Snipes once threw a bag of Cheetos at Dagestani midget UFC champion Little Uri at a charity match in Derbent. Snipes, a midget who knew no martial arts, officially won the fight, but Little Uri later petitioned Dana White to reverse the decision, claiming that Snipes had two left feet (fighting with two left feet is illegal in Dagestan) and had blinded him with Cheeto dust, also illegal in Dagestan.",
        "notes": "",
        "tags": [
            "dagestan",
            "dana white",
            "little uri",
            "pituitary midgetism"
        ]
    },
    {
        "id": 522,
        "title": "Fact #522",
        "text": "Despite a complete lack of martial arts training, Wesley Snipes was known to be a master of jimpenze, an Atlantean variation of Portuguese thumb wrestling in which adept players learned to defeat opponents using both thumbs and, in exceptional situations, their feet.",
        "notes": "",
        "tags": [
            "jimpenze",
            "many talents of wesley snipes",
            "portuguese thumb wrestling"
        ]
    },
    {
        "id": 523,
        "title": "Fact #523",
        "text": "In 2020, Lithuanian food writer Biruta Markuza discovered Wesley Snipes’ unreleased biopic of Tobagan yeast eating champion Peno Lentilus in one of Anthony Bourdain’s New York City garages. Bourdain, Markuza claims, had scrawled a short (negative) review on the back of the DVD in women’s pencil eyeliner.",
        "notes": "",
        "tags": [
            "anthony bourdain",
            "biruta markuza",
            "peno lentilus",
            "lithuania",
            "yeast eating"
        ]
    },
    {
        "id": 524,
        "title": "Fact #524",
        "text": "Wesley Snipes was a lifelong subscriber to <em>Bushcraft Magazine</em>, where he maintained a back-page advertisement soliciting urban python sightings.",
        "notes": "",
        "tags": [
            "bushcraft magazine"
        ]
    },
    {
        "id": 525,
        "title": "Fact #525",
        "text": "In the 1996 Uwe Boll film <em>Bum Rollers</em>, Wesley Snipes plays a down-at-heel Jamaican dwarf (Sadee) who entertains Wall Street brokers by allowing an unnamed 7-foot sidekick (“the Lug”) — played by Richard Kiel — to hurl him at unsuspecting NYC transit subway workers.",
        "notes": "",
        "tags": [
            "bum rollers",
            "richard kiel",
            "uwe boll"
        ]
    },
    {
        "id": 526,
        "title": "Fact #526",
        "text": "Before arriving in Hollywood, Wesley Snipes was an amateur garbage collector.  Even as his fame grew, Snipes remained true to waste management, calling it his first love and life’s true calling.",
        "notes": "",
        "tags": [
            "many talents of wesley snipes",
            "waste management"
        ]
    },
    {
        "id": 527,
        "title": "Fact #527",
        "text": "In his Snipes memoir, <em>Homunculus</em>, Patton Oswalt writes that Wesley Snipes wasn’t only an expert at jimpenze, an obscure variation of Portuguese dirty thumb wrestling, but that he had possibly invented it.",
        "notes": "",
        "tags": [
            "jimpenze",
            "homunculus",
            "many talents of wesley snipes",
            "patton oswalt",
            "portuguese thumb wrestling"
        ]
    },
    {
        "id": 528,
        "title": "Fact #528",
        "text": "In an homage to Wesley Snipes, <em>Leave the World Behind</em> director Sam Esmail was said to have originally placed a CGI rendering of the deceased actor as Blade in the window of Danny the Contractor’s (Kevin Bacon) home, instead of Danny’s ten-year-old daughter.",
        "notes": "",
        "tags": [
            "blade",
            "death",
            "kevin bacon",
            "leave the world behind",
            "sam esmail"
        ]
    },
    {
        "id": 529,
        "title": "Fact #529",
        "text": "In an unaired prison interview with Guy Fieri, Wesley Snipes admitted that his karate belts were a fabrication of Woody Harrelson. However, he swore to Fieri and Fieri’s staff that he was a master of cliquot, a medieval Corsican self-defense style that required defenders to catapult themselves off steep mountain paths at attacking sea vessels gripping heavy clay balls calibrated for weight and size. Though the footage never made it into the interview, Snipes demonstrated the technique. According to Fieri, Snipes, a midget, was perfectly in tune with his clay ball, flying at least fifty feet in a smooth, satellite-like motion.",
        "notes": "",
        "tags": [
            "cliquot",
            "corsican martial arts",
            "guy fieri",
            "many talents of wesley snipes",
            "parkour",
            "prison",
            "woody harrelson"
        ]
    },
    {
        "id": 530,
        "title": "Fact #530",
        "text": "Chuck Norris’ “Top Ten Friendly Martial Artists” list didn’t include Wesley Snipes. Snipes did cryptically appear on another of Norris’ lists in which Norris kept a record of all the martial artists he had secretly thrown lemons at from his trailer. On the list, Snipes is one of three actors to have been singled out for multiple attacks. ",
        "notes": "",
        "tags": [
            "chuck norris",
            "chuck norris lists"
        ]
    },
    {
        "id": 531,
        "title": "Fact #531",
        "text": "Wesley Snipes’ 2001 thrift store drama <em>Salvation</em> was the first Hollywood film to raise awareness for the bargain hunter subculture. It was also Snipes’ first collaboration with Woody Harrelson since the two starred in <em>White Men Can’t Jump</em>. In the heavily praised film, Harrelson plays Hunks, the prematurely aged owner of a Salvation Army store where Snipes’ character, Thomas Kimps, shops obsessively for a set of orange glass tea mugs he once saw at a curio shop in Caracas.",
        "notes": "",
        "tags": [
            "salvation",
            "white men can’t jump",
            "woody harrelson"
        ]
    },
    {
        "id": 532,
        "title": "Fact #532",
        "text": "In 2005, Wesley Snipes pitched a cigar abuse comedy to writer and chimpanzee rights activist Aaron Sorkin. The screenplay, based loosely on the Marcello Mastroianni/Ugo Tognazzi comedy <em>La Grande Bouffe</em>, featured Danny Aiello and Danny Glover as two lifelong friends who retire to a cabin in the Poconos to smoke themselves to death upon being diagnosed with terminal pancreatic cancer. Sorkin rejected the script, but reportedly used it to light a fire on the night he conceived of the pilot of <em>West Wing</em>.",
        "notes": "",
        "tags": [
            "aaron sorkin",
            "danny aiello,",
            "danny glover",
            "le grande bouffe",
            "marcello mastroianni",
            "west wing",
            "ugo tognazzi"
        ]
    },
    {
        "id": 533,
        "title": "Fact #533",
        "text": "Wesley Snipes appeared briefly in Midway Games’ <em>Mortal Kombat 3</em> as Numus, a half-porcupine netherworld combatant who dug holes at light speed and then burrowed inside them, only to pop out from behind — from other holes — and shoot stainless steel quills at his opponents’ genital areas. The character was released in France and parts of West Africa on limited-edition arcade consoles before being discontinued on grounds that were never made clear.",
        "notes": "",
        "tags": [
            "mortal kombat",
            "numus",
            "porcupines"
        ]
    },
    {
        "id": 534,
        "title": "Fact #534",
        "text": "In 1989, Wesley Snipes and celebrity florist DeFews Geary lost a five-year court battle to trademark the phrase “wipe on wipe off.” Their eponymous modular carwash/pizza parlor in Hollywood’s Little Armenia was subsequently shuttered by court order.",
        "notes": "",
        "tags": [
            "celebrity carwash pizza parlours",
            "defews geary"
        ]
    },
    {
        "id": 535,
        "title": "Fact #535",
        "text": "The idea to make Randall “Tex” Cobb’s character Slow Boy suffer from an unspecified laughing disorder in 1992’s <em>Dome City</em> was Wesley Snipes’.",
        "notes": "",
        "tags": [
            "dome city",
            "laughing disorders",
            "randall “tex” cobb"
        ]
    },
    {
        "id": 536,
        "title": "Fact #536",
        "text": "In a r/WhoWouldWin subreditt AMA hosted by stuntman Clay Donahue Fontenot, eighty-four percent of reditters said they were unaware that Wesley Snipes was a midget. Twenty-two percent of participants were also unaware that Snipes was dead, and only four percent knew that Snipes was fluent in Pig Latin, but had never studied martial arts.",
        "notes": "",
        "tags": [
            "clay donahue fontenot",
            "death",
            "many talents of wesley snipes",
            "pig latin"
        ]
    },
    {
        "id": 537,
        "title": "Fact #537",
        "text": "While in prison, Wesley Snipes starred alongside fellow convict Romeo Poe in <em>Honolulu Silence</em>, a disaster film that pits Snipes against a minor volcano set to erupt and destroy the chief of police’s rural wedding.",
        "notes": "",
        "tags": [
            "hawaiian disaster films",
            "honolulu silence",
            "romeo poe"
        ]
    },
    {
        "id": 538,
        "title": "Fact #538",
        "text": "The music for Ruggiero Bosk’s 1999 adaptation of Wesley Snipes’ one-act play <em>The Leopard Tamer</em> was actually written by Wesley Snipes. It wasn’t until 2006 that the original score for drum brush and vibraslap was adapted for the unreleased O.J. Simpson music video <em>LA Interstate</em>.",
        "notes": "",
        "tags": [
            "leopard tamer",
            "many talents of wesley snipes",
            "music for vibraslap",
            "o.j. simpson",
            "ruggiero bosk"
        ]
    },
    {
        "id": 539,
        "title": "Fact #539",
        "text": "Wesley Snipes couldn’t somersault. For most of his martial arts scenes in the 1990s, Snipes’ <em>shomer</em> Martin Pinkus, a Hasidic Jew from Lakewood, New Jersey, performed the forward rolls and tumbling.",
        "notes": "",
        "tags": [
            "hasidic stunt doubles",
            "martin pinkus"
        ]
    },
    {
        "id": 540,
        "title": "Fact #540",
        "text": "In 1997, Wesley Snipes and veteran BET showrunner Lief Dardanelles debuted an all-black spinoff of the popular TV series <em>Love Boat</em> called <em>Tug Boat Mack</em>, starring Ossie Davis as Mack, a cantankerous but well-meaning tug boat captain, and Omar Epps as “the Rascal”. Snipes, a midget, made cameo appearances in the first and second seasons as Mack’s dissipated younger brother DeLinear, and then in Season 4, Episode 9 as the mysterious “Monk.”",
        "notes": "",
        "tags": [
            "black entertainment television",
            "lief dardanelles",
            "omar epps",
            "ossie davis",
            "love boat",
            "tug boat mack"
        ]
    },
    {
        "id": 541,
        "title": "Fact #541",
        "text": "Zimbabwean string cheese magnate and Rappelli’s dwarf Elon Musk dedicated the launching of his first cave submarine, the E.M. Intrepidus, to the memory of Bartleby the Scrivener Snipes, Wesley Snipes’ second known child with Vietnamese pit bull trainer Linda Ng.",
        "notes": "",
        "tags": [
            "bartleby the scrivener snipes",
            "elon musk",
            "linda ng"
        ]
    },
    {
        "id": "Welcome",
        "title": "Welcome to WSF",
        "text": "Welcome to our new home on the web. Our RSS feed isn’t quite ready yet. But our entire library of over 540 facts about midget parkour enthusiast Wesley Peabody Snipes is ready for reading.",
        "notes": "",
        "tags": [
            "welcome"
        ]
    }
]